Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: Take test and get results
km: ធ្វើតេស្តនិងទទួលបានលទ្ធផល

source: Submit
km: ដាក់រេកាមបង្គាប់

source: Continue
km: បន្ដ

source: 10-15 minutes
km: 10-15 នាទី

source: Tell us about yourself
km: ប្រាប់យើងអំពីខ្លួនអ្នក

source: Tell us about your education
km: ប្រាប់យើងអំពីការអប់រំរបស់អ្នក

source: Choose your preferred program and schedule
km: ជ្រើសរើសកម្មវិធីនិងកាលវិភាគដែលអ្នកពេញចិត្ត

source: Review Your Application
km: ពិនិត្យមើលពាក្យសុំរបស់អ្នក

source: Please review your information before submitting
km: សូមពិនិត្យមើលព័ត៌មានរបស់អ្នកមុនពេលដាក់ស្នើ

source: There was an error processing your application. Please try again.
km: មានកំហុសដំណើរការពាក្យសុំរបស់អ្នក។ សូមព្យាយាមម្តងទៀត។

source: Your application requires additional review. Our staff will contact you shortly.
km: ពាក្យសុំរបស់អ្នកត្រូវការការពិនិត្យបន្ថែម។ បុគ្គលិករបស់យើងនឹងទាក់ទងអ្នកឆាប់ៗនេះ។

source: Application submitted successfully! Please proceed with payment.
km: ពាក្យសុំដែលបានដាក់ស្នើដោយជោគជ័យ! សូមបន្តការបង់ប្រាក់។

source: There was an error submitting your application. Please try again.
km: មានកំហុសក្នុងការបញ្ជូនពាក្យសុំរបស់អ្នក។ សូមព្យាយាមម្តងទៀត។

source: No active application found. Please start a new application.
km: រកមិនឃើញកម្មវិធីសកម្មទេ។ សូមចាប់ផ្តើមកម្មវិធីថ្មី។

source: Application not found. Please start a new application.
km: រកមិនឃើញកម្មវិធី។ សូមចាប់ផ្តើមកម្មវិធីថ្មី។

source: Complete your ${amount} test fee payment
km: បំពេញការទូទាត់ថ្លៃថាំក្នុងទឹកប្រាក់ $ របស់អ្នក

source: Application completed successfully! Please bring your payment to our office.
km: ការដាក់ពាក្យសុំបានបញ្ចប់ដោយជោគជ័យ! សូមយកការទូទាត់របស់អ្នកទៅការិយាល័យរបស់យើង។

source: There was an error processing your payment information. Please try again.
km: មានកំហុសដំណើរការព័ត៌មានទូទាត់របស់អ្នក។ សូមព្យាយាមម្តងទៀត។

source: Access denied. You can only view your own application.
km: ការចូលដំណើរការបានបដិសេធ។ អ្នកអាចមើលតែកម្មវិធីផ្ទាល់ខ្លួនរបស់អ្នកប៉ុណ្ណោះ។

source: Application approved. Student can proceed with testing.
km: កម្មវិធីដែលបានអនុម័ត។ និស្សិតអាចបន្តធ្វើតេស្តបាន។

source: Error processing approval. Please try again.
km: កំហុសក្នុងដំណើរការការអនុម័តការយល់ព្រម។ សូមព្យាយាមម្តងទៀត។

source: Application blocked due to confirmed duplicate.
km: ការដាក់ពាក្យសុំត្រូវបានរារាំងដោយសារតែការចម្លងដែលបានបញ្ជាក់។

source: Application marked for manual review.
km: ពាក្យសុំត្រូវបានសម្គាល់សម្រាប់ការពិនិត្យឡើងវិញដោយដៃ។

source: Error processing review. Please try again.
km: ការពិនិត្យឡើងវិញដំណើរការដំណើរការ។ សូមព្យាយាមម្តងទៀត។

source: Payment status updated successfully.
km: ស្ថានភាពទូទាត់បានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ។

source: Error updating payment status. Please try again.
km: កំហុសក្នុងការធ្វើបច្ចុប្បន្នភាពស្ថានភាពទូទាត់។ សូមព្យាយាមម្តងទៀត។

source: Device ID
km: លេខសម្គាល់ឧបករណ៍

source: Unique identifier for the mobile device
km: អ្នកកំណត់អត្តសញ្ញាណពិសេសសម្រាប់ឧបករណ៍ចល័ត

source: Token ID
km: លេខសម្គាល់ថូខឹន

source: JWT token ID (jti claim)
km: លេខសម្គាល់ JWT Token (អះអាង JTI)

source: Expires At
km: ផុតកំណត់នៅ

source: When the token expires
km: នៅពេលថូខឹនផុតកំណត់

source: Last Used
km: បានប្រើចុងក្រោយ

source: When the token was last used for an API call
km: នៅពេលនិមិត្តសញ្ញាត្រូវបានប្រើចុងក្រោយសម្រាប់ការហៅ API

source: Revoked
km: រេសាករក

source: Whether the token has been revoked
km: ថាតើនិមិត្តសញ្ញាត្រូវបានដកហូតវិញឬអត់

source: Mobile Auth Token
km: ទូរស័ព្ទដៃអ៊ែតធីង

source: Mobile Auth Tokens
km: Mobile Auth Token

source: Success
km: ចោកច័យ

source: Failed - Invalid Google Token
km: បានបរាជ័យ - ហ្គូហ្គលថូខឹនមិនត្រឹមត្រូវ

source: Failed - Invalid Email Domain
km: បានបរាជ័យ - ដែនអ៊ីម៉ែលមិនត្រឹមត្រូវ

source: Failed - Student Not Found
km: បានបរាជ័យ - រកមិនឃើញរបស់សិស្ស

source: Failed - Rate Limited
km: បានបរាជ័យ - អត្រាមានកំណត់

source: Email address used in authentication attempt
km: អាសយដ្ឋានអ៊ីមែលត្រូវបានប្រើក្នុងការប៉ុនប៉ងផ្ទៀងផ្ទាត់ភាពត្រឹមត្រូវ

source: Device identifier if available
km: ឧបករណ៍កំណត់អត្តសញ្ញាណឧបករណ៍ប្រសិនបើមាន

source: IP address of the authentication attempt
km: អាសយដ្ឋាន IP នៃការប៉ុនប៉ងផ្ទៀងផ្ទាត់ភាពត្រឹមត្រូវ

source: Browser/app user agent string
km: កម្មវិធីរុករក / ភ្នាក់ងារភ្នាក់ងារភ្នាក់ងារអ្នកប្រើប្រាស់

source: Result of the authentication attempt
km: លទ្ធផលនៃការប៉ុនប៉ងផ្ទៀងផ្ទាត់ភាពត្រឹមត្រូវ

source: Student ID
km: លេខសម្គាល់និស្សិត

source: Student ID if authentication was successful
km: លេខសម្គាល់និស្សិតប្រសិនបើការផ្ទៀងផ្ទាត់ភាពត្រឹមត្រូវទទួលបានជោគជ័យ

source: Detailed error message if authentication failed
km: សារកំហុសលម្អិតប្រសិនបើការផ្ទៀងផ្ទាត់បានបរាជ័យ

source: Mobile Auth Attempt
km: ការប៉ុនប៉ងចល័តចល័ត

source: Mobile Auth Attempts
km: ការព្យាយាមទូរស័ព្ទដៃ

source: Check this if legal name differs from preferred name
km: ធីកវាប្រសិនបើឈ្មោះស្របច្បាប់ខុសគ្នាពីឈ្មោះដែលពេញចិត្ត

source: Legal family name (if different from preferred)
km: ឈ្មោះគ្រួសារស្របច្បាប់ (បើខុសគ្នាពីចំណូលចិត្ត)

source: Legal personal name (if different from preferred)
km: ឈ្មោះផ្ទាល់ខ្លួនស្របច្បាប់ (ប្រសិនបើខុសគ្នាពីចំណូលចិត្ត)

source: Select an existing person or create new below
km: ជ្រើសរើសមនុស្សដែលមានស្រាប់ឬបង្កើតថ្មីខាងក្រោម

source: Check to create a new person record
km: ពិនិត្យដើម្បីបង្កើតកំណត់ត្រាបុគ្គលថ្មី

source: 5-digit unique student identifier
km: អ្នកកំណត់អត្តសញ្ញាណនិស្សិត 5 ខ្ទង់

source: Check if student is a monk (special scheduling considerations apply)
km: ពិនិត្យមើលថាតើសិស្សគឺជាព្រះសង្ឃ (ការពិចារណាកាលវិភាគពិសេសអនុវត្ត)

source: Check if student transferred from another institution
km: ពិនិត្យមើលថាតើនិស្សិតផ្ទេរពីស្ថាប័នមួយផ្សេងទៀត

source: You must either select an existing person or create a new one.
km: អ្នកត្រូវតែជ្រើសរើសមនុស្សដែលមានស្រាប់ឬបង្កើតថ្មី។

source: You cannot both select an existing person and create a new one.
km: អ្នកទាំងពីរមិនអាចជ្រើសរើសមនុស្សដែលមានស្រាប់និងបង្កើតថ្មីបានទេ។

source: This field is required when creating a new person.
km: វាលនេះត្រូវបានទាមទារនៅពេលបង្កើតមនុស្សថ្មី។

source: Select the new status for this student
km: ជ្រើសរើសស្ថានភាពថ្មីសម្រាប់សិស្សនេះ

source: Date when this status change takes effect
km: កាលបរិច្ឆេទនៅពេលការផ្លាស់ប្តូរស្ថានភាពនេះមានប្រសិទ្ធិភាព

source: Additional notes about this status change
km: កំណត់សំគាល់បន្ថែមអំពីការផ្លាស់ប្តូរស្ថានភាពនេះ

source: Send Email Notification
km: ផ្ញើការជូនដំណឹងអ៊ីមែល

source: Send notification to student about status change
km: ផ្ញើការជូនដំណឹងដល់សិស្សអំពីការផ្លាស់ប្តូរស្ថានភាព

source: Check if this is the primary emergency contact
km: ពិនិត្យមើលថាតើនេះជាទំនាក់ទំនងបន្ទាន់ទេ

source: Optional secondary phone number
km: ជម្រើសទូរស័ព្ទអនុវិទ្យាល័យស្រេចចិត្ត

source: Phone number must be 8-15 digits in international format. Use + followed by country code and number (e.g., +85512345678), or local format starting with a non-zero digit.
km: លេខទូរស័ព្ទត្រូវតែមាន 8-15 ខ្ទង់ក្នុងទ្រង់ទ្រាយអន្តរជាតិ។ ការប្រើប្រាស់ + អមដោយលេខកូដប្រទេសនិងលេខ (ឧ។ + +8551234568) ឬទ្រង់ទ្រាយក្នុងស្រុកចាប់ផ្តើមដោយលេខមិនមែនសូន្យ។

source: Male
km: របុស

source: Female
km: នៃស្រ្ដី

source: Non-Binary/Other
km: មិនមានគោលពីរ / ផ្សេងទៀត

source: Prefer not to say
km: មិនចង់និយាយ

source: Family Name
km: ឈ្មោះគ្រួសារ

source: Personal Name
km: ឈ្មោះផ្ទាល់ខ្លួន

source: Full Name
km: ឈ្មោះពេញ

source: Use Legal Name for Documents
km: ប្រើឈ្មោះស្របច្បាប់សម្រាប់ឯកសារ

source: Use alternate (legal) name instead of preferred name on official documents
km: ប្រើឈ្មោះជំនួស (ច្បាប់) ជំនួសឱ្យឈ្មោះដែលពេញចិត្តក្នុងឯកសារផ្លូវការ

source: Legal Family Name
km: ឈ្មោះគ្រួសារស្របច្បាប់

source: Family name to be used for official documents
km: ឈ្មោះគ្រួសារដែលត្រូវប្រើសម្រាប់ឯកសារផ្លូវការ

source: Legal Personal Name
km: ឈ្មោះផ្ទាល់ខ្លួនស្របច្បាប់

source: Personal name to be used for official documents
km: ឈ្មោះផ្ទាល់ខ្លួនដែលត្រូវប្រើសម្រាប់ឯកសារផ្លូវការ

source: Legal Khmer Name
km: ឈ្មោះខ្មែរស្របច្បាប់

source: Khmer name to be used for official documents
km: ឈ្មោះខ្មែរដែលត្រូវប្រើសម្រាប់ឯកសារផ្លូវការ

source: Legal Gender
km: ភេទច្បាប់

source: Gender to be used on official documents
km: យេនឌ័រដែលត្រូវប្រើនៅលើឯកសារផ្លូវការ

source: Photo
km: រូបថត

source: School Email
km: អ៊ីមែលសាលា

source: Personal Email
km: អ៊ីមែលផ្ទាល់ខ្លួន

source: Province of birth (for Cambodian citizens) or International for non-Cambodian citizens
km: ខេត្តកំណើត (សម្រាប់ពលរដ្ឋកម្ពុជា) ឬអន្តរជាតិសម្រាប់ពលរដ្ឋមិនមែនកម្ពុជា

source: Citizenship
km: ផាបចាបលរដ្ឋ

source: People
km: របចារាស្រ្ដ

source: Cambodian birth province not valid for non-Cambodian citizens. Use 'International' instead.
km: ប្រទេសកំណើតរបស់ជនជាតិខ្មែរមិនមានសុពលភាពសម្រាប់ពលរដ្ឋដែលមិនមែនជាជនជាតិខ្មែរទេ។ ប្រើ 'អន្តរជាតិ' ជំនួសវិញ។

source: Alternate (Legal) name must be provided if 'use_legal_name_for_documents' is selected.
km: ឈ្មោះជំនួស (ច្បាប់) ត្រូវតែផ្តល់ប្រសិនបើ 'use_legal_name_for_documents' ត្រូវបានជ្រើសរើស 'ត្រូវបានជ្រើស> ។

source: Frozen
km: ដេលកេធេវីអាេយកក

source: Morning
km: បេលរបឹក

source: Afternoon
km: រស្យេល

source: Evening
km: បេលលាច

source: Is a Monk
km: គឺជាព្រះសង្ឃមួយ

source: Is Transfer Student
km: គឺការផ្ទេរនិស្សិត

source: Indicates student transferred from another institution
km: បង្ហាញពីសិស្សផ្ទេរពីស្ថាប័នមួយផ្សេងទៀត

source: Current Status
km: ស្ថានភាពបច្ចុប្បន្ន

source: Study Time Preference
km: ចំណូលចិត្តពេលវេលាសិក្សា

source: Preferred time of day for classes
km: ពេលវេលាដែលចូលចិត្តនៃថ្ងៃសម្រាប់ថ្នាក់

source: Last Enrollment Date
km: កាលបរិច្ឆេទចុះឈ្មោះចុងក្រោយ

source: Student Profile
km: ប្រវត្តិនិស្សិត

source: Student Profiles
km: ប្រវត្តិរូបរបស់សិស្ស

source: On Leave
km: នៅពេលចាកចេញ

source: Date when employment started
km: កាលបរិច្ឆេទនៅពេលការងារចាប់ផ្តើម

source: Date when employment ended (if applicable)
km: កាលបរិច្ឆេទនៅពេលការងារបញ្ចប់ (បើមាន)

source: Teacher Profile
km: ប្រវត្តិគ្រូ

source: Teacher Profiles
km: ទម្រង់របស់គ្រូ

source: Leave of absence started
km: ការឈប់សម្រាកនៃអវត្តមានបានចាប់ផ្តើម

source: Returned from leave
km: ត្រឡប់មកពីការឈប់សម្រាក

source: Role Change
km: ការផ្លាស់ប្តូរតួនាទី

source: Leave of Absence
km: ការឈប់សម្រាកនៃអវត្តមាន

source: Profile Update
km: ធ្វើឱ្យទាន់សម័យទម្រង់

source: Action
km: កិច្ច

source: Timestamp
km: ត្រាធី

source: Details
km: ព័ត៌មានលំអិត

source: Record of event details (e.g., old/new status, role)
km: កំណត់ត្រាព័ត៌មានលម្អិតអំពីព្រឹត្តិការណ៍ (ឧ។ ស្ថានភាពចាស់ / ថ្មីតួនាទី)

source: Person Event Log
km: កំណត់ហេតុព្រឹត្តិការណ៍របស់បុគ្គល

source: Person Event Logs
km: កំណត់ហេតុព្រឹត្តិការណ៍របស់បុគ្គល

source: Leave of absence recorded
km: ការឈប់សម្រាកនៃការអវត្តមានបានកត់ត្រាទុក

source: Create
km: បង្កើត

source: Update
km: ធេវីអាេយយរមយរ

source: Merge
km: រយបរយមក្នា

source: Enrollment Change
km: ការផ្លាស់ប្តូរការចុះឈ្មោះ

source: Academic Progression
km: ការវឌ្ឍនភាពសិក្សា

source: Other Change
km: ការផ្លាស់ប្តូរផ្សេងទៀត

source: Changes
km: ការផ្លាស់ប្តូរ

source: Record of what changed (e.g., old/new values, reason)
km: កំណត់ត្រានៃអ្វីដែលបានផ្លាស់ប្តូរ (ឧ។ តម្លៃចាស់ / ថ្មីហេតុផល)

source: Related Object Type
km: ប្រភេទវត្ថុដែលទាក់ទង

source: Related Object ID
km: លេខសម្គាល់វត្ថុដែលទាក់ទង

source: Status changed
km: បានផ្លាស់ប្តូរស្ថានភាព

source: Monk status changed
km: ស្ថានភាពព្រះសង្ឃបានផ្លាស់ប្តូរ

source: Phone number in international format (e.g., +85512345678) or local format. Must be 8-15 digits.
km: លេខទូរស័ព្ទក្នុងទំរង់អន្តរជាតិ (ឧ។ + +85512345688) ឬទ្រង់ទ្រាយក្នុងស្រុក។ ត្រូវតែមាន 8-15 ខ្ទង់។

source: Can include multiple numbers separated by commas or slashes
km: អាចរួមបញ្ចូលលេខជាច្រើនដែលបំបែកដោយសញ្ញាក្បៀសឬសញ្ញា

source: Sick Leave
km: ការឈប់សម្រាកឈឺ

source: Personal Leave
km: ការឈប់សម្រាកផ្ទាល់ខ្លួន

source: Emergency
km: អាសន្ន

source: Family Emergency
km: ភាពអាសន្នក្នុងគ្រួសារ

source: Medical Appointment
km: ការតែងតាំងវេជ្ជសាស្រ្ត

source: Teacher requesting leave
km: ការស្នើសុំឈប់សម្រាកគ្រូ

source: Leave Date
km: ថ្ងៃសម្រាក

source: Date when teacher will be absent
km: កាលបរិច្ឆេទនៅពេលដែលគ្រូនឹងអវត្តមាន

source: Leave Type
km: ប្រភេទទុក

source: Type of leave being requested
km: ប្រភេទនៃការចាកចេញដែលត្រូវបានស្នើសុំ

source: Detailed reason for leave request
km: ហេតុផលលម្អិតសម្រាប់ការស្នើសុំចាកចេញ

source: Is Emergency
km: គឺជាភាពអាសន្ន

source: Whether this is an emergency/last-minute request
km: ថាតើនេះជាការស្នើសុំបន្ទាន់ / នាទីចុងក្រោយ

source: Affected Class Parts
km: ផ្នែកនៃថ្នាក់ដែលរងផលប៉ះពាល់

source: Class parts that need substitute coverage
km: ផ្នែកថ្នាក់ដែលត្រូវការការដាក់ជំនួស

source: Teacher assigned to cover the classes
km: គ្រូបានចាត់ឱ្យគ្របដណ្ដប់លើថ្នាក់រៀន

source: Substitute Confirmed
km: បានបញ្ជាក់ពីការជំនួស

source: Whether substitute teacher has confirmed availability
km: ថាតើអ្នកជំនួយការជំនួសបានបញ្ជាក់ពីភាពអាចរកបាន

source: Staff member who assigned the substitute
km: បុគ្គលិកដែលបានចាត់តាំងអ្នកជំនួស

source: When substitute was assigned
km: នៅពេលជំនួសត្រូវបានចាត់តាំង

source: Denial Reason
km: ហេតុផលបដិសេធ

source: Reason for denial if status is denied
km: ហេតុផលសម្រាប់ការបដិសេធប្រសិនបើស្ថានភាពត្រូវបានបដិសេធ

source: Notification Sent
km: ការជូនដំណឹងដែលបានផ្ញើ

source: Whether department has been notified
km: ថាតើនាយកដ្ឋានត្រូវបានជូនដំណឹង

source: Substitute Found
km: កីឡាករជំនួស

source: Whether a substitute has been secured
km: ថាតើអ្នកជំនួសត្រូវបានធានាសុវត្ថិភាពឬអត់

source: Internal notes about this leave request
km: កំណត់ចំណាំផ្ទៃក្នុងអំពីការស្នើសុំចាកចេញនេះ

source: Teacher Leave Request
km: ការស្នើសុំទុកដាក់នឹងលោកគ្រូ

source: Teacher Leave Requests
km: សំណូមពររបស់គ្រូ

source: Cannot request leave for past dates unless it's an emergency.
km: មិនអាចស្នើសុំការឈប់សម្រាកសម្រាប់កាលបរិច្ឆេទកន្លងមកបានទេលើកលែងតែវាជាការសង្គ្រោះបន្ទាន់។

source: Denial reason is required for denied requests.
km: ហេតុផលបដិសេធត្រូវបានទាមទារសម្រាប់សំណើដែលបានបដិសេធ។

source: A combination must include at least 2 courses.
km: ការរួមបញ្ចូលគ្នាត្រូវតែរាប់បញ្ចូលយ៉ាងហោចណាស់ 2 វគ្គសិក្សា។

source: Some courses are already in active templates: {', '.join(overlapping_names)}
km: វគ្គសិក្សាមួយចំនួនមាននៅក្នុងគំរូសកម្មរួចហើយ: {',' '.join (ត្រួតលើឈ្មោះ)}

source: Deprecated
km: ដកហាត់

source: Template Name
km: ឈ្មោះគំរូ

source: Descriptive name for this course combination
km: ឈ្មោះពិពណ៌នាសម្រាប់ការបន្សំវគ្គសិក្សានេះ

source: Courses that should always be scheduled together
km: វគ្គសិក្សាដែលគួរកំណត់ពេលវេលាជាមួយគ្នា

source: Additional details about this combination and its purpose
km: ព័ត៌មានលំអិតបន្ថែមអំពីការរួមបញ្ចូលគ្នានេះនិងគោលបំណងរបស់វា

source: Current status of this template
km: ស្ថានភាពបច្ចុប្បន្ននៃគំរូនេះ

source: User who created this template
km: អ្នកប្រើប្រាស់ដែលបានបង្កើតគំរូនេះ

source: Internal notes for administrative purposes
km: កំណត់ចំណាំផ្ទៃក្នុងសម្រាប់គោលបំណងរដ្ឋបាល

source: Combined Course Template
km: គំរូវគ្គសិក្សារួមបញ្ចូលគ្នា

source: Combined Course Templates
km: គំរូវគ្គសិក្សារួមបញ្ចូលគ្នា

source: Template
km: ថ័តទីថបហេ

source: Course combination template this instance implements
km: គំរូគំរូនៃវគ្គសិក្សានេះឧទាហរណ៍

source: Academic term for this combination instance
km: ពាក្យសម្រាប់ការសិក្សាសម្រាប់ការរួមបញ្ចូលគ្នានេះ

source: Primary Teacher
km: គ្រូបឋម

source: Teacher assigned to teach this combined class
km: គ្រូបានចាត់ឱ្យបង្រៀនថ្នាក់រួមបញ្ចូលគ្នានេះ

source: Primary Room
km: បន្ទប់បឋម

source: Room where this combined class meets
km: បន្ទប់ដែលថ្នាក់រួមបញ្ចូលគ្នានេះជួបគ្នា

source: Current status of this combination instance
km: ស្ថានភាពបច្ចុប្បន្ននៃការរួមបញ្ចូលគ្នានេះ

source: Combined Section ID
km: លេខសម្គាល់ផ្នែករួមបញ្ចូលគ្នា

source: Section ID must be a single letter A-Z
km: លេខសម្គាល់ផ្នែកត្រូវតែជាអក្សរតែមួយ A-Z

source: Section identifier for the combined class (A, B, C, etc.)
km: ផ្នែកអត្តសញ្ញាណកម្មសម្រាប់ថ្នាក់រួមបញ្ចូលគ្នា (A, B, C, ល)

source: Maximum Combined Enrollment
km: ការចុះឈ្មោះបញ្ចូលគ្នាយ៉ាងអតិបរមា

source: Maximum total students across all member courses
km: និស្សិតសរុបអតិបរមានៅទូទាំងវគ្គសិក្សាសមាជិកទាំងអស់

source: Additional notes about this combination instance
km: កំណត់សំគាល់បន្ថែមអំពីវត្ថុរួមបញ្ចូលគ្នានេះ

source: Auto Created
km: បានបង្កើតដោយស្វ័យប្រវត្តិ

source: Whether this instance was automatically created
km: ថាតើឧទាហរណ៍នេះត្រូវបានបង្កើតដោយស្វ័យប្រវត្តិឬអត់

source: Combined Class Instance
km: ឧទាហរណ៍ថ្នាក់រួមបញ្ចូលគ្នា

source: Combined Class Instances
km: ករណីថ្នាក់រួមបញ្ចូលគ្នា

source: Cannot create instances from inactive templates.
km: មិនអាចបង្កើតឧទាហរណ៍ពីគំរូអសកម្ម។

source: Instance already exists for {self.template.name} in {self.term} Section {self.section_id}
km: ឧទាហរណ៏មានសម្រាប់ {meal.tempempemnate.name} នៅ {ផ្នែក Meal.term} {Selfe.Section_ID}

source: Group Name
km: ឈ្មោះក្រុម

source: Descriptive name for this class group
km: ឈ្មោះពិពណ៌នាសម្រាប់ក្រុមថ្នាក់នេះ

source: Academic term for this group
km: ពាក្យសិក្សាសម្រាប់ក្រុមនេះ

source: Additional details about this group
km: ព័ត៌មានលំអិតបន្ថែមអំពីក្រុមនេះ

source: Combined Class Group
km: ក្រុមថ្នាក់រួមបញ្ចូលគ្នា

source: Combined Class Groups
km: ក្រុមថ្នាក់រួមបញ្ចូលគ្នា

source: Night
km: រារតី

source: All Day
km: ពេញមួយថ្ងៃ

source: Standard Class
km: ថ្នាក់ស្តង់ដារ

source: Combined Class
km: ថ្នាក់រួមបញ្ចូលគ្នា

source: Reading Class
km: ថ្នាក់អាន

source: Intensive Class
km: ថ្នាក់ដែលពឹងផ្អែកខ្លាំង

source: Workshop
km: រោងចាង

source: Scheduled
km: បានកំណត់ពេល

source: Course being offered
km: ជាការពិតដែលត្រូវបានផ្តល់ជូន

source: Academic term when class is offered
km: ពាក្យសិក្សានៅពេលដែលថ្នាក់ត្រូវបានផ្តល់ជូន

source: Section ID
km: លេខសម្គាល់ផ្នែក

source: Section identifier (A, B, C, etc.)
km: ផ្នែកអត្តសញ្ញាណសម្គាល់ (A, B, C, ល)

source: Time of Day
km: ពេលវេលានៃថ្ងៃ

source: General time period for this class
km: រយៈពេលទូទៅសម្រាប់ថ្នាក់នេះ

source: Class Type
km: ប្រភេទថ្នាក់

source: Type of class offering
km: ប្រភេទនៃការផ្តល់ជូនថ្នាក់

source: Current scheduling status
km: ស្ថានភាពកំណត់ពេលបច្ចុប្បន្ន

source: Combined class instance this class belongs to (if any)
km: ឧទាហរណ៍ថ្នាក់រួមនៃថ្នាក់នេះជារបស់ (បើមាន)

source: Is Paired
km: ត្រូវបានផ្គូរផ្គង

source: Whether this class is paired with another
km: ថាតើថ្នាក់នេះត្រូវបានផ្គូរផ្គងជាមួយមួយផ្សេងទៀត

source: Paired With
km: បានផ្គូរផ្គងជាមួយ

source: Class this is paired with (for language programs)
km: ថ្នាក់នេះត្រូវបានផ្គូរផ្គងជាមួយ (សម្រាប់កម្មវិធីភាសា)

source: Maximum Enrollment
km: ការចុះឈ្មោះជាអតិបរមា

source: Maximum number of students allowed
km: ចំនួននិស្សិតអតិបរមាត្រូវបានអនុញ្ញាត

source: Additional notes about this class offering
km: កំណត់ចំណាំបន្ថែមអំពីការផ្តល់ជូនថ្នាក់នេះ

source: Legacy Class ID
km: លេខសម្គាល់ថ្នាក់កេរ្តិ៍ដំណែល

source: Legacy system identifier for migration tracking
km: គ្រឿងសម្គាល់ប្រព័ន្ធកេរ្តិ៍ដំណែលសម្រាប់ការតាមដានការធ្វើចំណាកស្រុក

source: Class Header
km: បឋមកថាថ្នាក់

source: Class Headers
km: បឋមកថាថ្នាក់

source: Paired classes must specify what they are paired with.
km: ថ្នាក់គូត្រូវបានផ្គូផ្គងនូវអ្វីដែលពួកគេត្រូវបានភ្ជាប់ជាមួយ។

source: Paired classes must have same term, section, and time of day.
km: ថ្នាក់គូត្រូវមានពាក្យដូចគ្នាផ្នែកនិងពេលវេលានៃថ្ងៃ។

source: Class this session belongs to
km: ថ្នាក់វគ្គនេះជារបស់

source: Immutable internal identifier for this session
km: អ្នកកំណត់អត្តសញ្ញាណខាងក្នុងដែលមិនអាចផ្លាស់ប្តូរបានសម្រាប់សម័យនេះ

source: Session number within the class (1 for regular, 1&2 for IEAP)
km: លេខវេនក្នុងថ្នាក់ (1 សម្រាប់ទៀងទាត់ 1 និង 2 សម្រាប់អាយអាយអេស)

source: Session Name
km: ឈ្មោះសម័យ

source: Optional name for this session (e.g., 'Session 1', 'Morning Session')
km: ឈ្មោះស្រេចចិត្តសម្រាប់សម័យនេះ (ឧ។ វគ្គ 'វគ្គ 1', 'វេនពេលព្រឹក')

source: Weight of this session in final grade (1.0 for regular, 0.5 for IEAP)
km: ទំងន់នៃវគ្គនេះក្នុងថ្នាក់ចុងក្រោយ (1.0 សម្រាប់ទៀងទាត់ 0.5 សម្រាប់អាយអាយអេស)

source: Additional notes about this session
km: កំណត់សំគាល់បន្ថែមអំពីសម័យនេះ

source: Class Sessions
km: វគ្គថ្នាក់

source: Main Class
km: ថ្នាក់មេ

source: Lecture
km: បថកថា

source: Discussion
km: ការបិរេកាហ

source: Laboratory
km: មន្ទីរបិសោធន៍

source: Grammar
km: វេយ្យាករន៍

source: Conversation
km: ការសន្ទនា

source: Writing
km: ការសរសេរ

source: Reading
km: ការអាន

source: Listening
km: ស្តាប់

source: Speaking
km: ការនិយាយ

source: Ventures
km: ការបណ្តាក់ទុន

source: Project
km: កមរោង

source: Session this part belongs to
km: វគ្គនេះជារបស់

source: Immutable internal identifier for this part
km: គ្រឿងសម្គាល់ផ្ទៃក្នុងដែលមិនអាចផ្លាស់ប្តូរបានសម្រាប់ផ្នែកនេះ

source: Class Part Type
km: ប្រភេទផ្នែកថ្នាក់

source: Type of class component
km: ប្រភេទនៃសមាសធាតុថ្នាក់

source: Class Part Code
km: លេខកូដថ្នាក់ថ្នាក់

source: Optional specific name for this part
km: ឈ្មោះជាក់លាក់ជម្រើសសម្រាប់ផ្នែកនេះ

source: Assigned teacher for this part
km: គ្រូដែលបានចាត់តាំងសម្រាប់ផ្នែកនេះ

source: Assigned room for this part
km: បន្ទប់ដែលបានកំណត់សម្រាប់ផ្នែកនេះ

source: Days of week this part meets (comma-separated: MON,WED,FRI)
km: ថ្ងៃនៃសប្តាហ៍ផ្នែកនេះជួបគ្នា (ក្បៀស - បំបែកដោយក្បៀស: ច័ន្ទ, អាពាហ៍ពិពាហ៍, Fri)

source: Start Time
km: ពេលវេលាចាប់ផ្តើម

source: When this part starts (filled by scheduler)
km: នៅពេលដែលផ្នែកនេះចាប់ផ្តើម (បំពេញដោយកម្មវិធីកំណត់ពេល)

source: End Time
km: ពេលវេលាបញ្ចប់

source: When this part ends (filled by scheduler)
km: នៅពេលដែលផ្នែកនេះបញ្ចប់ (បំពេញដោយកម្មវិធីកំណត់ពេល)

source: Weight of this part in final grade (0.000-1.000)
km: ទំងន់នៃផ្នែកនេះក្នុងថ្នាក់ចុងក្រោយ (0.000-1,000)

source: Textbooks used in this part
km: សៀវភៅសិក្សាប្រើក្នុងផ្នែកនេះ

source: Additional notes about this class part
km: កំណត់សំគាល់បន្ថែមអំពីផ្នែកនៃថ្នាក់នេះ

source: Class Parts
km: ផ្នែកថ្នាក់

source: End time must be after start time.
km: ពេលវេលាបញ្ចប់ត្រូវតែបន្ទាប់ពីពេលវេលាចាប់ផ្តើម។

source: Grade weight must be between 0.000 and 1.000.
km: ទំងន់ថ្នាក់កំរិតត្រូវតែមានពី 0,000 ទៅ 1,000 ។

source: Invalid days: {', '.join(invalid_days)}. Use: {', '.join(VALID_MEETING_DAYS)}
km: ថ្ងៃមិនត្រឹមត្រូវ: {',' .join (មិនត្រឹមត្រូវ)} ។ ការប្រើ: {',' .join (សុពលភាព _meeting_days)}

source: Room conflict with {part.class_session} on {', '.join(overlapping_days)}
km: ទំនាស់បន្ទប់មានជម្លោះជាមួយ {part.class_session} នៅលើ {',' '.join (ត្រួតលើគ្នា)}

source: Tier 1 (1-2 students)
km: ថ្នាក់ទី 1 (សិស្ស 1-2 នាក់)

source: Tier 2 (3-5 students)
km: ថ្នាក់ទី 2 (សិស្ស 3-5 នាក់)

source: Tier 3 (6-15 students)
km: ថ្នាក់ទី 3 (និស្សិត 6-15 នាក់)

source: Planning
km: កមរោង

source: Open for Enrollment
km: បើកសម្រាប់ការចុះឈ្មោះ

source: Closed
km: ដេលបិត

source: Converted to Standard
km: បានប្រែទៅជាស្តង់ដារ

source: Class header this reading class is associated with
km: បឋមកថាថ្នាក់រៀនថ្នាក់អាននេះត្រូវបានផ្សារភ្ជាប់ជាមួយនឹង

source: Tier
km: ថ្នាក់

source: Current enrollment tier
km: ថ្នាក់ចុះឈ្មោះចូលរៀនបច្ចុប្បន្ន

source: Target Enrollment
km: ការចុះឈ្មោះគោលដៅ

source: Target number of students for this reading class
km: ចំនួនគោលដៅរបស់និស្សិតសម្រាប់ថ្នាក់អាននេះ

source: Additional description or notes about this reading class
km: ការពិពណ៌នាបន្ថែមឬកំណត់ចំណាំអំពីថ្នាក់អាននេះ

source: Reading Classes
km: ថ្នាក់អាន

source: Reading class must be associated with a READING type class header.
km: ថ្នាក់នៃការអានត្រូវតែមានទំនាក់ទំនងជាមួយបឋមកថាថ្នាក់អានប្រភេទអាន។

source: Reading classes cannot have target enrollment above {READING_CLASS_MAX_TARGET_ENROLLMENT} students.
km: ថ្នាក់អានមិនអាចមានការចុះឈ្មោះគោលដៅនៅខាងលើ {enting_class_max_target_target_enylyment} សិស្ស។

source: IEAP Test 1
km: តេស្ត IAP 1

source: IEAP Test 2
km: តេស្ត IAP 2

source: IEAP Test 3
km: តេស្ត IAP 3

source: Midterm
km: ពាក់កណ្ដាល

source: Final
km: ចមនង

source: Academic term for this reset period
km: ពាក្យសិក្សាសម្រាប់រយៈពេលកំណត់នេះ

source: Type of test period for absence reset
km: ប្រភេទនៃរយៈពេលសាកល្បងសម្រាប់អវត្តមានកំណត់ឡើងវិញ

source: Reset Date
km: កំណត់កាលបរិច្ឆេទកំណត់ឡើងវិញ

source: Date when absence counters reset for this test period
km: កាលបរិច្ឆេទនៅពេលដែលអវត្តមានបញ្ជរកំណត់ឡើងវិញសម្រាប់រយៈពេលសាកល្បងនេះ

source: Applies to All Language Classes
km: អនុវត្តចំពោះថ្នាក់ភាសាទាំងអស់

source: Apply this reset date to all language classes in the term
km: អនុវត្តកាលបរិច្ឆេទកំណត់ឡើងវិញនេះទៅថ្នាក់ភាសាទាំងអស់នៅក្នុងពាក្យ

source: Specific Classes
km: ថ្នាក់ជាក់លាក់
