Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: Program Code
km: កូដកម្មវិធី

source: Official code for this program
km: លេខកូដផ្លូវការសម្រាប់កម្មវិធីនេះ

source: Faculty Display Name
km: ឈ្មោះបង្ហាញមហាវិទ្យាល័យមហាវិទ្យាល័យ

source: Faculty name for transcript display only (e.g., 'Faculty of Business & Economics')
km: ឈ្មោះមហាវិទ្យាល័យសម្រាប់ការបង្ហាញប្រតិចារិកតែប៉ុណ្ណោះ (ឧ។ មហាវិទ្យាល័យពាណិជ្ជកម្មនិងសេដ្ឋកិច្ច)

source: Faculty Code
km: ក្រមសីលធម៌មហាវិទ្យាល័យ

source: Faculty abbreviation for display (SSIR, BE, EDUC, IFL)
km: អក្សរកាត់មហាវិទ្យាល័យសម្រាប់ការបង្ហាញ (SSIR, be, អប់រំ IFL)

source: Type of program (academic degree or language program)
km: ប្រភេទនៃកម្មវិធី (កំរិតសិក្សាឬកម្មវិធីភាសា)

source: Degree Awarded
km: ទទួលបានសញ្ញាប័ត្រ

source: Degree or certification awarded upon completion
km: សញ្ញាប័ត្រឬវិញ្ញាបនប័ត្រដែលបានទទួលនៅពេលបញ្ចប់

source: Total credits required to complete this program
km: ឥណទានសរុបតម្រូវឱ្យបំពេញកម្មវិធីនេះ

source: Majors
km: មហាថ្មដៃ

source: Language programs should award certificates or no degree.
km: កម្មវិធីភាសាគួរតែទទួលបានវិញ្ញាបនប័ត្រឬគ្មានសញ្ញាបត្រ។

source: Academic programs should not award certificates.
km: កម្មវិធីសិក្សាមិនគួរមានវិញ្ញាបនប័ត្ររង្វាន់ទេ។

source: English Term A
km: ពាក្យអង់គ្លេសក

source: English Term B
km: អាណាចក្រអង់គ្លេសខ

source: BA Term
km: បរិញ្ញាបត្រ BA

source: MA Term
km: MA រយៈពេល

source: Special Term
km: ពាក្យពិសេស

source: Term Code
km: លេខកូដរយៈពេល

source: Unique identifier/code for the term (e.g., 'Fall 2024', 'BA15-T2')
km: អត្តសញ្ញាណប័ណ្ណ / លេខកូដពិសេសសម្រាប់រយៈពេល (ឧ។ ការធ្លាក់ចុះ 2024 ',' BA15-T2 ')

source: Term Type
km: ប្រភេទរយៈពេល

source: Type of academic term
km: ប្រភេទនៃពាក្យសិក្សា

source: BA Cohort Number
km: លេខ Ba Cohort លេខ

source: Bachelor's cohort number for this term
km: លេខគូរបស់បរិញ្ញាបត្រសម្រាប់ពាក្យនេះ

source: MA Cohort Number
km: លេខម៉ា Cohort លេខ

source: Master's cohort number for this term
km: លេខសមរភូមិរបស់មេសម្រាប់ពាក្យនេះ

source: First day of classes
km: ថ្ងៃដំបូងនៃថ្នាក់

source: Last day of classes
km: ថ្ងៃចុងក្រោយនៃថ្នាក់

source: Discount End Date
km: កាលបរិច្ឆេទបញ្ចប់បញ្ចុះតំលៃ

source: Last day for early enrollment discounts
km: ថ្ងៃចុងក្រោយសម្រាប់ការចុះឈ្មោះចូលរៀនដំបូង

source: Add Deadline
km: បន្ថែមកាលបរិច្ឆេទកំណត់

source: Last day to add courses
km: ថ្ងៃចុងក្រោយដើម្បីបន្ថែមវគ្គសិក្សា

source: Drop Deadline
km: ទម្លាក់ពេលវេលាកំណត់

source: Last day to drop courses without penalty
km: ថ្ងៃចុងក្រោយដើម្បីទម្លាក់វគ្គសិក្សាដោយគ្មានការពិន័យ

source: Payment Deadline
km: ថ្ងៃផុតកំណត់នៃការទូទាត់

source: Final payment deadline
km: ថ្ងៃផុតកំណត់ទូទាត់ចុងក្រោយ

source: Terms
km: ល័ក្ខខ័ណ្ឌ

source: Add deadline should be on or after start date.
km: បន្ថែមកាលបរិច្ឆេទផុតកំណត់គួរតែនៅលើឬបន្ទាប់ពីកាលបរិច្ឆេទចាប់ផ្តើម។

source: Course Code
km: លេខកូដវគ្គសិក្សា

source: Course code (e.g., 'ENG101', 'MATH201'). Multiple versions allowed with different effective dates.
km: លេខកូដវគ្គសិក្សា (ឧ។ 'ent101', 'Math201') ។ កំណែជាច្រើនត្រូវបានអនុញ្ញាតដោយកាលបរិច្ឆេទមានប្រសិទ្ធិភាពខុសគ្នា។

source: Course Title
km: ចំណងជើងវគ្គសិក្សា

source: Full course title
km: ចំណងជើងពេញវគ្គសិក្សា

source: Short Title
km: ចំណងជើងខ្លី

source: Abbreviated title for transcripts
km: ចំណងជើងអក្សរកាត់សម្រាប់ប្រតិចារិក

source: Academic cycle for this course
km: វដ្តសិក្សាសម្រាប់វគ្គសិក្សានេះ

source: Majors that include this course in their curriculum
km: មុខជំនាញរួមបញ្ចូលវគ្គសិក្សានេះក្នុងកម្មវិធីសិក្សារបស់ពួកគេ

source: Credits
km: សេវាឥណទាន

source: Number of credit hours for this course
km: ចំនួនម៉ោងឥណទានសម្រាប់វគ្គសិក្សានេះ

source: Is Language Course
km: គឺជាវគ្គសិក្សាភាសា

source: Whether this is a language instruction course
km: ថាតើនេះជាវគ្គបង្រៀនភាសា

source: Is Foundation Year
km: គឺជាឆ្នាំគ្រឹះ

source: Whether this course is part of foundation year curriculum
km: ថាតើវគ្គសិក្សានេះជាផ្នែកមួយនៃកម្មវិធីសិក្សាឆ្នាំគ្រឹះ

source: Is Senior Project
km: គឺជាគម្រោងជាន់ខ្ពស់

source: Whether this course is a senior project requiring group formation and tiered pricing
km: ថាតើវគ្គសិក្សានេះគឺជាគម្រោងជាន់ខ្ពស់ដែលទាមទារការបង្កើតក្រុមនិងតម្លៃដែលមានលក្ខណៈ

source: Recommended Term
km: អាណត្តិដែលបានណែនាំ

source: Recommended term number for taking this course
km: លេខពាក្យដែលបានណែនាំសម្រាប់ការទទួលយកវគ្គសិក្សានេះ

source: Earliest Term
km: ពាក្យដំបូងបំផុត

source: Earliest term when this course can be taken
km: អាណត្តិដំបូងបំផុតនៅពេលវគ្គសិក្សានេះអាចត្រូវបានយក

source: Latest Term
km: ពាក្យចុងក្រោយ

source: Latest term when this course should be taken
km: ពាក្យចុងក្រោយនៅពេលដែលវគ្គសិក្សានេះគួរតែត្រូវបានយក

source: Failure Retry Priority
km: ការបរាជ័យបានបញ្ចប់អាទិភាព

source: Priority for retaking if failed (1=highest priority)
km: អាទិភាពសម្រាប់ការធ្វើឱ្យខូចប្រសិនបើបរាជ័យ (1 = អាទិភាពខ្ពស់បំផុត)

source: Date when this course becomes available
km: កាលបរិច្ឆេទនៅពេលដែលវគ្គសិក្សានេះអាចប្រើបាន

source: Date when this course is discontinued (if applicable)
km: កាលបរិច្ឆេទនៅពេលដែលវគ្គសិក្សានេះត្រូវបានបញ្ឈប់ (បើមាន)

source: Latest term must be after or equal to earliest term.
km: ពាក្យចុងក្រោយត្រូវតែមានបន្ទាប់ពីឬស្មើនឹងពាក្យដំបូងបំផុត។

source: Recommended term cannot be before earliest term.
km: ពាក្យដែលបានណែនាំមិនអាចមានមុនពេលអាណត្តិដំបូងបំផុត។

source: Recommended term cannot be after latest term.
km: ពាក្យដែលបានណែនាំមិនអាចត្រូវបានអនុវត្តបន្ទាប់ពីពាក្យចុងក្រោយ។

source: Course code '{self.code}' already exists with overlapping dates
km: លេខកូដវគ្គសិក្សា '{mail.code} មានរួចហើយដែលមានកាលបរិច្ឆេទត្រួតគ្នា

source: Title
km: ចមនងចើង

source: Full title of the textbook
km: ចំណងជើងពេញរបស់សៀវភៅសិក្សា

source: Author(s) of the textbook
km: អ្នកនិពន្ធសៀវភៅសិក្សា

source: ISBN for ordering and identification
km: ISBN សម្រាប់ការបញ្ជាទិញនិងអត្តសញ្ញាណប័ណ្ណ

source: Publisher
km: អ្នកបោហបុម្ព

source: Publishing company
km: ក្រុមហ៊ុនបោះពុម្ពផ្សាយ

source: Edition
km: ការដាក់លក់

source: Edition number or description
km: លេខការបោះពុម្ពផ្សាយឬការពិពណ៌នា

source: Publication Year
km: ការបោះពុម្ពផ្សាយ

source: Year of publication
km: ការបោះពុម្ពផ្សាយឆ្នាំ

source: Additional notes about this textbook
km: កំណត់សំគាល់បន្ថែមអំពីសៀវភៅសិក្សានេះ

source: Textbook
km: ស្យេវផោសិកសា

source: Textbooks
km: សៀវភៅសិក្សា

source: Prerequisite Course
km: វគ្គសិក្សាចាំបាច់បំផុត

source: Course that must be completed first
km: វគ្គសិក្សាដែលត្រូវតែបញ្ចប់ជាមុនសិន

source: Course that requires the prerequisite
km: វគ្គសិក្សាដែលត្រូវការតម្រូវការជាមុន

source: Additional notes about this prerequisite relationship
km: កំណត់សំគាល់បន្ថែមអំពីទំនាក់ទំនងដែលមានតម្រូវការ

source: Effective Start Date
km: កាលបរិច្ឆេទចាប់ផ្តើមប្រកបដោយប្រសិទ្ធភាព

source: Date when this prerequisite becomes effective
km: កាលបរិច្ឆេទនៅពេលដែលតម្រូវការជាមុននេះមានប្រសិទ្ធភាព

source: Effective End Date
km: កាលបរិច្ឆេទបញ្ចប់ប្រកបដោយប្រសិទ្ធភាព

source: Date when this prerequisite is no longer required
km: កាលបរិច្ឆេទនៅពេលដែលតម្រូវការជាមុននេះមិនត្រូវការទៀតទេ

source: Course Prerequisite
km: វគ្គសិក្សាជាមុន

source: Course Prerequisites
km: តម្រូវការជាមុនវគ្គសិក្សា

source: A course cannot be a prerequisite for itself.
km: វគ្គសិក្សាមិនអាចជាតម្រូវការជាមុនសម្រាប់ខ្លួនវាបានទេ។

source: Course this template defines parts for
km: វគ្គសិក្សានេះកំណត់ផ្នែកសម្រាប់

source: Part Type
km: ប្រភេទផ្នែក

source: Type of class component (imported from scheduling.ClassPart.ClassPartType)
km: ប្រភេទនៃសមាសធាតុថ្នាក់ (នាំចូលពីកាលវិភាគ .classparts.classparttype)

source: Part Code
km: លេខកូដផ្នែក

source: Code for this part (A, B, C, etc.)
km: លេខកូដសម្រាប់ផ្នែកនេះ (A, B, C, ល)

source: Part Name
km: ឈ្មោះផ្នែក

source: Display name (e.g., 'Grammar', 'Computer Lab')
km: ឈ្មោះបង្ហាញ (ឧទាហរណ៍វេយ្យាករណ៍ 'វេយ្យាករណ៍' មន្ទីរពិសោធន៍កុំព្យូទ័រ ')

source: Session Number
km: លេខវេន

source: Session assignment (1 or 2 for IEAP, 1 for regular classes)
km: កិច្ចការសម័យ (1 ឬ 2 សម្រាប់អាយអាយអេស 1 សម្រាប់ថ្នាក់ធម្មតា)

source: Meeting Days
km: ថ្ងៃប្រជុំ

source: Default meeting pattern (MON,WED,FRI) - can be adjusted during scheduling
km: លំនាំប្រជុំលំនាំដើម (មន, ថ្ងៃពុធ, fri) - អាចត្រូវបានកែតម្រូវក្នុងកំឡុងពេលកំណត់ពេលវេលា

source: Grade Weight
km: ទំងន់ថ្នាក់ទី

source: CURRICULUM WEIGHT: Predetermined during curriculum design. Parts in same session should sum to 1.0
km: ទំងន់កម្មវិធីសិក្សា: បានកំណត់ទុកជាមុនកំឡុងពេលរចនាកម្មវិធីសិក្សា។ ផ្នែកខ្លះក្នុងសម័យប្រជុំដូចគ្នាគួរតែទទួលបានផលបូករហូតដល់ 1.0

source: Required textbooks for this part (curriculum decision)
km: សៀវភៅសិក្សាដែលត្រូវការសម្រាប់ផ្នែកនេះ (សេចក្តីសម្រេចកម្មវិធីសិក្សា)

source: Display order within session
km: បង្ហាញលំដាប់ក្នុងសម័យ

source: Whether this template is currently active
km: ថាតើគំរូនេះសកម្មថាបច្ចុប្បន្ន

source: Course Part Template
km: គំរូផ្នែកវគ្គសិក្សាផ្នែក

source: Course Part Templates
km: ពុម្ពគំរូផ្នែកវគ្គសិក្សា

source: Grade weights for session {self.session_number} must sum to 1.000.
km: ទំងន់ថ្នាក់សម្រាប់វគ្គ {Meal.Stber_Stient_Number} ត្រូវតែទទួលបានផលបូកដល់ 1,000 ។

source: Invalid days: {', '.join(invalid_days)}. Use: {', '.join(valid_days)}
km: ថ្ងៃមិនត្រឹមត្រូវ: {',' .join (មិនត្រឹមត្រូវ)} ។ ប្រើ: {',' .join (សុពលភាព)}

source: Proposed
km: បានស្នើចុន

source: Submitted
km: ដាក់ស្នើ

source: Defended
km: អាច្ញាដេស

source: Senior Project Course
km: វគ្គសិក្សាជាន់ខ្ពស់នៃគម្រោងជាន់ខ្ពស់

source: Course this senior project is associated with
km: វគ្គសិក្សាគម្រោងជាន់ខ្ពស់នេះមានទំនាក់ទំនងជាមួយ

source: Term when this project is being conducted
km: រយៈពេលដែលគម្រោងនេះកំពុងត្រូវបានធ្វើឡើង

source: Group Members
km: សមាជិកក្រុម

source: Students participating in this senior project (1-5 students)
km: និស្សិតចូលរួមក្នុងគម្រោងជាន់ខ្ពស់នេះ (សិស្ស 1-5 នាក់)

source: Faculty Advisor
km: ទីប្រឹក្សាមហាវិទ្យាល័យ

source: Faculty member supervising this project
km: សមាជិកមហាវិទ្យាល័យត្រួតពិនិត្យគម្រោងនេះ

source: Project Title
km: ចំណងជើងគម្រោង

source: Working title of the senior project
km: ចំណងជើងការងាររបស់គម្រោងជាន់ខ្ពស់

source: Final Paper Title
km: ចំណងជើងក្រដាសចុងក្រោយ

source: Final title of the completed research paper
km: ចំណងជើងចុងក្រោយនៃក្រដាសស្រាវជ្រាវដែលបានបញ្ចប់

source: Project Description
km: ការពិពណ៌នាគម្រោង

source: Detailed description of the project scope and objectives
km: ការពិពណ៌នាលំអិតនៃវិសាលភាពគម្រោងនិងគោលបំណង

source: Project Status
km: ស្ថានភាពគម្រោង

source: Current status of the project
km: ស្ថានភាពបច្ចុប្បន្ននៃគម្រោង

source: Proposal Date
km: កាលបរិច្ឆេទស្នើសុំ

source: Date when project proposal was submitted
km: កាលបរិច្ឆេទនៅពេលសំណើគម្រោងត្រូវបានដាក់ស្នើ

source: Date when project was approved by advisor/committee
km: កាលបរិច្ឆេទនៅពេលគម្រោងត្រូវបានអនុម័តដោយទីប្រឹក្សា / គណៈកម្មាធិការ

source: Submission Date
km: ថ្ងៃដាក់ស្នើ

source: Date when final paper was submitted
km: កាលបរិច្ឆេទនៅពេលក្រដាសចុងក្រោយត្រូវបានដាក់ស្នើ

source: Defense Date
km: កាលបរិច្ឆេទការពារ

source: Date of project defense/presentation
km: កាលបរិច្ឆេទនៃការការពារគម្រោង / បទបង្ហាញ

source: Completion Date
km: កាលបរិច្ឆេទបញ្ចប់

source: Date when project was officially completed
km: កាលបរិច្ឆេទនៅពេលគម្រោងត្រូវបានបញ្ចប់ជាផ្លូវការ

source: Administrative notes about the project
km: កំណត់សំគាល់រដ្ឋបាលអំពីគម្រោងនេះ

source: Senior Project Group
km: ក្រុមគម្រោងជាន់ខ្ពស់

source: Senior Project Groups
km: ក្រុមគំរោងជាន់ខ្ពស់

source: Selected course must be marked as a senior project.
km: វគ្គសិក្សាដែលបានជ្រើសរើសត្រូវតែត្រូវបានសម្គាល់ថាជាគម្រោងជាន់ខ្ពស់។

source: Academic Program
km: កម្មវិធីសិក្សា

source: Joint Program
km: កម្មវិធីរួមគ្នា

source: Suspended
km: ផ្អាក

source: Transferred
km: ផ្ទេរបានាម

source: Dropped
km: ទម្លាក់

source: Failed
km: ដេលមិនលាក់

source: No Show (Academic)
km: គ្មានការបង្ហាញ (អប់រំ)

source: No Show (Language)
km: គ្មានការបង្ហាញ (ភាសា)

source: Language Programs
km: កម្មវិធីភាសា

source: Academic Programs
km: កម្មវិធីសិក្សា

source: Preparatory Programs
km: កម្មវិធីត្រៀមរៀបចំ

source: Professional Development
km: ការអភិវឌ្ឍន៍វិជ្ជាជីវៈ

source: High School (EHSS)
km: វិទ្យាល័យ (EHSS)

source: Certificate Program
km: កម្មវិធីវិញ្ញាបនបត្រ

source: Preparatory (IEAP/Foundation)
km: ត្រៀម (IAP / មូលនិធិ)

source: Doctoral Degree
km: សញ្ញាប័ត្របណ្ឌិត

source: Graduated
km: បញ្ចប់ការសិក្សា

source: Completed without Graduation
km: បានបញ្ចប់ដោយគ្មានការបញ្ចប់ការសិក្សា

source: Transferred to Another Program
km: ផ្ទេរទៅកម្មវិធីមួយផ្សេងទៀត

source: Transferred to Another Institution
km: ផ្ទេរទៅស្ថាប័នមួយផ្សេងទៀត

source: Academic Dismissal
km: បណ្តេញចេញការសិក្សា

source: Financial Reasons
km: ហេតុផលហិរញ្ញវត្ថុ

source: Personal Reasons
km: ហេតុផលផ្ទាល់ខ្លួន

source: Medical Leave
km: ការឈប់សម្រាកផ្នែកវេជ្ជសាស្រ្ត

source: Visa/Immigration Issues
km: បញ្ហាទិដ្ឋាការ / អន្តោប្រវេសន៍

source: Never Attended
km: មិនដែលចូលរួម

source: Unknown/Not Specified
km: មិនស្គាល់ / មិនបានបញ្ជាក់

source: Student enrolled in this program
km: និស្សិតចុះឈ្មោះក្នុងកម្មវិធីនេះ

source: Program
km: កម្ផវិធី

source: Academic program or major
km: កម្មវិធីសិក្សាឬសំខាន់

source: Enrollment Type
km: ប្រភេទនៃការចុះឈ្មោះ

source: Type of program enrollment
km: ប្រភេទនៃការចុះឈ្មោះកម្មវិធី

source: Enrollment Status
km: ស្ថានភាពចុះឈ្មោះចូលរៀន

source: Current enrollment status
km: ស្ថានភាពចុះឈ្មោះចូលរៀនបច្ចុប្បន្ន

source: Date when program enrollment began
km: កាលបរិច្ឆេទនៅពេលចុះឈ្មោះកម្មវិធីចុះឈ្មោះចូលរៀន

source: Date when program enrollment ended (if applicable)
km: កាលបរិច្ឆេទនៅពេលចុះឈ្មោះកម្មវិធីចុះឈ្មោះចូលរៀន (បើមាន)

source: Start Term
km: ពាក្យចាប់ផ្តើម

source: Term when enrollment began (optional for legacy data)
km: ពាក្យនៅពេលចុះឈ្មោះចូលរៀនបានចាប់ផ្តើម (ស្រេចចិត្តសម្រាប់ទិន្នន័យកេរ្តិ៍ដំណែល)

source: Term when enrollment ended (optional)
km: ពាក្យនៅពេលចុះឈ្មោះចូលបញ្ចប់ (ស្រេចចិត្ត)

source: Entry Level
km: កំរិតចូល

source: Student's level when entering the program
km: កម្រិតរបស់សិស្សនៅពេលចូលក្នុងកម្មវិធី

source: Finishing Level
km: កំរិតបញ្ចប់

source: Student's expected or actual finishing level
km: កម្រិតបញ្ចប់របស់សិស្សឬជាក់ស្តែង

source: Terms Active
km: លក្ខខណ្ឌសកម្ម

source: Number of terms the student has been active in this program
km: ចំនួនពាក្យដែលសិស្សបានធ្វើសកម្មភាពក្នុងកម្មវិធីនេះ

source: Whether this is part of a joint program enrollment
km: ថាតើនេះគឺជាផ្នែកមួយនៃការចុះឈ្មោះចូលកម្មវិធីរួមគ្នា

source: Enrolled By
km: ចុះឈ្មោះដោយ

source: Staff member who processed the enrollment (null for system-generated)
km: បុគ្គលិកដែលបានកែច្នៃការចុះឈ្មោះចូលរៀន (ទុកជាមោឃៈសម្រាប់ប្រព័ន្ធដែលបានបង្កើតដោយប្រព័ន្ធ)

source: Whether this enrollment was automatically created/updated by system
km: ថាតើការចុះឈ្មោះនេះត្រូវបានបង្កើត / ធ្វើបច្ចុប្បន្នភាពដោយប្រព័ន្ធដោយស្វ័យប្រវត្តិឬ?

source: Last Status Update
km: បច្ចុប្បន្នភាពស្ថានភាពចុងក្រោយ

source: When the status was last updated (for tracking automated updates)
km: នៅពេលដែលស្ថានភាពនេះត្រូវបានធ្វើបច្ចុប្បន្នភាពចុងក្រោយ (សម្រាប់តាមដានការធ្វើបច្ចុប្បន្នភាពដោយស្វ័យប្រវត្តិ)

source: Additional notes about this program enrollment
km: កំណត់សំគាល់បន្ថែមអំពីការចុះឈ្មោះកម្មវិធីនេះ

source: Academic division (Language/Academic/etc)
km: ផ្នែកសិក្សា (ភាសា / ការសិក្សា / ល)

source: Academic cycle or degree level
km: វដ្តសិក្សាឬកំរិតសញ្ញាបត្រ

source: Credits Earned
km: ឥណទានទទួលបាន

source: Total credits earned in this program
km: ឥណទានសរុបដែលទទួលបាននៅក្នុងកម្មវិធីនេះ

source: Credits Required
km: ទាមទារឥណទាន

source: Total credits required for program completion
km: សេវាឥណទានសរុបដែលត្រូវការសម្រាប់ការបញ្ចប់កម្មវិធី

source: GPA at Exit
km: GPA នៅពេលចេញ

source: Cumulative GPA when leaving the program
km: GPA កើននៅពេលចាកចេញពីកម្មវិធី

source: Exit Reason
km: ហេតុផលចេញ

source: Reason for leaving the program
km: ហេតុផលសម្រាប់ការចាកចេញពីកម្មវិធី

source: Major Deduced
km: បានកាត់ផ្តាច់ដ៏សំខាន់

source: Whether major was deduced from course enrollment patterns
km: ថាតើកិច្ចការសំខាន់ៗត្រូវបានគេដកចេញពីលំនាំនៃការចុះឈ្មោះវគ្គសិក្សា

source: Deduction Confidence
km: ទំនុកចិត្តកាត់ចេញ

source: Confidence score (0-1) for deduced major
km: ពិន្ទុនៃការជឿជាក់ (0-1) សម្រាប់ការកាត់ផ្តាច់មុខ

source: Percentage of program requirements completed
km: ភាគរយនៃតម្រូវការកម្មវិធីបានបញ្ចប់

source: Expected Completion
km: ការបញ្ចប់ការរំពឹងទុក

source: Originally expected completion date
km: ដើមឡើយកាលបរិច្ឆេទបញ្ចប់ដែលបានរំពឹងទុក

source: Time to Completion
km: ដល់ពេលបញ្ចប់

source: Days from start to completion/exit
km: ថ្ងៃចាប់ពីចាប់ផ្តើមរហូតដល់ការបញ្ចប់ / ចេញ

source: Enrollment Gaps
km: ចន្លោះចុះឈ្មោះ

source: List of terms with no enrollment
km: បញ្ជីពាក្យដោយគ្មានការចុះឈ្មោះ

source: Legacy Section Code
km: លេខកូដផ្នែកកេរ្តិ៍ដំណែល

source: Section code from legacy system (87=BA, 147=MA, etc)
km: លេខកូដផ្នែកពីប្រព័ន្ធមរតកមរតក (87 = បា, 147 = MA, ។ ល។ )

source: Program Enrollments
km: ការចុះឈ្មោះក្នុងកម្មវិធី

source: End term must be after start term.
km: ពាក្យបញ្ចប់ត្រូវតែមានបន្ទាប់ពីរយៈពេលចាប់ផ្តើម។

source: Entry level is required for language program enrollments.
km: កំរិតចូលត្រូវបានទាមទារសម្រាប់ការចុះឈ្មោះចូលរៀនកម្មវិធីភាសា។

source: Student whose eligibility is being tracked
km: និស្សិតដែលមានសិទ្ធិទទួលបានត្រូវបានតាមដាន

source: Course for which eligibility is being checked
km: វគ្គសិក្សាដែលសិទ្ធិទទួលបានត្រូវបានពិនិត្យ

source: Term for which eligibility applies
km: ពាក្យដែលអាចទទួលយកបាន

source: Is Eligible
km: មានសិទ្ធិទទួលបាន

source: Whether the student is eligible for this course in this term
km: ថាតើសិស្សមានសិទ្ធិទទួលបានវគ្គសិក្សានេះក្នុងពាក្យនេះដែរឬទេ

source: Missing Prerequisites
km: បាត់តម្រូវការជាមុន

source: Prerequisites the student has not yet completed
km: តម្រូវការជាមុនរបស់និស្សិតមិនទាន់បានបញ្ចប់នៅឡើយទេ

source: Is Retake
km: ត្រូវបានគេយកមកវិញ

source: Whether this would be a retake of the course
km: ថាតើនេះអាចជាការចាប់យកវគ្គសិក្សាឡើងវិញ

source: Previous Attempts
km: ការប៉ុនប៉ងពីមុន

source: Number of previous attempts at this course
km: ចំនួននៃការប៉ុនប៉ងពីមុននៅវគ្គសិក្សានេះ

source: Retry Priority Score
km: ពិន្ទុអាទិភាពម្តងទៀត

source: Priority score for retake scheduling (higher = more priority)
km: ពិន្ទុសម្រាប់ការគិតអាតូម (ខ្ពស់ជាង = អាទិភាពបន្ថែម)

source: Last Calculated
km: គណនាចុងក្រោយ

source: When eligibility was last calculated
km: នៅពេលដែលមានសិទ្ធិទទួលបានការគណនាចុងក្រោយ

source: Calculation Notes
km: កំណត់ចំណាំការគណនា

source: Notes about how eligibility was determined
km: កំណត់ចំណាំអំពីរបៀបដែលសិទ្ធិទទួលបានត្រូវបានកំណត់

source: Student Course Eligibility
km: សិទ្ធិរបស់និស្សិត

source: Student Course Eligibilities
km: សិទ្ធិវគ្គសិក្សានិស្សិត

source: Natural Progression (e.g., IEAP to BA)
km: វឌ្ឍនភាពធម្មជាតិ (ឧ។ អាយ។ អេ។ អេ។ អាយ។ អេ

source: Change of Major
km: ការផ្លាស់ប្តូរមុខជំនាញ

source: Level Change (e.g., BA to MA)
km: ការផ្លាស់ប្តូរកម្រិត (ឧ។ បរិញ្ញាបត្រទៅម៉ា)

source: Lateral Move (e.g., between language programs)
km: ការផ្លាស់ប្តូរក្រោយ (ឧ។ រវាងកម្មវិធីភាសា)

source: Program Restart
km: កម្មវិធីចាប់ផ្តើមឡើងវិញ

source: From Program
km: ពីកម្មវិធី

source: To Program
km: ទៅកម្មវិធី

source: Transition Date
km: កាលបរិច្ឆេទផ្លាស់ប្តូរ

source: Transition Type
km: ប្រភេទនៃការផ្លាស់ប្តូរ

source: Transition Reason
km: មូលហេតុនៃការផ្លាស់ប្តូរ

source: Credits Transferred
km: សេវាឥណទានផ្ទេរ

source: Gap Days
km: ថ្ងៃ Gap

source: Days between programs
km: ថ្ងៃរវាងកម្មវិធី

source: Program Transition
km: ការផ្លាស់ប្តូរកម្មវិធី

source: Program Transitions
km: ការផ្លាស់ប្តូរកម្មវិធី

source: Enrolled
km: ដេលអប្ដូររឺចុះឈ្មោះ

source: Incomplete
km: ដេលមិនរកប់រកាន់

source: Audit
km: រតយតបហ្ជី

source: Student enrolled in this class
km: និស្សិតបានចុះឈ្មោះចូលរៀនថ្នាក់នេះ

source: Scheduled class the student is enrolled in
km: ថ្នាក់ដែលបានគ្រោងទុកសិស្សត្រូវបានចុះឈ្មោះចូលរៀន

source: Final Grade
km: ថ្នាក់ចុងក្រោយ

source: Final grade awarded for the class
km: ថ្នាក់ចុងក្រោយសម្រាប់ថ្នាក់

source: Grade Points
km: ពិន្ទុថ្នាក់

source: Grade points for GPA calculation
km: ពិន្ទុពិន្ទុសម្រាប់ការគណនា GPA

source: Enrollment Date
km: កាលបរិច្ឆេទចុះឈ្មោះចូលរៀន

source: When the student was enrolled
km: នៅពេលសិស្សចុះឈ្មោះ

source: When the student completed or withdrew from the class
km: នៅពេលសិស្សបញ្ចប់ឬដកថយពីថ្នាក់

source: Staff member who processed the enrollment
km: បុគ្គលិកដែលបានដំណើរការចុះឈ្មោះចូលរៀន

source: Administrative notes about this enrollment
km: កំណត់សំគាល់រដ្ឋបាលអំពីការចុះឈ្មោះនេះ

source: Has Override
km: បានបដិសេធ

source: Whether this enrollment was created with management override
km: ថាតើការចុះឈ្មោះនេះត្រូវបានបង្កើតឡើងដោយការបដិសេធការគ្រប់គ្រង

source: Override Type
km: ប្រភេទបដិសេធ

source: Type of override applied (if any)
km: ប្រភេទនៃការបដិសេធដែលបានអនុវត្ត (បើមាន)

source: Reason for management override (if any)
km: ហេតុផលសម្រាប់ការគ្រប់គ្រងការគ្រប់គ្រង (បើមាន)

source: Audit Only
km: សវនកម្មតែប៉ុណ្ណោះ

source: Whether student is auditing (not for credit)
km: ថាតើសិស្សកំពុងធ្វើសវនកម្ម (មិនមែនសម្រាប់ឥណទាន)

source: Late Enrollment
km: ការចុះឈ្មោះយឺត

source: Whether student enrolled after normal deadline
km: ថាតើសិស្សចុះឈ្មោះបន្ទាប់ពីថ្ងៃផុតកំណត់ធម្មតា

source: Class Header Enrollment
km: ការចុះឈ្មោះចូលរៀនថ្នាក់រៀនថ្នាក់

source: Class Header Enrollments
km: ការចុះឈ្មោះសិស្សថ្នាក់ថ្នាក់

source: Final grade is required for completed enrollments.
km: ថ្នាក់ចុងក្រោយត្រូវបានទាមទារសម្រាប់ការចុះឈ្មោះពេញលេញ។

source: Grade points must be between {min_gpa:.2f} and {max_gpa:.2f}.
km: ចំណុចថ្នាក់ត្រូវតែស្ថិតនៅចន្លោះ {min_gpa: .2f} និង {Max_GPA: .2f} ។

source: Student enrolled in this class part
km: និស្សិតចុះឈ្មោះក្នុងផ្នែកថ្នាក់នេះ

source: Specific class component the student is enrolled in
km: សមាសភាគថ្នាក់ជាក់លាក់ដែលសិស្សត្រូវបានចុះឈ្មោះចូលរៀន

source: When the student was enrolled in this class part
km: នៅពេលសិស្សបានចុះឈ្មោះចូលរៀនក្នុងវគ្គនេះ

source: Whether this enrollment is currently active
km: ថាតើការចុះឈ្មោះនេះបច្ចុប្បន្នសកម្ម

source: Additional notes about this class part enrollment
km: កំណត់សំគាល់បន្ថែមអំពីការចុះឈ្មោះចូលរៀនថ្នាក់នេះ

source: Class Part Enrollment
km: ការចុះឈ្មោះចូលរៀនថ្នាក់

source: Class Part Enrollments
km: ការចុះឈ្មោះចូលរួមផ្នែកថ្នាក់

source: Medical
km: ខាងវិច្ជាបេត្យ

source: Personal
km: ផ្ទាល់ខ្លួន

source: Administrative
km: រដ្ឋបាល

source: The class enrollment this exemption applies to
km: ការចុះឈ្មោះចូលរៀនការលើកលែងនេះត្រូវបានអនុវត្ត

source: Class Session
km: វគ្គថ្នាក់

source: Session the student is exempted from
km: សម័យនិស្សិតត្រូវបានលើកលែងពី

source: Exemption Reason
km: ហេតុផលលើកលែង

source: Reason for session exemption (e.g., 'Already passed Session 1')
km: ហេតុផលសម្រាប់ការលើកលែងវគ្គ (ឧ។ "បានឆ្លងកាត់សម័យប្រជុំទី 1")

source: Exempted By
km: លើកលែងដោយ

source: Staff member who approved the exemption
km: បុគ្គលិកដែលបានអនុម័តការលើកលែង

source: Exemption Date
km: កាលបរិច្ឆេទលើកលែង

source: When the exemption was granted
km: នៅពេលការលើកលែងត្រូវបានផ្តល់ជូន

source: Additional notes about this session exemption
km: កំណត់សំគាល់បន្ថែមអំពីការលើកលែងវគ្គនេះ

source: Class Session Exemption
km: ការលើកមកកាន់ការលើកលែងវគ្គថ្នាក់

source: Class Session Exemptions
km: ការលើកលែងសម័យថ្នាក់

source: Session must belong to the same class as the enrollment.
km: សម័យត្រូវតែជាកម្មសិទ្ធិរបស់វណ្ណៈដូចគ្នានឹងការចុះឈ្មោះ។

source: Student making the major declaration
km: និស្សិតធ្វើសេចក្តីប្រកាសសំខាន់

source: Declared Major
km: ប្រកាសធំ

source: Major or program the student has declared
km: ធំឬកម្មវិធីនិស្សិតបានប្រកាស

source: Effective Date
km: កាលបរិច្ឆេទមានប្រសិទ្ធិភាព

source: Date when this major declaration becomes effective
km: កាលបរិច្ឆេទនៅពេលដែលការប្រកាសសំខាន់នេះមានប្រសិទ្ធភាព

source: Declaration Date
km: កាលបរិច្ឆេទប្រកាសកាលបរិច្ឆេទ

source: When the student made this declaration
km: នៅពេលសិស្សបានប្រកាសសេចក្តីប្រកាសនេះ

source: Whether this declaration is currently active
km: ថាតើការប្រកាសនេះបច្ចុប្បន្នសកម្ម

source: Declared By
km: ប្រកាសដោយ

source: Staff member who processed the declaration (null for student self-declaration)
km: បុគ្គលិកដែលបានកែច្នៃសេចក្តីប្រកាសនេះ (ទុកជាមោឃៈសម្រាប់សេចក្តីប្រកាសរបស់និស្សិត)

source: Self Declared
km: បានប្រកាសដោយខ្លួនឯង

source: Whether student declared this themselves via mobile app
km: ថាតើនិស្សិតបានប្រកាសរឿងនេះដោយខ្លួនឯងតាមរយៈកម្មវិធីទូរស័ព្ទ

source: Previous Declaration
km: សេចក្តីប្រកាសមុន
