Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: Specific classes if not applying to all (language division only)
km: ថ្នាក់ជាក់លាក់ប្រសិនបើមិនដាក់ពាក្យសុំទាំងអស់ (ការបែងចែកភាសាតែប៉ុណ្ណោះ)

source: Additional notes about this reset period
km: កំណត់ចំណាំបន្ថែមអំពីរយៈពេលកំណត់នេះ

source: Test Period Reset
km: កំណត់រយៈពេលសាកល្បងឡើងវិញ

source: Test Period Resets
km: កំណត់ពេលវេលាសាកល្បងឡើងវិញ

source: Reset date must be within the term dates.
km: កំណត់កាលបរិច្ឆេទកំណត់ឡើងវិញត្រូវតែនៅក្នុងកាលបរិច្ឆេទកាលបរិច្ឆេទ។

source: Test period resets only apply to language division classes.
km: រយៈពេលសាកល្បងកំណត់ឡើងវិញអនុវត្តតែចំពោះថ្នាក់ភាសាប៉ុណ្ណោះ។

source: MOU Details
km: ព័ត៌មានលំអិតអនុស្សារណៈយា

source: Billing Preferences
km: ចំណង់ចំណូលចិត្តវិក័យប័ត្រ

source: Reporting Requirements
km: តម្រូវការរាយការណ៍

source: System Information
km: ព័ត៌មានប្រព័ន្ធ

source: MOU Status
km: ស្ថានភាព MOU

source: Active Students
km: និស្សិតសកម្ម

source: Sponsorship Details
km: ព័ត៌មានលម្អិតអំពីការឧបត្ថម្ភ

source: Date Range
km: ជួរកាលបរិច្ឆេទ

source: Sponsor
km: អ្នកឧបត្ថម្ក

source: Award Details
km: ព័ត៌មានលម្អិតអំពីពានរង្វាន់

source: Validity Period
km: រយៈពេលសុពលភាព

source: Award
km: ការកាត់ក្ដី

source: Sponsor Code
km: លេខកូដឧបត្ថម្ភ

source: Short code or abbreviation for the sponsor (e.g., CRST, PLF)
km: លេខកូដខ្លីឬអក្សរកាត់សម្រាប់អ្នកឧបត្ថម្ភ (ឧ។ សត្វក្រៀល, ភីអេហ្វអេហ្វ)

source: Sponsor Name
km: ឈ្មោះអ្នកឧបត្ថម្ភ

source: Full formal name of the sponsoring organization
km: ឈ្មោះផ្លូវការផ្លូវការរបស់អង្គការឧបត្ថម្ភ

source: Contact Person
km: អ្នកទំនាក់ទំនង

source: Name of the primary contact person at the sponsor organization
km: ឈ្មោះរបស់បុគ្គលទំនាក់ទំនងចម្បងនៅអង្គការឧបត្ថម្ភ

source: Contact Email
km: អ៊ីមែលទំនាក់ទំនង

source: Email address of the primary contact person
km: អាសយដ្ឋានអ៊ីមែលរបស់អ្នកទំនាក់ទំនងចំបង

source: Contact Phone
km: ទូរស័ព្ទទំនាក់ទំនង

source: Phone number of the primary contact person
km: លេខទូរស័ព្ទរបស់អ្នកទំនាក់ទំនងចម្បង

source: Billing Email
km: អ៊ីមែលវិក័យប័ត្រ

source: Email address for sending invoices and billing communications
km: អាសយដ្ឋានអ៊ីមែលសម្រាប់ការផ្ញើវិក័យប័ត្រនិងការទំនាក់ទំនងវិក័យប័ត្រ

source: MOU Start Date
km: កាលបរិច្ឆេទចាប់ផ្តើមមរណភាព

source: Start date of the Memorandum of Understanding
km: កាលបរិច្ឆេទចាប់ផ្តើមនៃអនុស្សរណៈនៃការយោគយល់

source: MOU End Date
km: កាលបរិច្ឆេទបញ្ចប់ MOU

source: End date of the MOU (leave blank for ongoing agreements)
km: កាលបរិច្ឆេទបញ្ចប់នៃ MOU (ទុកឱ្យនៅទទេសម្រាប់កិច្ចព្រមព្រៀងដែលកំពុងដំណើរការ)

source: Default Discount Percentage
km: ភាគរយបញ្ចុះតម្លៃលំនាំដើម

source: Standard discount percentage for sponsored students (0.00 to 100.00)
km: ភាគរយនៃការបញ្ចុះតម្លៃស្តង់ដារសម្រាប់និស្សិតដែលឧបត្ថម្ភ (0.00 ដល់ 100.00)

source: Add Tax to Invoices
km: បន្ថែមពន្ធលើវិក័យប័ត្រ

source: Whether to add tax on top of invoices for this sponsor
km: ថាតើត្រូវបន្ថែមពន្ធលើវិក័យប័ត្រសម្រាប់អ្នកឧបត្ថម្ភនេះ

source: Consolidated Invoicing
km: ការធ្វើវិក័យប័ត្រ

source: Whether to group all sponsored students into one consolidated invoice
km: ថាតើត្រូវដាក់ក្រុមនិស្សិតដែលបានឧបត្ថម្ភទាំងអស់ទៅក្នុងវិក្កយបត្ររួមមួយ

source: Admin Fee Exemption Until
km: ការលើកលែងថ្លៃសេវារបស់រដ្ឋបាលរហូតដល់

source: Date until which sponsored students are exempt from administrative fees
km: កាលបរិច្ឆេទរហូតដល់និស្សិតឧបត្ថម្ភត្រូវបានលើកលែងពីថ្លៃសេវារដ្ឋបាល

source: Attendance Reporting
km: របាយការណ៍ចូលរួម

source: Whether sponsor requests attendance reports for their students
km: ថាតើអ្នកឧបត្ថម្ភស្នើសុំរបាយការណ៍ចូលរួមសម្រាប់សិស្សរបស់ពួកគេដែរឬទេ

source: Grade Reporting
km: ការរាយការណ៍ថ្នាក់

source: Whether sponsor requests grade reports for their students
km: ថាតើអ្នកឧបត្ថម្ភស្នើសុំរបាយការណ៍ថ្នាក់សម្រាប់សិស្សរបស់ពួកគេដែរឬទេ

source: Scheduling Reporting
km: របាយការណ៍កំណត់ពេលវេលារបាយការណ៍

source: Whether sponsor requests class schedule reports for their students
km: ថាតើអ្នកឧបត្ថម្ភស្នើសុំរបាយការណ៍កាលវិភាគថ្នាក់សម្រាប់សិស្សរបស់ពួកគេ

source: Whether this sponsor is currently active
km: ថាតើអ្នកឧបត្ថម្ភនេះបច្ចុប្បន្នសកម្មឬអត់

source: Additional notes about this sponsor
km: កំណត់ចំណាំបន្ថែមអំពីអ្នកឧបត្ថម្ភនេះ

source: Sponsors
km: អ្នកបយ

source: MOU end date must be after start date
km: កាលបរិច្ឆេទបញ្ចប់ MOU ត្រូវតែមានបន្ទាប់ពីកាលបរិច្ឆេទចាប់ផ្តើម

source: Full Sponsorship
km: ការឧបត្ថម្ភពេញលេញ

source: Partial Sponsorship
km: ការឧបត្ថម្ភផ្នែកខ្លះ

source: Emergency Support
km: ការគាំទ្របន្ទាន់

source: Scholarship
km: អាហារុបករន៍

source: Sponsorship Type
km: ប្រភេទឧបត្ថម្ភ

source: Type of sponsorship arrangement
km: ប្រភេទនៃការរៀបចំការឧបត្ថម្ភ

source: Date when sponsorship begins
km: កាលបរិច្ឆេទនៅពេលការឧបត្ថម្ភការចាប់ផ្តើម

source: Date when sponsorship ends (leave blank for ongoing)
km: កាលបរិច្ឆេទនៅពេលការឧបត្ថម្ភដល់ចុង (ទុកឱ្យនៅទទេសម្រាប់បន្ត)

source: Additional notes about this sponsorship arrangement
km: កំណត់សំគាល់បន្ថែមអំពីការរៀបចំរបស់ឧបត្ថម្ភនេះ

source: Sponsored Student
km: និស្សិតឧបត្ថម្ភ

source: Sponsored Students
km: និស្សិតឧបត្ថម្ភ

source: End date must be after start date
km: កាលបរិច្ឆេទបញ្ចប់ត្រូវតែមានបន្ទាប់ពីកាលបរិច្ឆេទចាប់ផ្តើម

source: This student already has an overlapping sponsorship from the same sponsor
km: និស្សិតនេះមានការឧបត្ថម្ភត្រួតលើគ្នាពីអ្នកឧបត្ថម្ភដូចគ្នា

source: Merit-Based
km: ផ្អែកលើគុណធម៌

source: Need-Based
km: ត្រូវការ

source: Sponsor-Funded
km: ឧបត្ថម្ភថវិកាឧបត្ថម្ភ

source: Emergency Aid
km: ជំនួយបន្ទាន់

source: Athletic Scholarship
km: អាហារូបករណ៍អត្តពលិក

source: Academic Excellence
km: ឧត្តមភាពសិក្សា

source: Scholarship Name
km: ឈ្មោះអាហារូបករណ៍

source: Name or title of the scholarship
km: ឈ្មោះឬចំណងជើងនៃអាហារូបករណ៍

source: Scholarship Type
km: ប្រភេទអាហារូបករណ៍

source: Type of scholarship
km: ប្រភេទអាហារូបករណ៍

source: Link to sponsored student record (if applicable)
km: ភ្ជាប់ទៅកំណត់ត្រានិស្សិតដែលបានឧបត្ថម្ភ (បើមាន)

source: Award Percentage
km: ភាគរយពានរង្វាន់

source: Percentage of costs covered (0.00 to 100.00)
km: ភាគរយនៃការចំណាយគ្របដណ្តប់លើ (0,00 ដល់ 100.00)

source: Fixed Award Amount
km: ចំនួនទឹកប្រាក់រង្វាន់ថេរ

source: Fixed amount of the award (alternative to percentage)
km: ចំនួនទឹកប្រាក់ថេរនៃពានរង្វាន់ (ជម្រើសទៅភាគរយ)

source: Date when scholarship becomes effective
km: កាលបរិច្ឆេទនៅពេលអាហារូបករណ៍មានប្រសិទ្ធភាព

source: Date when scholarship expires (leave blank for ongoing)
km: កាលបរិច្ឆេទនៅពេលអាហារូបករណ៍ផុតកំណត់ (ទុកឱ្យនៅទទេសម្រាប់បន្ត)

source: Current status of this scholarship
km: ស្ថានភាពបច្ចុប្បន្ននៃអាហារូបករណ៍នេះ

source: Detailed description of the scholarship
km: ការពិពណ៌នាលំអិតនៃអាហារូបករណ៍

source: Conditions
km: ល័ក្ខខ័ណ្ឌ

source: Conditions or requirements for maintaining the scholarship
km: ល័ក្ខខ័ណ្ឌឬតម្រូវការសម្រាប់ថែរក្សាអាហារូបករណ៍

source: Additional notes about this scholarship
km: កំណត់ចំណាំបន្ថែមអំពីអាហារូបករណ៍នេះ

source: Scholarships
km: អាហារូបករណ៍

source: Scholarship cannot have both percentage and fixed amount
km: អាហារូបករណ៍មិនអាចមានទាំងចំនួនភាគរយនិងចំនួនថេរទេ

source: Scholarship must have either percentage or fixed amount
km: អាហារូបករណ៍ត្រូវតែមានភាគរយភាគរយឬចំនួនថេរ

source: Current Term
km: ពាក្យបច្ចុប្បន្ន

source: Main navigation
km: ការរុករកមេ

source: All Students
km: និស្សិតទាំងអស់

source: Add Student
km: បន្ថែមសិស្ស

source: Student Records
km: កំណត់ត្រានិស្សិត

source: Class Schedule
km: កាលវិភាគថ្នាក់

source: Grades
km: ថ្នាក់

source: Billing
km: វិក័យប័រត

source: Export Data
km: នាំចេញទិន្នន័យ

source: Admin Panel
km: ផ្ទាំងរដ្ឋបាល

source: Profile
km: ចមហ្យេង

source: Help
km: ការចយយ

source: Welcome to PUCSR Student Information System
km: សូមស្វាគមន៍ចំពោះប្រព័ន្ធព័ត៌មាននិស្សិត PUCSR

source: Select an option from the sidebar to get started.
km: ជ្រើសរើសជំរើសមួយពីរបារចំហៀងដើម្បីចាប់ផ្តើម។

source: Courses and enrollment
km: វគ្គសិក្សានិងការចុះឈ្មោះ

source: Analytics and insights
km: ការវិភាគនិងការយល់ដឹង

source: Please sign in to access the system.
km: សូមចូលដើម្បីចូលប្រើប្រព័ន្ធ។

source: Sign In
km: ចូល

source: Secure access for students, faculty, and staff
km: ការទទួលបានសុវត្ថិភាពសម្រាប់និស្សិតមហាវិទ្យាល័យនិងបុគ្គលិក

source: All Study Times
km: ពេលវេលាសិក្សាទាំងអស់

source: Monks Only
km: ព្រះសង្ឃតែប៉ុណ្ណោះ

source: Non-Monks Only
km: មិនមែនព្រះសង្ឃប៉ុណ្ណោះ

source: Transfer Students
km: ផ្ទេរនិស្សិត

source: Non-Transfer
km: ការមិនផ្ទេរប្រាក់

source: Monks
km: ព្រះសង្ឃច័ន្ទ

source: Transfers
km: ការថតបាន

source: Status Distribution
km: ការចែកចាយស្ថានភាព

source: Django site admin
km: Django រដ្ឋបាលគេហទំព័រ

source: Django administration
km: រដ្ឋបាល Django

source: Welcome to the PUCSR Student Information System
km: សូមស្វាគមន៍ចំពោះប្រព័ន្ធព័ត៌មាននិស្សិត PUCSR

source: Sign Out
km: ចេញចេញ

source: Sign Up
km: ចុះឈ្មោះ

source: Delete Confirmation
km: លុបការបញ្ជាក់

source: Are you sure you want to delete this item? This action cannot be undone.
km: តើអ្នកពិតជាចង់លុបធាតុនេះឬ? សកម្មភាពនេះមិនអាចធ្វើវិញបានទេ។

source: Item to be deleted:
km: ធាតុដែលត្រូវលុប:

source: View details
km: មើលព័ត៌មានលម្អិត

source: Delete
km: របៅបេលរសច

source: Edit
km: បិនិត្យ

source: Are you sure you want to delete this item?
km: តើអ្នកពិតជាចង់លុបធាតុនេះឬ?

source: Back to list
km: ត្រលប់ទៅបញ្ជីវិញ

source: There were errors with your submission
km: មានកំហុសជាមួយនឹងការដាក់ស្នើរបស់អ្នក

source: Save
km: សរេង្គាហ

source: Dismiss
km: បន្ដេញចោល

source: Select all
km: ជ្រើសរើសទាំងអស់

source: Toggle sidebar
km: បិទបើកផ្នែកខាងរបារចំហៀង

source: Change language
km: ផ្លាស់ប្តូរភាសា

source: Toggle dark mode
km: បិទបើករបៀបងងឹត

source: View notifications
km: មើលការជូនដំណឹង

source: User menu
km: ម៉ឺនុយអ្នកប្រើ

source: Dismiss message
km: ច្រានចោលសារ

source: Close
km: បិត

source: Application Management
km: ការគ្រប់គ្រងកម្មវិធី

source: Print
km: អកសរបុម្ក

source: Copy to Clipboard
km: ចម្លងទៅក្ដារតម្បៀតខ្ទាស់

source: QuickBooks Financial Reports
km: របាយការណ៍ហិរញ្ញវត្ថុរហ័ស

source: Generate monthly financial reports for manual entry into QuickBooks.
km: បង្កើតរបាយការណ៍ហិរញ្ញវត្ថុប្រចាំខែសម្រាប់ការបញ្ចូលដោយដៃទៅក្នុង QuickBooks ។

source: Select Month
km: ជ្រើសរើសខែ

source: Report Type
km: ប្រភេទរបាយការណ៍

source: Cash Receipts Summary
km: សង្ខេបវិក័យប័ត្រសាច់ប្រាក់

source: (Revenue by category)
km: (ប្រាក់ចំណូលតាមប្រភេទ)

source: Journal Entry Format
km: ទ្រង់ទ្រាយធាតុទិនានុប្បវត្តិ

source: (Ready to copy into QuickBooks)
km: (ត្រៀមខ្លួនចម្លងចូលទៅក្នុងសៀវភៅរហ័ស)

source: Daily Deposits Report
km: របាយការណ៍ប្រាក់បញ្ញើប្រចាំថ្ងៃ

source: (For bank reconciliation)
km: (សម្រាប់ការផ្សះផ្សាធនាគារ)

source: Output Format
km: ទ្រង់ទ្រាយលទ្ធផល

source: Readable Text
km: អត្ថបទដែលអាចអានបាន

source: Preview
km: បុរេតសសន៍

source: Download
km: របចាបរេកា

source: How to use these reports:
km: របៀបប្រើរបាយការណ៍ទាំងនេះ:

source: The Journal Entry format can be copied directly into QuickBooks as a journal entry
km: ទិនានុប្បវត្តិលេខទិនានុប្បវត្តិអាចត្រូវបានចម្លងដោយផ្ទាល់ទៅក្នុងសៀវភៅរហ័សជាធាតុទិនានុប្បវត្តិ

source: Cash Receipts Summary shows total revenue by category for the month
km: សង្ខេបវិក័យប័ត្រសាច់ប្រាក់បង្ហាញពីប្រាក់ចំណូលសរុបតាមប្រភេទសម្រាប់ខែ

source: Daily Deposits Report helps with bank reconciliation
km: របាយការណ៍ប្រាក់បញ្ញើប្រចាំថ្ងៃជួយដល់ការផ្សះផ្សាធនាគារ

source: All reports follow cash-basis (service) accounting principles
km: របាយការណ៍ទាំងអស់អនុវត្តតាមគោលការណ៍គណនេយ្យមូលដ្ឋាន

source: Report Generation Failed
km: ជំនាន់របាយការណ៍បានបរាជ័យ

source: An error occurred while generating the QuickBooks report:
km: កំហុសមួយបានកើតឡើងខណៈពេលបង្កើតរបាយការណ៍ QuickBooks:

source: Back to Reports
km: ត្រលប់ទៅរបាយការណ៍

source: Go Back
km: ត្រឡប់ទៅក្រោយវិញ

source: If this problem persists, please contact IT support.
km: ប្រសិនបើបញ្ហានេះនៅតែបន្តកើតមានសូមទាក់ទងវាគាំទ្រ។

source: Please sign in to access your account
km: សូមចូលដើម្បីចូលប្រើគណនីរបស់អ្នក

source: Need help? Contact your system administrator.
km: ត្រូវការជំនួយទេ? ទាក់ទងអ្នកគ្រប់គ្រងប្រព័ន្ធរបស់អ្នក។

source: Pannasastra University of Cambodia
km: សាកលវិទ្យាល័យបញ្ញាណាស្ការ៉ាកម្ពុជា

source: Siem Reap Campus
km: បរិវេណសៀមរាប

source: Navigate using the sidebar to access different areas of the system based on your role.
km: រុករកដោយប្រើរបារចំហៀងដើម្បីចូលទៅកាន់តំបន់ផ្សេងៗគ្នានៃប្រព័ន្ធដោយផ្អែកលើតួនាទីរបស់អ្នក។

source: Full system access
km: ការចូលដំណើរការប្រព័ន្ធពេញ

source: Finance Management
km: ការគ្រប់គ្រងហិរញ្ញវត្ថុ

source: Payments, invoicing, and reports
km: ការទូទាត់វិក្កយបត្រនិងរបាយការណ៍

source: Enrollment and student records
km: ការចុះឈ្មោះនិងកំណត់ត្រានិស្សិត

source: Courses, programs, and scheduling
km: វគ្គសិក្សាកម្មវិធីនិងការរៀបចំកាលវិភាគ

source: Test applications and administration
km: ការសាកល្បងកម្មវិធីនិងរដ្ឋបាល

source: Your Role
km: តួនាទីរបស់អ្នក

source: Institution
km: ការបង្កាត់

source: System Version
km: ជំនាន់ប្រព័ន្ធ

source: Test Base2 Template
km: សាកល្បងដើមគោលលេខ 2

source: Base2.html Template Test
km: ការធ្វើតេស្ដពុម្ពមូលដ្ឋាន 2.html

source: This page is using your modified base2.html template. Test all the navigation features to make sure everything works as expected.
km: ទំព័រនេះកំពុងប្រើគំរូមូលដ្ឋានដែលបានកែប្រែរបស់អ្នក។ សាកល្បងលក្ខណៈពិសេសនាវាចរណ៍ទាំងអស់ដើម្បីឱ្យប្រាកដថាអ្វីៗដំណើរការដូចការរំពឹងទុក។

source: Hamburger Menu
km: ម៉ឺនុយ Hamburger

source: Click the hamburger menu button in the top-left to test sidebar collapse/expand functionality.
km: ចុចប៊ូតុងមឺហាំប៊ឺហ្គឺនៅផ្នែកខាងលើខាងលើដើម្បីសាកល្បងការដួលរលំរបារចំហៀង / ពង្រីកមុខងារ។

source: Sidebar Navigation
km: នាវាចរណ៍របារចំហៀង

source: The sidebar should show all navigation items with clear, readable text on a dark background.
km: របារចំហៀងគួរតែបង្ហាញធាតុនាវាចរណ៍ទាំងអស់ដែលមានអត្ថបទច្បាស់លាស់ច្បាស់លាស់នៅលើផ្ទៃខាងក្រោយងងឹត។

source: Top Controls
km: ការគ្រប់គ្រងលើកំពូល

source: Test the language switcher, theme toggle, notifications, and user menu in the top navigation bar.
km: សាកល្បងឧបករណ៍ប្តូរភាសាការបិទបើកការជូនដំណឹងនិងម៉ឺនុយអ្នកប្រើនៅក្នុងរបារុករកខាងលើ។

source: Current User
km: អ្នកប្រើប្រាស់បច្ចុប្បន្ន

source: Current Language
km: ភាសាបច្ចុប្បន្ន

source: Testing Your Modifications
km: សាកល្បងការកែប្រែរបស់អ្នក

source: Verify the hamburger menu icon is visible and clickable
km: ផ្ទៀងផ្ទាត់រូបតំណាងម៉ឺនុយ Hamburger អាចមើលឃើញនិងអាចចុចបាន

source: Check that all sidebar text is readable (no black-on-black)
km: ពិនិត្យមើលថាអត្ថបទរបារចំហៀងទាំងអស់អាចអានបាន (គ្មានខ្មៅ - ខ្មៅ)

source: Test sidebar collapse/expand functionality
km: ការដណ្តើមរបារចំហៀងសាកល្បង / ពង្រីកមុខងារ

source: Confirm sidebar starts in the expanded state
km: បញ្ជាក់របារចំហៀងចាប់ផ្តើមនៅក្នុងស្ថានភាពដែលបានពង្រីក

source: Test all top navigation buttons (language, theme, notifications, user)
km: សាកល្បងប៊ូតុងរុករកកំពូលទាំងអស់ (ភាសាប្រធានបទការជូនដំណឹងអ្នកប្រើ)

source: Check mobile responsiveness by resizing the browser window
km: ពិនិត្យមើលការឆ្លើយតបតាមទូរស័ព្ទដោយផ្លាស់ប្តូរទំហំបង្អួចកម្មវិធីរុករក

source: Test Fixed Top Navigation
km: សាកល្បងការរុករកកំពូល ៗ ថេរ

source: Fixed Top Navigation Layout
km: ប្លង់នាវាចរណ៍ខាងលើថេរ

source: This template has been completely rebuilt to ensure:
km: គំរូនេះត្រូវបានសាងសង់ឡើងវិញទាំងស្រុងដើម្បីធានាថា:

source: Sidebar starts expanded (visible) by default
km: របារចំហៀងចាប់ផ្តើមពង្រីក (មើលឃើញ) តាមលំនាំដើម

source: Hamburger menu is clearly visible with white background
km: ម៉ឺនុយ Hamburger អាចមើលឃើញយ៉ាងច្បាស់ជាមួយនឹងផ្ទៃខាងក្រោយពណ៌ស

source: All sidebar text is light colored on dark background
km: អត្ថបទរបារចំហៀងទាំងអស់គឺមានពណ៌ស្រាលនៅលើផ្ទៃខាងក្រោយងងឹត

source: No black-on-black text issues
km: មិនមានបញ្ហាអត្ថបទខ្មៅខ្មៅទេ

source: Clean, professional appearance
km: ស្អាត, រូបរាងវិជ្ជាជីវៈ

source: Look at the top-left corner. You should see a white button with three dark lines (hamburger icon). It should have a shadow to make it stand out.
km: រកមើលនៅជ្រុងខាងឆ្វេងខាងលើ។ អ្នកគួរតែឃើញប៊ូតុងពណ៌សមួយដែលមានបន្ទាត់ងងឹតបី (រូបតំណាង Hamburger) ។ វាគួរតែមានស្រមោលដើម្បីធ្វើឱ្យវាលេចធ្លោ។

source: Sidebar Visibility
km: ភាពមើលឃើញរបស់របារចំហៀង

source: The sidebar should be dark blue/gray with light gray text. All menu items should be clearly readable. The sidebar should be expanded (showing text) by default.
km: របារចំហៀងគួរតែមានពណ៌ខៀវចាស់ / ពណ៌ប្រផេះដែលមានអក្សរពណ៌ប្រផេះស្រាល។ ធាតុម៉ឺនុយទាំងអស់គួរតែអាចអានបានយ៉ាងច្បាស់។ របារចំហៀងគួរតែត្រូវបានពង្រីក (បង្ហាញអត្ថបទ) តាមលំនាំដើម។

source: Interactive Features
km: លក្ខណៈពិសេសអន្តរកម្ម

source: Click the hamburger menu to collapse/expand the sidebar. Your preference is saved. All top navigation buttons should work properly.
km: ចុចលើមឺនុយហាំប៊ឺហ្គឺដើម្បីដួលរលំ / ពង្រីករបារចំហៀង។ ចំណង់ចំណូលចិត្តរបស់អ្នកត្រូវបានរក្សាទុក។ ប៊ូតុងរុករកកំពូលទាំងអស់គួរតែដំណើរការបានត្រឹមត្រូវ។

source: System Status
km: ស្ថានភាពប្រព័ន្ធ

source: User:
km: អ្នកប្រើប្រាស់:

source: Language:
km: ភាសា:

source: Term:
km: ពាក្យ:

source: Test New Base Template
km: សាកល្បងគំរូមូលដ្ឋានថ្មី

source: New Base Template Test
km: តេស្តគំរូមូលដ្ឋានថ្មី

source: Testing the modular component structure and responsive design.
km: សាកល្បងរចនាសម្ព័ន្ធសមាសធាតុសមាសធាតុនិងការរចនាឆ្លើយតប។

source: Responsive Design
km: ការរចនាឆ្លើយតប

source: Mobile-first approach with collapsible sidebar and touch-friendly navigation.
km: វិធីសាស្រ្តដំបូង - ទូរស័ព្ទចល័តដែលមានអក្សរសិល្ប៍ដែលអាចដួលរលំនិងការធ្វើនាវាចរណ៍ដែលងាយស្រួលប៉ះ។

source: Modular Components
km: សមាសភាគម៉ូឌុល

source: Separated header, sidebar, and message components for maintainability.
km: បឋមកថារបារចំហៀងនិងសមាសធាតុសារសម្រាប់ការថែរក្សា។

source: Dark Mode
km: របៀបងងឹត

source: System-aware dark mode with localStorage persistence and smooth transitions.
km: របៀបងងឹតនៃប្រព័ន្ធដែលមានរបៀបរស់នៅក្នុងស្រុកនិងការផ្លាស់ប្តូររលូន។

source: HTMX Ready
km: HTMX ត្រៀមរួចរាល់

source: Integrated HTMX support with proper event handling and loading states.
km: ការគាំទ្រ HTMX រួមបញ្ចូលគ្នាជាមួយនឹងការដោះស្រាយព្រឹត្តិការណ៍ត្រឹមត្រូវនិងផ្ទុករដ្ឋ។

source: Accessible
km: ដេលចុលងាយ

source: ARIA labels, keyboard navigation, and screen reader friendly structure.
km: ស្លាក Aria, ការធ្វើនាវាចរណ៍ក្តារចុច, និងរចនាសម្ព័ន្ធមិត្តរបស់អ្នកអានដែលមានភាពងាយស្រួល។

source: Optimized
km: សុទិដ្ឋិនិយម

source: Efficient CSS loading, minimal JavaScript, and optimized for production.
km: ការផ្ទុក CSS ប្រកបដោយប្រសិទ្ធភាព, JavaScript តិចតួចបំផុត, និងធ្វើឱ្យប្រសើរសម្រាប់ផលិតកម្ម។

source: Interactive Features Test
km: ការធ្វើតេស្តលក្ខណៈពិសេសអន្តរកម្ម

source: Toggle Sidebar
km: បិទបើកផ្នែកខាងរបារចំហៀង

source: Toggle Theme
km: បិទបើកស្បែក

source: Refresh Page
km: ធ្វើឱ្យទំព័រស្រស់

source: CSS Architecture
km: ស្ថាបត្យកម្ម CSS

source: Test Simple Top Navigation
km: សាកល្បងនាវាចរណ៍កំពូលសាមញ្ញ

source: Test Simple Top Navigation Layout
km: សាកល្បងប្លង់នាវាចរណ៍ខាងលើសាមញ្ញ

source: This page demonstrates the simple top navigation layout with inline styles to ensure visibility. The sidebar should have a dark background with light text that's clearly readable.
km: ទំព័រនេះបង្ហាញពីប្លង់នាវាចរណ៍ខ្ពស់បំផុតដែលមានស្ទីលក្នុងតួដើម្បីធានាបាននូវភាពមើលឃើញ។ របារចំហៀងគួរតែមានផ្ទៃខាងក្រោយងងឹតដែលមានអត្ថបទពន្លឺដែលអាចអានបានយ៉ាងច្បាស់។

source: Sidebar Toggle
km: បិទបើករបាំងបិទ

source: Click the hamburger menu button (three lines) in the top-left corner to collapse/expand the sidebar. Your preference is saved automatically.
km: ចុចប៊ូតុងមឺនុយ Hamburger (បីបន្ទាត់) នៅជ្រុងខាងឆ្វេងខាងលើដើម្បីដួលរលំ / ពង្រីករបារចំហៀង។ ចំណូលចិត្តរបស់អ្នកត្រូវបានរក្សាទុកដោយស្វ័យប្រវត្តិ។

source: Dark Mode Toggle
km: បិទ / បើករបៀប

source: Click the sun/moon icon in the top navigation to switch between light and dark themes. Works with system preferences.
km: ចុចរូបតំណាងថ្ងៃលិច / MoR MOL ក្នុងការរុករកខាងលើដើម្បីប្តូររវាងស្បែកពន្លឺនិងខ្មៅ។ ធ្វើការជាមួយចំណង់ចំណូលចិត្តរបស់ប្រព័ន្ធ។

source: Language Toggle
km: TRAGINT TONGEN

source: Click the language button in the top navigation to switch between English and Khmer. The dropdown shows both options with flags.
km: ចុចប៊ូតុងភាសាក្នុងការរុករកខាងលើដើម្បីប្តូររវាងភាសាអង់គ្លេសនិងភាសាខ្មែរ។ ការទម្លាក់ចុះបង្ហាញជម្រើសទាំងពីរជាមួយទង់ជាតិ។

source: Notifications
km: ការជូនដំណឹង

source: The bell icon shows a red notification badge with the number of unread messages. This is a visual indicator for staff.
km: កណ្តឹងរូបតំណាងបង្ហាញផ្លាកសញ្ញាជូនដំណឹងក្រហមដែលមានចំនួនសារមិនទាន់អាន។ នេះគឺជាសូចនាករដែលមើលឃើញសម្រាប់បុគ្គលិក។

source: User Menu
km: ម៉ឺនុយអ្នកប្រើ

source: Your avatar shows your initial with a gradient background. Click it to access profile settings and sign out options.
km: រូបតំណាងរបស់អ្នកបង្ហាញពីដំបូងរបស់អ្នកជាមួយនឹងផ្ទៃខាងក្រោយជម្រាល។ ចុចវាដើម្បីចូលទៅកាន់ការកំណត់ទម្រង់និងចេញជម្រើស។

source: Mobile Friendly
km: មិត្តភាពចល័ត

source: On mobile devices, the sidebar becomes an overlay. Resize your browser window to test the responsive behavior.
km: នៅលើឧបករណ៍ចល័តរបារចំហៀងក្លាយជាការត្រួតលើគ្នា។ ផ្លាស់ប្តូរទំហំបង្អួចកម្មវិធីរុករករបស់អ្នកដើម្បីសាកល្បងឥរិយាបទឆ្លើយតប។

source: Current System Status
km: ស្ថានភាពប្រព័ន្ធបច្ចុប្បន្ន

source: Sample Data Table
km: តារាងទិន្នន័យគំរូ

source: John Doe
km: ចនដូ

source: Jane Smith
km: ជេនស្មីត

source: Sample Form
km: ទម្រង់គំរូ

source: Enter student name
km: បញ្ចូលឈ្មោះរបស់សិស្ស

source: Business Administration
km: ការគ្រប់គ្រងពាណិជ្ជកម្ម

source: TESOL
km: ត្បូង

source: International Relations
km: ទំនាក់ទំនងអន្តរជាតិ

source: Save Student
km: រក្សាទុកនិស្សិត

source: Testing Instructions
km: ការណែនាំសាកល្បង

source: The hamburger menu button should be clearly visible in the top-left
km: ប៊ូតុងម៉ឺនុយ Hamburger គួរតែអាចមើលឃើញយ៉ាងច្បាស់នៅផ្នែកខាងលើខាងលើ

source: The sidebar should have a dark background with light gray text
km: របារចំហៀងគួរតែមានផ្ទៃខាងក្រោយងងឹតមួយដែលមានអក្សរពណ៌ប្រផេះស្រាល

source: Navigation items should be clearly readable and highlight on hover
km: ធាតុនាវាចរណ៍គួរតែអាចអានបានយ៉ាងច្បាស់និងបន្លិចនៅលើសំកាំង

source: All top navigation buttons should be functional
km: ប៊ូតុងរុករកកំពូលទាំងអស់គួរតែមានមុខងារ

source: Language switching should work (requires form submission)
km: ការផ្លាស់ប្តូរភាសាគួរតែដំណើរការ (ត្រូវការការដាក់ស្នើទម្រង់)

source: Dark mode toggle should switch the overall theme
km: ការបិទបើករបៀបងងឹតគួរតែប្តូរស្បែករួម

source: Test SVG Top Navigation
km: សាកល្បងការធ្វើនាវាចរណ៍កំពូល SVG

source: SVG-Based Navigation Template
km: គំរូនាវាចរណ៍ដែលមានមូលដ្ឋាននៅ SVG

source: This template uses inline SVG for the hamburger icon - no Font Awesome dependency!
km: គំរូនេះប្រើក្នុងជួរអេសជីជីសម្រាប់រូបតំណាងហាំប៊ឺហ្គឺ - មិនមានភាពអាស្រ័យអស្ចារ្យទេ!

source: The hamburger menu icon is now a pure SVG element that will always display correctly. The icon consists of three horizontal lines drawn with SVG paths.
km: រូបតំណាងម៉ឺនុយ Hamburger ឥឡូវនេះគឺជាធាតុ SVG សុទ្ធដែលនឹងបង្ហាញត្រឹមត្រូវ។ រូបតំណាងនេះមានបន្ទាត់ផ្តេកបីដែលត្រូវបានគូរជាមួយផ្លូវ SVG ។

source: Visual Checklist
km: បញ្ជីផ្ទៀងផ្ទាត់ដែលមើលឃើញ

source: Hamburger Menu Icon
km: រូបតំណាងម៉ឺនុយ Hamburgerger

source: Look at the top-left corner. You should see a white button with three dark gray horizontal lines.
km: រកមើលនៅជ្រុងខាងឆ្វេងខាងលើ។ អ្នកគួរតែឃើញប៊ូតុងពណ៌សមួយដែលមានបន្ទាត់ផ្តេកពណ៌ប្រផេះងងឹតបី។

source: The left sidebar should be dark blue with light gray text. All menu items should be clearly readable.
km: របារចំហៀងខាងឆ្វេងគួរតែមានពណ៌ខៀវចាស់ជាមួយនឹងអត្ថបទពណ៌ប្រផេះស្រាល។ ធាតុម៉ឺនុយទាំងអស់គួរតែអាចអានបានយ៉ាងច្បាស់។

source: Default State
km: ស្ថានភាពដើម

source: The sidebar should be expanded (fully visible) when you first load the page.
km: របារចំហៀងគួរតែត្រូវបានពង្រីក (មើលឃើញយ៉ាងពេញលេញ) នៅពេលអ្នកផ្ទុកទំព័រដំបូង។

source: Interactive Test
km: តេស្តអន្តរកម្ម

source: Click the hamburger menu button to collapse/expand the sidebar. Your preference will be saved.
km: ចុចប៊ូតុងមឺហាំប៊ឺហ្គឺដើម្បីដួលរលំ / ពង្រីករបារចំហៀង។ ចំណូលចិត្តរបស់អ្នកនឹងត្រូវបានរក្សាទុក។

source: Technical Implementation
km: ការអនុវត្តន៍បច្ចេកទេស

source: The hamburger icon is created with this SVG code:
km: រូបតំណាង Hamburger ត្រូវបានបង្កើតជាមួយលេខកូដ SVG នេះ:

source: This ensures the icon will always display correctly, regardless of whether Font Awesome loads.
km: នេះធានាថារូបតំណាងនឹងបង្ហាញឱ្យបានត្រឹមត្រូវជានិច្ចដោយមិនគិតពីការផ្ទុកពុម្ពអក្សរអស្ចារ្យ។

source: Test Top Navigation
km: សាកល្បងនាវាចរណ៍ខាងលើ
