Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: Test Top Navigation Layout
km: សាកល្បងប្លង់នាវាចរណ៍ខាងលើ

source: This page demonstrates the new top navigation layout with collapsible sidebar, dark/light mode toggle, language switching, and notification system.
km: ទំព័រនេះបង្ហាញពីប្លង់នាវាចរណ៍ថ្មីបំផុតដែលមានរបារចំហៀងដែលអាចដួលរលំបិទ / បើក OR ងងឹតនៃរបៀបប្តូរភាសានិងប្រព័ន្ធជូនដំណឹង។

source: Theme Toggle
km: ការបិទភ្ជាប់ស្បែក

source: Click the sun/moon icon in the top navigation to switch between light and dark themes. Your preference is saved automatically.
km: ចុចរូបតំណាងថ្ងៃលិច / MoR MOL ក្នុងការរុករកខាងលើដើម្បីប្តូររវាងស្បែកពន្លឺនិងខ្មៅ។ ចំណូលចិត្តរបស់អ្នកត្រូវបានរក្សាទុកដោយស្វ័យប្រវត្តិ។

source: Language Switch
km: ប្តូរភាសា

source: Click the language dropdown in the top navigation to switch between English and Khmer. The page will reload with your selected language.
km: ចុចលើការទម្លាក់ចុះភាសាក្នុងការរុករកខាងលើដើម្បីប្តូររវាងភាសាអង់គ្លេសនិងភាសាខ្មែរ។ ទំព័រនឹងផ្ទុកឡើងវិញនូវភាសាដែលអ្នកបានជ្រើសរើស។

source: The bell icon shows a notification counter with animated badge. Click it to see sample notifications dropdown.
km: រូបតំណាងកណ្ដឹងបង្ហាញតុជូនដំណឹងជាមួយនឹងផ្លាកសញ្ញាដែលមានចលនា។ ចុចវាដើម្បីមើលការចុះបញ្ជីការចុះបញ្ជីការជូនដំណឹងគំរូ។

source: Collapsible Sidebar
km: របារចំហៀងដែលដួលរលំ

source: Click the hamburger menu icon next to the logo to collapse the sidebar and gain more screen real estate. Your preference is remembered.
km: ចុចរូបតំណាង Hamburger នៅជាប់នឹងឡូហ្គូដើម្បីដួលរលំរបារចំហៀងហើយទទួលបានអចលនទ្រព្យអេក្រង់កាន់តែច្រើន។ ចំណង់ចំណូលចិត្តរបស់អ្នកត្រូវបានចងចាំ។

source: User Profile
km: ទម្រង់អ្នកប្រើប្រាស់

source: Click your avatar in the top-right corner to access profile settings, admin panel (if applicable), and sign out options.
km: ចុចលើរូបតំណាងរបស់អ្នកនៅជ្រុងខាងលើផ្នែកខាងស្តាំដើម្បីចូលប្រើទម្រង់ការចូលប្រើផ្ទាំងគ្រប់គ្រង (បើមាន) និងចេញជម្រើសចេញ។

source: Mobile Responsive
km: ឆ្លើយតបតាមទូរស័ព្ទចល័ត

source: The layout adapts to mobile devices with an overlay sidebar and optimized touch targets for easy navigation.
km: ប្លង់សម្របខ្លួនទៅនឹងឧបករណ៍ចល័តដែលមានរបារចំហៀងត្រួតលើគ្នានិងគោលដៅប៉ះដែលមានប្រសិទ្ធិភាពសម្រាប់ការរុករកងាយស្រួល។

source: Try collapsing the sidebar using the hamburger menu
km: ព្យាយាមដួលរលំរបារចំហៀងដោយប្រើមឺនុយ Hamburger

source: Toggle between light and dark themes
km: បិទបើករវាងស្បែកពន្លឺនិងងងឹត

source: Click the notification bell to see sample messages
km: ចុចកណ្តឹងការជូនដំណឹងដើម្បីមើលសារគំរូ

source: Test the language switcher dropdown
km: សាកល្បងការទម្លាក់គ្រាប់បែកភាសា

source: Check your user profile dropdown
km: ពិនិត្យការទម្លាក់ចុះផ្សាយរបស់អ្នកប្រើរបស់អ្នក

source: Resize the browser window to test mobile responsiveness
km: ផ្លាស់ប្តូរទំហំបង្អួចកម្មវិធីរុករកដើម្បីសាកល្បងការឆ្លើយតបតាមទូរស័ព្ទ

source: Emergency Contacts
km: ទំនាក់ទំនងបន្ទាន់

source: Major History
km: ប្រវត្តិសាស្រ្តសំខាន់ៗ

source: Course Enrollments
km: ការចុះឈ្មោះពិតណាស់

source: Audit Log
km: កំណត់ហេតុនៃសវនកម្ម

source: Primary
km: បឋម

source: No emergency contacts on file.
km: មិនមានទំនាក់ទំនងបន្ទាន់លើឯកសារទេ។

source: Major Declaration History
km: ប្រវត្តិប្រកាសសំខាន់ៗ

source: No major declarations found.
km: រកមិនឃើញការប្រកាសសំខាន់ៗទេ។

source: Major Conflict Detected
km: បានរកឃើញជម្លោះធំ ៗ

source: The declared major differs from the enrollment history major. Review needed.
km: មុខជំនាញដែលបានប្រកាសខុសគ្នាពីប្រវត្ដិសាស្ដ្រនៃការចុះឈ្មោះចូលរៀន។ ពិនិត្យឡើងវិញ។

source: Enrollment Summary
km: សង្ខេបការចុះឈ្មោះ

source: Total Courses
km: វគ្គសិក្សាសរុប

source: Current
km: ថ្ផី current

source: Recent Enrollments
km: ការចុះឈ្មោះថ្មីៗ

source: No enrollments found.
km: រកមិនឃើញការចុះឈ្មោះទេ។

source: Recent Activity
km: សកម្មភាពថ្មីៗ

source: No audit log entries found.
km: រកមិនឃើញធាតុកំណត់ហេតុសវនករ។

source: Class Scheduling
km: ការរៀបចំកាលវិភាគថ្នាក់

source: Create Class
km: បង្កើតថ្នាក់

source: Classes
km: ថ្នាក់

source: Schedule
km: កម្ផវិធី

source: Loading...
km: កំពុងផ្ទុក ...

source: An error occurred
km: កំហុសមួយបានកើតឡើង

source: Please try again or contact support if the problem persists.
km: សូមព្យាយាមម្តងទៀតឬទាក់ទងគាំទ្រប្រសិនបើបញ្ហានៅតែកើតមាន។

source: Section
km: ផ្នេក

source: More
km: រេចីនចាង

source: Copy Class
km: ថ្នាក់ចម្លង

source: Print Roster
km: បោះពុម្ពបញ្ជីឈ្មោះ

source: Are you sure you want to cancel this class?
km: តើអ្នកពិតជាចង់បោះបង់ថ្នាក់នេះមែនទេ?

source: Cancel Class
km: បោះបង់ថ្នាក់

source: Combined With
km: រួមបញ្ចូលជាមួយ

source: Weight
km: តមងន់

source: enrolled
km: ដេលអប្ដូររឺចុះឈ្មោះ

source: max
km: អស្ដី

source: Available Spots
km: ចំណុចដែលមាន

source: Waitlist
km: បញ្ជីរង់ចាំ

source: Manage Enrollments
km: គ្រប់គ្រងការចុះឈ្មោះ

source: Quick Stats
km: ស្ថិតិរហ័ស

source: Attendance Rate
km: អត្រាការចូលរួម

source: Average Grade
km: ថ្នាក់មធ្យម

source: Print Details
km: ព័ត៌មានបោះពុម្ព

source: View Roster
km: មើលបញ្ជីឈ្មោះ

source: classes for
km: ថ្នាក់សម្រាប់

source: Course code, title, or teacher
km: លេខកូដវគ្គសិក្សាចំណងជើងឬគ្រូ

source: All Times
km: គ្រប់ពេលវេលា

source: All Types
km: គ្រប់ប្រភេទ

source: Advanced Filters
km: តម្រងកម្រិតខ្ពស់

source: All Teachers
km: គ្រូទាំងអស់

source: All Rooms
km: បន្ទប់ទាំងអស់

source: Combined Classes Only
km: ថ្នាក់រួមបញ្ចូលគ្នាតែប៉ុណ្ណោះ

source: Has Enrollments
km: មានការចុះឈ្មោះ

source: Apply Filters
km: អនុវត្តតម្រង

source: View:
km: មើល:

source: Bulk Actions
km: សកម្មភាពភាគច្រើន

source: Export Selected
km: ការនាំចេញដែលបានជ្រើសរើស

source: Update Status
km: ស្ថានភាពធ្វើបច្ចុប្បន្នភាព

source: Delete Selected
km: លុបដែលបានជ្រើសរើស

source: Apply
km: រេបីចារបយោចន៍

source: No classes found
km: រកមិនឃើញថ្នាក់

source: Try adjusting your filters or create a new class.
km: ព្យាយាមកែសំរួលតម្រងរបស់អ្នកឬបង្កើតថ្នាក់ថ្មី។

source: Please select an action
km: សូមជ្រើសរើសសកម្មភាពមួយ

source: Please select at least one class
km: សូមជ្រើសរើសយ៉ាងហោចណាស់ថ្នាក់មួយ

source: Are you sure you want to delete the selected classes?
km: តើអ្នកពិតជាចង់លុបថ្នាក់ដែលបានជ្រើសរើសមែនទេ?

source: Type
km: បុម្ពអកសរ

source: Full
km: បេញ

source: Available
km: មានរបយោចន៍

source: spots
km: ចន្លោហ

source: Combined with
km: រួមបញ្ចូលជាមួយ

source: Enrollment Management
km: ការគ្រប់គ្រងការចុះឈ្មោះ

source: This class is full
km: ថ្នាក់នេះពេញហើយ

source: Search by student ID or name
km: ស្វែងរកដោយលេខសម្គាល់និស្សិតឬឈ្មោះ

source: Add
km: បុក / ករ

source: Current Enrollments
km: ការចុះឈ្មោះបច្ចុប្បន្ន

source: Are you sure you want to drop this student?
km: តើអ្នកពិតជាចង់ទម្លាក់សិស្សនេះមែនទេ?

source: No students enrolled yet
km: មិនទាន់មាននិស្សិតចុះឈ្មោះចូលរៀននៅឡើយទេ

source: Students will be automatically enrolled as spots become available.
km: និស្សិតនឹងចុះឈ្មោះដោយស្វ័យប្រវត្តិនៅពេលដែលមានចំណុចអាចរកបាន។

source: Manage Waitlist
km: គ្រប់គ្រងបញ្ជីរង់ចាំ

source: Select Term
km: ជ្រើសរើសរយៈពេល

source: Current Terms
km: លក្ខខណ្ឌបច្ចុប្បន្ន

source: No current terms available
km: មិនមានលក្ខខណ្ឌបច្ចុប្បន្នទេ

source: Future Terms
km: លក្ខខណ្ឌនាពេលអនាគត

source: View Past Terms
km: មើលលក្ខខណ្ឌមុន

source: Scheduling Dashboard
km: ផ្ទាំងគ្រប់គ្រងតារាងកាលបរិច្ឆេទ

source: Overview for
km: ទិដ្ឋភាពទូទៅ

source: Total Classes
km: ថ្នាក់សរុប

source: View all
km: មើលទាំងអស់

source: Active Classes
km: ថ្នាក់សកម្ម

source: View active
km: មើលសកម្ម

source: Total Enrollments
km: ការចុះឈ្មោះសរុប

source: Manage enrollments
km: គ្រប់គ្រងការចុះឈ្មោះ

source: Avg. Capacity
km: avg ។ មុខងារ

source: View report
km: មើលរបាយការណ៍

source: Create New Class
km: បង្កើតថ្នាក់ថ្មី

source: Batch Enrollment Upload
km: ការផ្ទុកឡើងបាច់បានចាក់ចូល

source: Recently Updated Classes
km: ថ្នាក់ដែលបានធ្វើបច្ចុប្បន្នភាពថ្មីៗនេះ

source: View all classes
km: មើលថ្នាក់ទាំងអស់

source: No classes yet
km: មិនទាន់មានថ្នាក់រៀននៅឡើយទេ

source: Get started by creating a new class.
km: ចាប់ផ្តើមដោយការបង្កើតថ្នាក់ថ្មី។

source: Alerts & Notifications
km: ការដាស់តឿននិងការជូនដំណឹង

source: Personal info
km: ព័ត៌មានផ្ទាល់ខ្លួន

source: Important dates
km: កាលបរិច្ឆេទសំខាន់

source: Users
km: បេញដ្ឋាន

source: This email has already been taken.
km: អ៊ីមែលនេះត្រូវបានគេយករួចហើយ។

source: Name of User
km: ឈ្មោះអ្នកប្រើប្រាស់

source: email address
km: អាសយដ្ឋានអ៊ីមែល

source: Information successfully updated
km: ព័ត៌មានបានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ
