Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: A line can have either debit or credit amount, not both.
km: បន្ទាត់មួយអាចមានទាំងឥណពន្ធឬចំនួនទឹកប្រាក់ឥណទានមិនមែនទាំងពីរទេ។

source: Either debit or credit amount must be greater than zero.
km: ទាំងឥណពន្ធឬចំនួនទឹកប្រាក់ឥណទានត្រូវតែធំជាងសូន្យ។

source: Department code is required for this G/L account.
km: លេខកូដនាយកដ្ឋានត្រូវបានទាមទារសម្រាប់គណនី g / l នេះ។

source: Exported
km: នាំចេញ

source: Partially Exported
km: ការនាំចេញផ្នែកខ្លះ

source: Batch Number
km: លេខបាច់

source: Unique batch identifier
km: គ្រឿងសម្គាល់បាច់តែមួយគត់

source: Batch Date
km: កាលបរិច្ឆេទបាច់

source: Date this batch was created
km: កាលបរិច្ឆេទឈុតនេះត្រូវបានបង្កើតឡើង

source: Accounting period for this batch (YYYY-MM)
km: រយៈពេលគណនេយ្យសម្រាប់បាច់នេះ (YYYY-MM)

source: Current batch status
km: ស្ថានភាពបាច់បច្ចុប្បន្ន

source: Total Entries
km: ធាតុសរុប

source: Number of journal entries in this batch
km: ចំនួននៃធាតុទិនានុប្បវត្តិនៅក្នុងបាច់នេះ

source: Total debit amount in this batch
km: ចំនួនទឹកប្រាក់ឥណពន្ធសរុបនៅក្នុងបាច់នេះ

source: Export File
km: នាំចេញឯកសារ

source: Path to exported file
km: ផ្លូវទៅកាន់ឯកសារដែលបាននាំចេញ

source: Exported By
km: នាំចេញដោយ

source: User who exported this batch
km: អ្នកប្រើដែលនាំចេញបាច់នេះ

source: Exported Date
km: កាលបរិច្ឆេទនាំចេញ

source: When this batch was exported
km: នៅពេលបាច់នេះត្រូវបាននាំចេញ

source: Error details if export failed
km: កំហុសកំហុសប្រសិនបើការនាំចេញបានបរាជ័យ

source: Additional notes about this batch
km: កំណត់ចំណាំបន្ថែមអំពីបាច់នេះ

source: G/L Batch
km: g / l បាច់

source: G/L Batches
km: g / l បាច់

source: Conversions
km: ការរបបមនមនុរ

source: Percentage Range
km: ជួរភាគរយ

source: Either numeric score or letter grade must be provided.
km: ទាំងពិន្ទុលេខឬថ្នាក់អក្សរត្រូវតែផ្តល់ជូន។

source: Grade Information
km: ព័ត៌មានថ្នាក់

source: Grade Metadata
km: ទិន្នន័យមេតាថ្នាក់ទី

source: Audit Trail
km: ផ្លូវសវនកម្ម

source: Notification
km: របាយការ

source: Grade
km: អាេយបិន្ទុ

source: Recalculate session grades
km: គណនាឡើងវិញថ្នាក់វគ្គ

source: Approve selected grades
km: អនុម័តថ្នាក់ដែលបានជ្រើសរើស

source: Finalize selected grades
km: បញ្ចប់ថ្នាក់ដែលបានជ្រើសរើស

source: Mark students as notified
km: សម្គាល់សិស្សថាត្រូវបានជូនដំណឹង

source: Session Grade
km: ថ្នាក់ថ្នាក់

source: Calculation Details
km: ព័ត៌មានលម្អិតអំពីការគណនា

source: Session
km: សម័យរបចុម

source: Recalculate selected grades
km: គណនាឡើងវិញថ្នាក់ដែលបានជ្រើសរើស

source: Change Information
km: ផ្លាស់ប្តូរព័ត៌មាន

source: Previous Values
km: តម្លៃមុន

source: New Values
km: តម្លៃថ្មី

source: Additional Details
km: ព័ត៌មានលំអិតបន្ថែម

source: Change Summary
km: ផ្លាស់ប្តូរសង្ខេប

source: GPA Information
km: ព័ត៌មាន GPA

source: Credit Hours
km: ម៉ោងឥណទាន

source: Credits (Earned/Attempted)
km: ឥណទាន (ទទួលបាន / ប៉ុនប៉ង)

source: Recalculate selected GPAs
km: គណនាឡើងវិញ GPAs ដែលបានជ្រើសរើស

source: Language Standard (A-F, F<50%)
km: ស្តង់ដារភាសា (A-F, F <50%)

source: Language IEAP (A-F, F<60%)
km: ភាសាភាសា (A-F, F <60%)

source: Academic (A+ to F, F<60%)
km: អប់រំ (a + to f <60%)

source: Scale Name
km: ឈ្មោះខ្នាត

source: Descriptive name for this grading scale
km: ឈ្មោះពិពណ៌នាសម្រាប់មាត្រដ្ឋានជម្រាលនេះ

source: Scale Type
km: ប្រភេទខ្នាត

source: Type of grading scale
km: ប្រភេទជញ្ជីងនៃការដាក់ពិន្ទុ

source: Detailed description of this grading scale
km: ការពិពណ៌នាលំអិតនៃមាត្រដ្ឋានពិន្ទុនេះ

source: Whether this grading scale is currently in use
km: ថាតើមាត្រដ្ឋានពិន្ទុនេះកំពុងប្រើប្រាស់

source: Grading Scale
km: ខ្នាតពិន្ទុ

source: Grading Scales
km: ជញ្ជីងផ្តល់ពិន្ទុ

source: Letter Grade
km: ថ្នាក់អក្សរ

source: Letter grade (A+, A, A-, B+, etc.)
km: ថ្នាក់អក្សរ (a +, a, a-, b +, ល។ ល។ )

source: Minimum Percentage
km: ភាគរយអប្បបរមា

source: Minimum percentage for this grade
km: ភាគរយអប្បបរមាសម្រាប់ថ្នាក់នេះ

source: Maximum Percentage
km: ភាគរយអតិបរមា

source: Maximum percentage for this grade
km: ភាគរយអតិបរមាសម្រាប់ថ្នាក់នេះ

source: GPA Points
km: ចំនុច GPA

source: GPA points for this grade
km: ពិន្ទុ GPA សម្រាប់ថ្នាក់នេះ

source: Order for displaying grades (0 = highest)
km: បញ្ជាទិញសម្រាប់ការបង្ហាញថ្នាក់ (0 = ខ្ពស់បំផុត)

source: Grade Conversion
km: ការប្រែចិត្តជឿថ្នាក់

source: Grade Conversions
km: ការប្រែចិត្តជឿថ្នាក់

source: Maximum percentage must be greater than minimum percentage.
km: ភាគរយអតិបរមាត្រូវតែធំជាងភាគរយអប្បបរមា។

source: Manual Entry (Teacher)
km: ការបញ្ចូលដោយដៃ (គ្រូ)

source: Manual Entry (Clerk)
km: ការបញ្ចូលដោយដៃ (ស្មៀន)

source: Moodle Import
km: Moodle ការនាំចូល

source: Calculated
km: គណនា

source: Migrated from Legacy System
km: បានធ្វើចំណាកស្រុកពីប្រព័ន្ធមរតក

source: Finalized
km: បានបញ្ចប់

source: Student enrollment this grade belongs to
km: ការចុះឈ្មោះចូលរៀនរបស់និស្សិតថ្នាក់នេះជារបស់

source: Class component this grade is for
km: សមាសភាគថ្នាក់នេះគឺសម្រាប់

source: Numeric Score
km: ពិន្ទុលេខ

source: Numeric score (0-100)
km: ពិន្ទុលេខ (0-100)

source: Letter grade (A+, A, A-, etc.)
km: ថ្នាក់អក្សរ (a +, a, a-, ល។ )

source: Grade Source
km: ប្រភពថ្នាក់

source: How this grade was entered
km: តើថ្នាក់នេះត្រូវបានបញ្ចូលយ៉ាងដូចម្តេច

source: Grade Status
km: ស្ថានភាពថ្នាក់

source: Current status of this grade
km: ស្ថានភាពបច្ចុប្បន្ននៃថ្នាក់នេះ

source: Entered By
km: បានបញ្ចូលដោយ

source: User who entered this grade
km: អ្នកប្រើដែលបានបញ្ចូលថ្នាក់នេះ

source: Entered At
km: បានបញ្ចូលនៅ

source: When this grade was entered
km: នៅពេលដែលថ្នាក់នេះត្រូវបានបញ្ចូល

source: User who approved this grade
km: អ្នកប្រើដែលបានយល់ព្រមលើថ្នាក់នេះ

source: When this grade was approved
km: នៅពេលដែលថ្នាក់នេះត្រូវបានអនុម័ត

source: Student Notified
km: ជូនដំណឹងនិស្សិត

source: Whether student has been notified of this grade
km: ថាតើសិស្សត្រូវបានជូនដំណឹងអំពីថ្នាក់នេះដែរឬទេ

source: Notification Date
km: កាលបរិច្ឆេទសេចក្តីជូនដំណឹង

source: When student was notified
km: នៅពេលដែលសិស្សត្រូវបានជូនដំណឹង

source: Additional notes about this grade
km: កំណត់ចំណាំបន្ថែមអំពីថ្នាក់នេះ

source: Class Part Grade
km: ថ្នាក់ផ្នែកនៃថ្នាក់

source: Class Part Grades
km: ថ្នាក់ផ្នែកនៃថ្នាក់

source: Grade must have either numeric score or letter grade.
km: ថ្នាក់ត្រូវតែមានពិន្ទុឬថ្នាក់លេខ។

source: Class part must belong to the same class as the enrollment.
km: ផ្នែកថ្នាក់ត្រូវតែជាកម្មសិទ្ធិរបស់ថ្នាក់ដូចគ្នានឹងការចុះឈ្មោះ។

source: Calculated Score
km: ពិន្ទុគណនា

source: Weighted average of class part grades
km: ទំងន់មធ្យមនៃថ្នាក់ផ្នែកថ្នាក់

source: Converted letter grade
km: ថ្នាក់រាស្ត្របានបំលែង

source: GPA points for this session grade
km: ចំនុច GPA សម្រាប់វគ្គនេះ

source: Calculated At
km: គណនានៅ

source: When this grade was calculated
km: នៅពេលដែលថ្នាក់នេះត្រូវបានគណនា

source: Details of how this grade was calculated
km: ព័ត៌មានលម្អិតអំពីរបៀបដែលថ្នាក់នេះត្រូវបានគណនា

source: Class Session Grade
km: ថ្នាក់សម័យថ្នាក់

source: Class Session Grades
km: ថ្នាក់សម័យថ្នាក់

source: Initial Entry
km: ធាតុដំបូង

source: Correction
km: កមនេ

source: Recalculation
km: ការរម្វប់រន់

source: Status Change
km: ការផ្លាស់ប្តូរស្ថានភាព

source: Bulk Update
km: ធ្វើឱ្យទាន់សម័យច្រើន

source: Migration
km: ការធេវីកាតា

source: Change Type
km: ប្រភេទផ្លាស់ប្តូរ

source: Type of change made
km: ប្រភេទនៃការផ្លាស់ប្តូរដែលបានធ្វើ

source: Changed By
km: បានផ្លាស់ប្តូរដោយ

source: Changed At
km: ផ្លាស់ប្តូរនៅ

source: Previous Numeric Score
km: ពិន្ទុជាលេខមុន

source: Previous Letter Grade
km: ថ្នាក់អក្សរមុន

source: Previous Status
km: ស្ថានភាពមុន

source: New Numeric Score
km: ពិន្ទុលេខថ្មី

source: New Letter Grade
km: ថ្នាក់អក្សរថ្មី

source: New Status
km: ស្ថានភាពថ្មី

source: Reason for this grade change
km: ហេតុផលសម្រាប់ការផ្លាស់ប្តូរថ្នាក់នេះ

source: Additional details about the change
km: ព័ត៌មានលំអិតបន្ថែមអំពីការផ្លាស់ប្តូរ

source: Grade Change History
km: ប្រវត្តិផ្លាស់ប្តូរថ្នាក់

source: Term GPA
km: GPA រយៈពេល

source: Cumulative GPA
km: GPA កើន

source: Term this GPA calculation is for
km: រយៈពេលនៃការគណនា GPA នេះគឺសម្រាប់

source: Major this GPA calculation is based on
km: មុខជំនាញគណនា GPA នេះផ្អែកលើ

source: GPA Type
km: ប្រភេទ GPA

source: Type of GPA calculation
km: ប្រភេទនៃការគណនា GPA

source: GPA Value
km: តម្លៃ GPA

source: Calculated GPA value
km: គណនាតម្លៃ GPA

source: Quality Points
km: ចំណុចគុណភាព

source: Total quality points earned
km: ពិន្ទុដែលមានគុណភាពសរុបទទួលបាន

source: Credit Hours Attempted
km: ការប៉ុនប៉ងឥណទានម៉ោង

source: Total credit hours attempted
km: ការប៉ុនប៉ងឥណទានសរុប

source: Credit Hours Earned
km: ទទួលបានម៉ោងទទួលបាន

source: Total credit hours earned (passing grades)
km: ទទួលបានពេលវេលាឥណទានសរុប (ឆ្លងកាត់ថ្នាក់)

source: Details of courses included in calculation
km: ព័ត៌មានលម្អិតនៃវគ្គសិក្សាដែលបានរាប់បញ្ចូលក្នុងការគណនា

source: GPA Record
km: កំណត់ត្រា GPA

source: GPA Records
km: កំណត់ត្រា GPA

source: Promotion Initiated
km: ការផ្សព្វផ្សាយដែលបានចាប់ផ្តើម

source: Source Term
km: ពាក្យប្រភព

source: Term from which students are being promoted
km: ពាក្យដែលសិស្សកំពុងត្រូវបានលើកកម្ពស់

source: Target Term
km: ពាក្យគោលដៅ

source: Term to which students are being promoted
km: ពាក្យដែលនិស្សិតកំពុងត្រូវបានផ្សព្វផ្សាយ

source: Language program being promoted (EHSS, GESL, etc.)
km: កម្មវិធីភាសាដែលកំពុងត្រូវបានផ្សព្វផ្សាយ (អេអេសអេសអេសអេសអេសអិល។ ល។ )

source: Promotion Status
km: ស្ថានភាពផ្សព្វផ្សាយ

source: Current status of the promotion process
km: ស្ថានភាពបច្ចុប្បន្ននៃដំណើរការផ្សព្វផ្សាយ

source: Students Promoted Count
km: ការដំឡើងនិស្សិត

source: Number of students successfully promoted
km: ចំនួននិស្សិតត្រូវបានលើកកម្ពស់ដោយជោគជ័យ

source: Classes Cloned Count
km: ថ្នាក់រាប់សេក

source: Number of classes cloned for the new term
km: ចំនួននៃថ្នាក់ក្លូនសម្រាប់ពាក្យថ្មី

source: Initiated By
km: ផ្តួចផ្តើមដោយ

source: Staff member who initiated the promotion
km: បុគ្គលិកដែលបានផ្តួចផ្តើមការផ្សព្វផ្សាយ

source: Initiated At
km: ផ្តួចផ្តើមនៅ

source: When the promotion was initiated
km: នៅពេលការផ្សព្វផ្សាយត្រូវបានផ្តួចផ្តើមឡើង

source: Completed At
km: បានបញ្ចប់នៅ

source: When the promotion was completed
km: នៅពេលការផ្សព្វផ្សាយត្រូវបានបញ្ចប់

source: Notes about this promotion process
km: កំណត់សំគាល់អំពីដំណើរការផ្សព្វផ្សាយនេះ

source: Language Program Promotion
km: ការផ្សព្វផ្សាយកម្មវិធីភាសា

source: Language Program Promotions
km: ការផ្សព្វផ្សាយកម្មវិធីភាសា

source: Promoted
km: បានលើកកម្ពស់

source: Level Skipped - Advanced Placement
km: កម្រិតរំលង - ការដាក់កម្រិតខ្ពស់

source: Failed Course - Not Promoted
km: វគ្គសិក្សាបរាជ័យ - មិនត្រូវបានផ្សព្វផ្សាយ

source: No Show
km: គ្មានការសម្តែង

source: Promotion Batch
km: បាច់ផ្សព្វផ្សាយ

source: Bulk promotion batch this student is part of
km: បាច់កម្មវិធីនេះភាគច្រើននិស្សិតនេះគឺជាផ្នែកមួយនៃ

source: Student being promoted
km: និស្សិតកំពុងត្រូវបានលើកកម្ពស់

source: From Level
km: ពីកុន

source: Language level the student is being promoted from
km: កំរិតភាសានិស្សិតកំពុងត្រូវបានផ្សព្វផ្សាយពី

source: To Level
km: ដល់កំរិត

source: Language level the student is being promoted to
km: កំរិតភាសានិស្សិតកំពុងត្រូវបានតំឡើងឋានៈ

source: Source Class
km: ថ្នាក់ប្រភព

source: Class the student was enrolled in
km: ថ្នាក់សិស្សត្រូវបានចុះឈ្មោះចូល

source: Target Class
km: ថ្នាក់គោលដៅ

source: Class the student was promoted to (if successful)
km: ថ្នាក់និស្សិតត្រូវបានតំឡើងឋានៈ (ប្រសិនបើទទួលបានជោគជ័យ)

source: Promotion Result
km: លទ្ធផលផ្សព្វផ្សាយ

source: Result of the promotion attempt
km: លទ្ធផលនៃការប៉ុនប៉ងលើកកម្ពស់

source: Final grade from the source course
km: ថ្នាក់ចុងក្រោយពីវគ្គសិក្សាប្រភព

source: Additional notes about this student's promotion
km: កំណត់សំគាល់បន្ថែមអំពីការផ្សព្វផ្សាយរបស់សិស្សនេះ

source: Language Student Promotion
km: ការផ្សព្វផ្សាយនិស្សិតភាសា

source: Language Student Promotions
km: ការផ្សព្វផ្សាយនិស្សិតភាសា

source: Has Level Skip Override
km: មានកំរិតរំលងកម្រិត

source: Whether this promotion includes level skipping with management override
km: ថាតើការផ្តល់ជូននេះរួមបញ្ចូលទាំងការរំលងកម្រិតជាមួយនឹងការគ្រប់គ្រងរបស់អ្នកគ្រប់គ្រង

source: Level Skip Reason
km: ហេតុផលរំលងហេតុផល

source: Reason for level skipping (re-test results, misevaluation, etc.)
km: ហេតុផលសម្រាប់ការរំលងកម្រិត (លទ្ធផលតេស្តឡើងវិញការបំភាន់ការបំភាន់។ ល។ )

source: Skip Approved By
km: រំលងការអនុម័តដោយ

source: Manager who approved the level skip
km: អ្នកគ្រប់គ្រងដែលបានយល់ព្រមលើកម្រិតរំលង

source: Re-test Shows Higher Level
km: ការធ្វើតេស្តឡើងវិញបង្ហាញកម្រិតខ្ពស់

source: Initial Placement Misevaluation
km: ការដាក់ការងារដំបូង

source: Transfer Credit from Other Institution
km: ផ្ទេរឥណទានពីស្ថាប័នផ្សេងទៀត

source: Demonstrated Advanced Competency
km: បង្ហាញពីសមត្ថភាពជឿនលឿន

source: Accelerated Learning Progress
km: ការបង្កើនការរីកចម្រើននៃការរៀនសូត្រ

source: Other Reason
km: មូលហេតុផ្សេងទៀត

source: Implemented
km: បានអនុវត្ត

source: Student requesting level skip
km: និស្សិតស្នើសុំកម្រិតរំលង

source: Current Level
km: កម្រិតបច្ចុប្បន្ន

source: Student's current language level
km: កំរិតភាសាបច្ចុប្បន្នរបស់និស្សិត

source: Target Level
km: កម្រិតគោលដៅ

source: Requested target language level
km: បានស្នើសុំកំរិតភាសាគោលដៅ

source: Language program (EHSS, GESL, etc.)
km: កម្មវិធីភាសា (EHSS, GESL, ។ ល។ )

source: Levels Skipped
km: កំរិតរំលង

source: Number of levels being skipped
km: ចំនួននៃកម្រិតដែលកំពុងរំលង

source: Reason Category
km: ប្រភេទមូលហេតុ

source: Category of reason for level skip
km: ប្រភេទនៃហេតុផលសម្រាប់កម្រិតរំលង

source: Detailed explanation for the level skip request
km: ការពន្យល់លំអិតសម្រាប់ការស្នើសុំរំលងកម្រិត

source: Supporting Evidence
km: ភស្តុតាងគាំទ្រ

source: Supporting evidence (test scores, instructor observations, etc.)
km: ភ័ស្តុតាងគាំទ្រ (ពិន្ទុតេស្ត, ការសង្កេតរបស់គ្រូ។ ល។ )

source: Current status of the skip request
km: ស្ថានភាពបច្ចុប្បន្ននៃការស្នើសុំរំលង

source: Staff member who submitted the request
km: បុគ្គលិកដែលបានដាក់ពាក្យស្នើសុំ

source: Reviewed By
km: ពិនិត្យដោយ

source: Manager who reviewed the request
km: អ្នកគ្រប់គ្រងដែលពិនិត្យមើលសំណើរ

source: Reviewed At
km: ពិនិត្យនៅ

source: When the request was reviewed
km: នៅពេលដែលសំណើត្រូវបានពិនិត្យឡើងវិញ

source: Review Notes
km: ពិនិត្យកំណត់ចំណាំពិនិត្យឡើងវិញ

source: Notes from the reviewer
km: កំណត់ចំណាំពីអ្នកត្រួតពិនិត្យ

source: Implemented By
km: អនុវត្តដោយ

source: Staff member who implemented the skip
km: បុគ្គលិកដែលបានអនុវត្តរំលង

source: Implemented At
km: អនុវត្តនៅ

source: When the skip was implemented
km: នៅពេលដែលការរំលងត្រូវបានអនុវត្ត

source: New Enrollment
km: ការបន៍ញង់ថ្មី

source: Enrollment created as result of level skip
km: ការចុះឈ្មោះដែលបានបង្កើតឡើងជាលទ្ធផលនៃការរំលងកម្រិត

source: Language Level Skip Request
km: កំរិតភាសារំលងសំណើរ

source: Language Level Skip Requests
km: កំរិតភាសារំលងសំណើ

source: Application Information
km: ព័ត៌មានអំពីពាក្យសុំ

source: Personal Information
km: ព័ត៌មានផ្ទាល់ខ្លួន

source: Contact Information
km: ព័ត៌មានទំនាក់ទំនង

source: Educational Background
km: សាវតាអប់រំ

source: Program Preferences
km: ចំណូលចិត្តកម្មវិធី

source: Conversion Information
km: ព័ត៌មានអំពីការបំលែង

source: Duplicate Detection
km: ការរកឃើញស្ទួន

source: Duplicate Status
km: ស្ថានភាពស្ទួន

source: Mark selected applications as registered
km: សម្គាល់ពាក្យសុំដែលបានជ្រើសរើសតាមការចុះឈ្មោះ

source: Export selected applications
km: ការនាំចេញពាក្យសុំដែលបានជ្រើសរើស

source: Finance Integration
km: សមាហរណកម្មហិរញ្ញវត្ថុ

source: Test Number
km: លេខតេស្ត

source: Match Information
km: ព័ត៌មានផ្គូផ្គង

source: Matched Data
km: ទិន្នន័យដែលត្រូវគ្នា

source: Financial Concerns
km: បញ្ហាហិរញ្ញវត្ថុ

source: Review Status
km: ស្ថានភាពពិនិត្យឡើងវិញ

source: Potential Student
km: និស្សិតសក្តានុពលនិស្សិត

source: Risk Level
km: កម្រិតហានិភ័យ

source: Session Information
km: ព័ត៌មានសម័យ

source: Capacity Management
km: ការគ្រប់សមត្ថភាពការគ្រប់គ្រងសមត្ថភាព

source: Capacity (Used/Max)
km: សមត្ថភាព (ប្រើ / អតិបរមា)

source: Test Configuration
km: ការកំណត់រចនាសម្ព័ន្ធសាកល្បង

source: Scoring
km: ការដាក់ពិន្ទុ

source: Instructions
km: សេចក្តីណែនាំ

source: Test Information
km: ព័ត៌មានសាកល្បង

source: Results
km: លទ្ធផល

source: Administration Notes
km: កំណត់ចំណាំរដ្ឋបាល

source: Score
km: បិន្ទុ

source: PUCSR Student Information System
km: ប្រព័ន្ធព័ត៌មាននិស្សិត PUCSR

source: PUCSR Siem Reap Admin
km: រដ្ឋបាលខេត្តបាត់ដំបងសៀមរាប

source: Level Testing Management
km: ការគ្រប់គ្រងតេស្តកម្រិត

source: First Name (English)
km: នាមខ្លួន (អង់គ្លេស)

source: Your first/given name in English
km: ឈ្មោះដំបូង / ដែលបានផ្ដល់ជាភាសាអង់គ្លេស

source: Last Name (English)
km: នាមត្រកូល (អង់គ្លេស)

source: Your family/last name in English
km: គ្រួសារ / នាមត្រកូលរបស់អ្នកជាភាសាអង់គ្លេស

source: First Name (Khmer)
km: នាមខ្លួន (ខ្មែរ)

source: Your first/given name in Khmer script (optional)
km: ឈ្មោះដំបូង / ដែលបានផ្ដល់ជាអក្សរខ្មែររបស់អ្នក (ស្រេចចិត្ត)

source: Last Name (Khmer)
km: នាមត្រកូល (ខ្មែរ)

source: Your family/last name in Khmer script (optional)
km: គ្រួសារ / នាមត្រកូលរបស់អ្នកក្នុងអក្សរខ្មែរ (ជាជម្រើស)

source: Gender
km: យេនឌ័រ

source: Your gender identity preference
km: ចំណូលចិត្តរបស់យេនឌ័ររបស់អ្នក

source: Date of Birth
km: ថ្ងៃខែឆ្នាំកំណើត

source: Your birth date (MM/DD/YYYY)
km: ថ្ងៃខែឆ្នាំកំណើតរបស់អ្នក (ម / ឌី / អៃយី)

source: Birth Province
km: ខេត្តកំណើត

source: Province where you were born
km: ខេត្តដែលអ្នកកើត

source: Phone Number
km: លេខទូរស័ព្ទ

source: Your primary phone number
km: លេខទូរស័ព្ទចម្បងរបស់អ្នក

source: Telegram Number
km: លេខទូរស័ព្ទ

source: Telegram contact if different from phone (optional)
km: ទំនាក់ទំនងតេឡេក្រាមប្រសិនបើខុសគ្នាពីទូរស័ព្ទ (ជាជម្រើស)

source: Email Address
km: អាសយដ្ឋានអ៊ីមែល

source: Your email address for communications (optional)
km: អាសយដ្ឋានអ៊ីមែលរបស់អ្នកសម្រាប់ការទំនាក់ទំនង (ស្រេចចិត្ត)

source: You must be at least 12 years old to apply.
km: អ្នកត្រូវតែមានអាយុយ៉ាងតិច 12 ឆ្នាំដើម្បីដាក់ពាក្យ។

source: Please verify your birth date. Age appears unusually high.
km: សូមផ្ទៀងផ្ទាត់កាលបរិច្ឆេទកំណើតរបស់អ្នក។ អាយុហាក់ដូចជាខ្ពស់ខុសពីធម្មតា។

source: Phone number must contain at least 8 digits.
km: លេខទូរស័ព្ទត្រូវតែមានយ៉ាងហោចណាស់ 8 ខ្ទង់។

source: Phone number is too long.
km: លេខទូរស័ព្ទវែងពេក។

source: Current School
km: សាលាបច្ចុប្បន្ន

source: School where you are currently studying
km: សាលារៀនដែលអ្នកកំពុងសិក្សា

source: Other School Name
km: ឈ្មោះសាលាផ្សេងទៀត

source: Name of your school if not listed above
km: ឈ្មោះសាលារបស់អ្នកប្រសិនបើមិនបានចុះបញ្ជីខាងលើ

source: Enter school name if you selected 'Other'
km: បញ្ចូលឈ្មោះសាលាប្រសិនបើអ្នកបានជ្រើសរើស 'ផ្សេងទៀត'

source: Current Grade
km: ថ្នាក់បច្ចុប្បន្ន

source: Your current grade level (if in high school)
km: កម្រិតថ្នាក់បច្ចុប្បន្នរបស់អ្នក (ប្រសិនបើនៅវិទ្យាល័យ)

source: High School Graduate
km: បញ្ចប់ការសិក្សានៅវិទ្យាល័យ

source: Check if you have already graduated from high school
km: ពិនិត្យមើលថាតើអ្នកបានបញ្ចប់ការសិក្សាពីវិទ្យាល័យរួចហើយ

source: Previous English School
km: សាលាភាសាអង់គ្លេសពីមុន

source: Last place where you studied English (optional)
km: កន្លែងចុងក្រោយដែលអ្នកសិក្សាភាសាអង់គ្លេស (ស្រេចចិត្ត)

source: Previous English Level
km: កម្រិតភាសាអង់គ្លេសពីមុន

source: Highest English level you completed (optional)
km: កំរិតភាសាអង់គ្លេសខ្ពស់បំផុតដែលអ្នកបានបញ្ចប់ (ស្រេចចិត្ត)

source: e.g., Beginner, Elementary, Intermediate
km: ឧ។ អ្នកចាប់ផ្តើមដំបូង, បឋម, កម្រិតមធ្យម

source: Previous Textbook
km: សៀវភៅសិក្សាមុន

source: English textbook you used most recently (optional)
km: សៀវភៅសិក្សាភាសាអង់គ្លេសដែលអ្នកបានប្រើថ្មីៗនេះ (ស្រេចចិត្ត)

source: e.g., Ventures, American English File
km: ឧ។ ការបណ្តាក់ទុនឯកសារអង់គ្លេសអាមេរិក

source: Last English Study Date
km: កាលបរិច្ឆេទសិក្សាអង់គ្លេសចុងក្រោយ

source: When did you last study English formally? (optional)
km: តើអ្នកកំពុងសិក្សាភាសាអង់គ្លេសជាផ្លូវការនៅពេលណា? (ជាជម្រើស)

source: Please enter your school name when 'Other' is selected.
km: សូមបញ្ចូលឈ្មោះសាលារបស់អ្នកនៅពេល 'ផ្សេងទៀត' ត្រូវបានជ្រើសរើស។

source: Please select your current grade if you haven't graduated.
km: សូមជ្រើសរើសថ្នាក់បច្ចុប្បន្នរបស់អ្នកប្រសិនបើអ្នកមិនបានបញ្ចប់ការសិក្សា។

source: Preferred Program
km: កម្មវិធីដែលពេញចិត្ត

source: Which English program interests you most?
km: តើកម្មវិធីភាសាអង់គ្លេសមួយណាដែលអ្នកចាប់អារម្មណ៍បំផុត?

source: Preferred Schedule
km: កាលវិភាគដែលពេញចិត្ត

source: When would you prefer to study?
km: តើនៅពេលណាដែលអ្នកចង់សិក្សា?

source: When would you like to start?
km: តើអ្នកចង់ចាប់ផ្តើមនៅពេលណា?

source: Preferred starting term or month (optional)
km: ពាក្យចាប់ផ្តើមឬខែដែលពេញចិត្ត (ស្រេចចិត្ត)

source: e.g., Next month, January 2025
km: ឧ។ ខែកុក្រនេះនៅខែកុម្ភៈឆ្នាំ 2025 ខែមករាឆ្នាំ 2012

source: First time at PUC
km: លើកដំបូងនៅ PUC

source: Is this your first time applying to study at PUC?
km: នេះជាលើកទីមួយរបស់អ្នកដែលដាក់ពាក្យសុំសិក្សានៅឯ PUC មែនទេ?

source: How did you hear about us?
km: តើអ្នកបានដឹងអំពីយើងយ៉ាងដូចម្តេច?

source: How did you learn about our school? (optional)
km: តើអ្នកបានរៀននៅសាលារបស់យើងយ៉ាងដូចម្តេច? (ជាជម្រើស)

source: e.g., Friend, Facebook, Website, Walk-by
km: ឧ។ មិត្តហ្វេសប៊ុកគេហទំព័រ, ដើរ - ដោយ

source: Additional Comments
km: យោបល់បន្ថែម

source: Any questions or special requests? (optional)
km: សំណួរឬសំណើពិសេសណាមួយ? (ជាជម្រើស)

source: Tell us anything else we should know...
km: ប្រាប់យើងអ្វីផ្សេងទៀតដែលយើងគួរតែដឹង ...

source: I confirm that all information provided is accurate
km: ខ្ញុំសូមបញ្ជាក់ថារាល់ព័ត៌មានដែលបានផ្តល់គឺត្រឹមត្រូវ

source: Please review your information carefully before submitting
km: សូមពិនិត្យឡើងវិញនូវព័ត៌មានរបស់អ្នកដោយប្រុងប្រយ័ត្នមុនពេលដាក់ស្នើ

source: I agree to take the placement test
km: ខ្ញុំយល់ព្រមយកតេស្តកន្លែង

source: The placement test helps us determine your appropriate level
km: ការធ្វើតេស្ត៍ការដាក់ជំនួយជួយឱ្យយើងកំណត់កំរិតសមរម្យរបស់អ្នក

source: I understand there is a $5 test fee
km: ខ្ញុំយល់ថាមានថ្លៃសាកល្បង 5 ដុល្លារ

source: The test fee must be paid before taking the placement test
km: ថ្លៃឈ្នួលតេស្តត្រូវតែបង់មុនពេលទទួលយកការធ្វើតេស្តការដាក់

source: How will you pay the $5 test fee?
km: តើអ្នកនឹងបង់ថ្លៃតេស្ត 5 ដុល្លារយ៉ាងដូចម្តេច?

source: Transaction ID or reference number (if applicable)
km: លេខសម្គាល់ប្រតិបត្តិការឬលេខយោង (បើមាន)

source: Enter reference number for bank transfer/mobile payment
km: បញ្ចូលលេខយោងសម្រាប់ការផ្ទេរប្រាក់តាមធនាគារ / ការទូទាត់តាមទូរស័ព្ទ

source: Review Decision
km: សេចក្តីសម្រេចពិនិត្យឡើងវិញ

source: Confirm New Student - Allow to Proceed
km: បញ្ជាក់និស្សិតថ្មី - អនុញ្ញាតឱ្យបន្ត

source: Confirm Duplicate - Block Application
km: បញ្ជាក់ថាស្ទួន - ពាក្យសុំប្លុក

source: Needs More Information - Manual Review
km: ត្រូវការព័ត៌មានបន្ថែម - ការពិនិត្យឡើងវិញដោយដៃ

source: Please document your decision and any relevant details
km: សូមចងក្រងឯកសារអំពីការសម្រេចចិត្តរបស់អ្នកនិងព័ត៌មានលម្អិតពាក់ព័ន្ធ

source: Transaction ID or reference
km: លេខសម្គាល់ប្រតិបត្តិការឬសេចក្តីយោង

source: Payment Received At
km: ការទូទាត់បានទទួលនៅ

source: When was the payment received? (leave blank for now)
km: តើការទូទាត់បានទទួលនៅពេលណា? (ទុកឱ្យទទេឥឡូវ)

source: Application Started
km: ការដាក់ពាក្យសុំបានចាប់ផ្តើម

source: Registration Complete
km: ការចុះឈ្មោះបានបញ្ចប់

source: Pending Duplicate Review
km: ការត្រួតពិនិត្យស្ទួនដែលមិនទាន់បានរង់ចាំ

source: Test Fee Paid
km: ថ្លៃសេវាសាកល្បង

source: Test Session Scheduled
km: សម័យកាលសាកល្បងបានកំណត់ពេល

source: Test Completed
km: បានបញ្ចប់

source: Test Results Available
km: លទ្ធផលតេស្តមាន

source: Results Communicated
km: លទ្ធផលទាក់ទង

source: Converted to Student
km: បានបំលែងទៅជាសិស្ស

source: Application Declined
km: ពាក្យសុំបានធ្លាក់ចុះ

source: Application Cancelled
km: បានលុបចោលពាក្យសុំ

source: General English (GESL)
km: ភាសាអង់គ្លេសទូទៅ (GESL)

source: Academic English (IEAP)
km: ភាសាអង់គ្លេសសិក្សា (អាយអាយអេ)

source: Business English
km: ភាសាអង់គ្លេសអាជីវកម្ម

source: English for High School (EHSS)
km: អង់គ្លេសសម្រាប់វិទ្យាល័យ (EHSS)

source: Weekend Express Saturday
km: ចុងសប្តាហ៍ប្រេសប្រេសថ្ងៃសៅរ៍

source: Weekend Express Sunday
km: ចុងសប្តាហ៍អ៊ិចប្រេសថ្ងៃអាទិត្យ

source: Bachelor's Degree Program
km: កម្មវិធីសញ្ញាប័ត្របរិញ្ញាបត្រ

source: Master's Degree Program
km: កម្មវិធីសញ្ញាប័ត្រអនុបណ្ឌិត
