Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: Previous major declaration that this one supersedes
km: សេចក្តីប្រកាសសំខាន់ៗពីមុនដែលអ្នកជំនួសនេះ

source: Change Reason
km: ផ្លាស់ប្តូរហេតុផល

source: Reason for major change (required for major changes)
km: ហេតុផលសម្រាប់ការផ្លាស់ប្តូរដ៏សំខាន់ (ទាមទារសម្រាប់ការផ្លាស់ប្តូរសំខាន់ៗ)

source: Supporting Documents
km: ឯកសារគាំទ្រ

source: Reference to paperwork or documents supporting this declaration
km: ឯកសារយោងទៅនឹងឯកសារឬឯកសារគាំទ្រសេចក្តីប្រកាសនេះ

source: Whether this declaration requires administrative approval
km: ថាតើការប្រកាសនេះតម្រូវឱ្យមានការយល់ព្រមពីរដ្ឋបាលឬអត់

source: Staff member who approved the declaration (if required)
km: បុគ្គលិកដែលបានអនុម័តសេចក្តីប្រកាសនេះ (បើចាំបាច់)

source: When the declaration was approved
km: នៅពេលការប្រកាសត្រូវបានអនុម័ត

source: Additional notes about this major declaration
km: កំណត់សំគាល់បន្ថែមអំពីសេចក្តីប្រកាសដ៏សំខាន់នេះ

source: Major Declaration
km: សេចក្តីប្រកាសសំខាន់ៗ

source: Major Declarations
km: សេចក្តីប្រកាសសំខាន់ៗ

source: Effective date cannot be before declaration date.
km: កាលបរិច្ឆេទដែលមានប្រសិទ្ធភាពមិនអាចមានមុនកាលបរិច្ឆេទប្រកាសទេ។

source: Approval date should not be set if approval is not required.
km: កាលបរិច្ឆេទនៃការអនុម័តមិនគួរកំណត់ទេប្រសិនបើការយល់ព្រមមិនចាំបាច់។

source: Approved by is required when approval date is set.
km: អនុម័តដោយត្រូវបានទាមទារនៅពេលកាលបរិច្ឆេទអនុម័តត្រូវបានកំណត់។

source: Change reason is required when changing majors.
km: មូលហេតុផ្លាស់ប្តូរគឺចាំបាច់នៅពេលផ្លាស់ប្តូរមុខជំនាញ។

source: Linear Progression
km: វឌ្ឍនភាពលីនេអ៊ែរ

source: Interrupted/Returning
km: រំខាន / ត្រឡប់

source: Complex/Multiple Changes
km: ការផ្លាស់ប្តូរស្មុគស្មាញ / ច្រើន

source: Incomplete/Dropped
km: មិនពេញលេញ / ទម្លាក់

source: Journey Type
km: ប្រភេទនៃការធ្វើដំណើរ

source: Structured summary of program transitions
km: ការសង្ខេបរចនាសម្ព័ន្ធនៃការផ្លាស់ប្តូរកម្មវិធី

source: Risk Score
km: ពិន្ទុហានិភ័យ

source: Dropout risk score (0-1)
km: ពិន្ទុហានិភ័យនៃការបោះបង់ចោលការសិក្សា (0-1)

source: Student Program Journey
km: ដំណើរកម្មវិធីនិស្សិត

source: Student Program Journeys
km: ការធ្វើដំណើររបស់និស្សិត

source: Pricing
km: តម្លៃ

source: Enrollment Range (for tiered pricing)
km: ជួរចុះឈ្មោះចូល (សម្រាប់តម្លៃដែលមានប្រសិទ្ធិភាព)

source: Special Payments (senior projects)
km: ការទូទាត់ពិសេស (គម្រោងជាន់ខ្ពស់)

source: Effective Period
km: រយៈពេលមានប្រសិទ្ធិភាព

source: Student Range
km: ជួរនិស្សិត

source: Course and Tier
km: វគ្គសិក្សានិងថ្នាក់

source: Pricing Information
km: ព័ត៌មានតម្លៃ

source: Additional Information
km: ព័ត៌មានបន្ថែម

source: Adjustments
km: ការកេតរមយយយន្ដា

source: Term and Course
km: រយៈពេលនិងវគ្គសិក្សា

source: Adjustment Details
km: ព័ត៌មានលម្អិតកែសំរួល

source: Pricing Tier
km: តម្លៃសក្ការៈ

source: Fee Information
km: ព័ត៌មានថ្លៃសេវា

source: Pricing Details
km: ព័ត៌មានលម្អិតអំពីតម្លៃ

source: Frequency
km: ផាបញឹកញាប់

source: Invoice Information
km: ព័ត៌មានវិក័យប័ត្រ

source: Amounts
km: ចំនួន

source: Amount Due
km: ចំនួនទឹកប្រាក់ដែលបានកំណត់

source: Due Status
km: ស្ថានភាពរបាយការណ៍

source: Send selected invoices
km: ផ្ញើវិក័យប័ត្រដែលបានជ្រើសរើស

source: Mark as overdue
km: សម្គាល់ហួសកាលកំណត់

source: Calculate totals
km: គណនាចំនួនសរុប

source: Payment Information
km: ព័ត៌មានអំពីការបង់ប្រាក់

source: Payer Information
km: ព័ត៌មានអ្នកបង់ប្រាក់

source: Processing
km: ការអនុលោម

source: Invoice
km: វិក័យប័រត

source: Amount
km: ចមនយន

source: Transaction Information
km: ព័ត៌មានអំពីប្រតិបត្តិការ

source: Amount and Date
km: ចំនួននិងកាលបរិច្ឆេទ

source: Related Records
km: កំណត់ត្រាពាក់ព័ន្ធ

source: Payment
km: ប្យេរវតសរ៍

source: Configuration
km: ការរបតេស

source: Metadata
km: បុនអតីកបរ

source: Mapping Information
km: ព័ត៌មានផែនទី

source: Effective Dates
km: កាលបរិច្ឆេទមានប្រសិទ្ធិភាព

source: Entry Information
km: ព័ត៌មានចូល

source: Status and Workflow
km: ស្ថានភាពនិងលំហូរការងារ

source: Totals and Balance
km: សរុបនិងតុល្យភាព

source: Total Debits
km: ឥណពន្ធសរុប

source: Total Credits
km: សេវាឥណទានសរុប

source: Balanced
km: មានតុល្យភាព

source: Approve selected journal entries
km: អនុម័តធាតុទិនានុប្បវត្តិដែលបានជ្រើសរើស

source: Post selected entries to G/L
km: ប្រកាសធាតុដែលបានជ្រើសរើសទៅ g / l

source: Recalculate totals
km: គណនាឡើងវិញនូវចំនួនសរុប

source: Batch Information
km: ព័ត៌មានបាច់

source: Status and Processing
km: ស្ថានភាពនិងដំណើរការ

source: Totals
km: សរុប

source: Total Amount
km: ចំនួនសរុប

source: US Dollar
km: ដុល្លារអាមេរិក

source: Default Price (regular courses)
km: តម្លៃលំនាំដើម (វគ្គសិក្សាទៀងទាត់)

source: Reading Class (tiered by enrollment)
km: ការអានថ្នាក់ (ថ្នាក់ដោយការចុះឈ្មោះ)

source: Senior Project (tiered by enrollment)
km: គំរោងជាន់ខ្ពស់ (មានច្រើនជាងការចុះឈ្មោះ)

source: Special Price (fixed for specific courses)
km: តម្លៃពិសេស (ថេរសម្រាប់វគ្គសិក្សាជាក់លាក់)

source: Bachelor's Program
km: កម្មវិធីបរិញ្ញាបត្រ

source: Master's Program
km: កម្មវិធីរបស់ម៉ាស្ទ័រ

source: Tier Name
km: ឈ្មោះថ្នាក់

source: e.g., 'Reading class (1-2 students)', 'COMEX-488 Special', 'Default Course'
km: ឧ។ ថ្នាក់អាន '(សិស្ស 1-2 នាក់)' comex-488 ពិសេស ',' វគ្គសិក្សាលំនាំដើម '

source: Pricing Type
km: ប្រភេទតម្លៃ

source: Type of pricing: DEFAULT, READING_CLASS, SENIOR_PROJECT, or SPECIAL
km: ប្រភេទនៃតម្លៃ: លំនាំដើម, អាន - រចនាសម្ព័ន្ធ, overn_project, ឬពិសេស

source: Academic Cycle
km: វដ្តសិក្សា

source: Academic program cycle this pricing applies to (BA, MA, Language)
km: វដ្តកម្មវិធីនៃការសិក្សានេះត្រូវបានអនុវត្ត (BA, MA, ភាសា)

source: Minimum Students
km: និស្សិតអប្បបរមា

source: Minimum students for this tier (tiered pricing only)
km: និស្សិតអប្បបរមាសម្រាប់ថ្នាក់នេះតែប៉ុណ្ណោះ

source: Maximum Students
km: និស្សិតអតិបរមា

source: Maximum students for this tier (tiered pricing only)
km: សិស្សអតិបរមាសម្រាប់ថ្នាក់នេះតែប៉ុណ្ណោះ

source: Local Price
km: តម្លៃក្នុងស្រុក

source: Price for Cambodian citizens (USD)
km: តម្លៃសម្រាប់ពលរដ្ឋកម្ពុជា (ដុល្លារអាមេរិក)

source: Foreign Price
km: តម្លៃបរទេស

source: Price for foreign students (USD)
km: តំលៃនិស្សិតបរទេស (ដុល្លារអាមេរិក)

source: Advisor Payment
km: ការបង់ទីប្រឹក្សាទីប្រឹក្សា

source: Payment to advisor (senior projects only)
km: ការទូទាត់ចំពោះទីប្រឹក្សា (គម្រោងជាន់ខ្ពស់ប៉ុណ្ណោះ)

source: Committee Payment
km: ការទូទាត់គណៈកម្មាធិការ

source: Payment to committee (senior projects only)
km: ការទូទាត់ដល់គណៈកម្មាធិការ (គម្រោងជាន់ខ្ពស់)

source: Date this pricing becomes effective
km: កាលបរិច្ឆេទតម្លៃនេះក្លាយជាប្រសិទ្ធភាព

source: Term when this pricing becomes effective
km: រយៈពេលដែលតម្លៃនេះមានប្រសិទ្ធភាព

source: Whether this pricing tier is currently available
km: ថាតើ Tier តម្លៃនេះបច្ចុប្បន្នមាន

source: Pricing Tiers
km: សក្តានុពលថ្នាក់

source: Student range required for tiered pricing
km: ជួរនិស្សិតដែលត្រូវការសម្រាប់ការកំណត់តម្លៃខ្ពស់

source: Maximum students must be greater than or equal to minimum
km: សិស្សអតិបរមាត្រូវតែធំជាងឬស្មើនឹងអប្បបរមា

source: Advisor payment required for senior projects
km: ទាមទារសំណងទីប្រឹក្សាត្រូវការសម្រាប់គម្រោងជាន់ខ្ពស់

source: Course this pricing applies to
km: វគ្គសិក្សាតម្លៃនេះអនុវត្តចំពោះ

source: Pricing tier this rate applies to
km: ការកំណត់តម្លៃនេះអត្រានេះអនុវត្តចំពោះ

source: Domestic Price
km: តម្លៃក្នុងស្រុក

source: Price for domestic/Cambodian students
km: តំលៃនិស្សិតក្នុងស្រុក / កម្ពុជា

source: Price for foreign/international students
km: តំលៃនិស្សិតបរទេស / អន្តរជាតិ

source: Is Default
km: គឺជាលំនាំដើម

source: Use this pricing when no specific tier is assigned to a course
km: ប្រើការកំណត់តម្លៃនេះនៅពេលដែលមិនមានថ្នាក់ជាក់លាក់មួយត្រូវបានកំណត់ទៅវគ្គសិក្សា

source: Currency
km: រុបិយវត្ថុ

source: Currency for this price
km: រូបិយប័ណ្ណសម្រាប់តម្លៃនេះ

source: Date this pricing expires (null = indefinite)
km: កាលបរិច្ឆេទកំណត់តម្លៃនេះផុតកំណត់ (NULL = គ្មានកំណត់)

source: Additional notes about this pricing
km: កំណត់សំគាល់បន្ថែមអំពីតម្លៃនេះ

source: Course Pricing
km: ការកំណត់តម្លៃវគ្គសិក្សា

source: End date must be after effective date.
km: កាលបរិច្ឆេទបញ្ចប់ត្រូវតែជាកាលបរិច្ឆេទដែលមានប្រសិទ្ធភាព។

source: Discount
km: ការបប្ចាហថ្លៃ

source: Surcharge
km: ការបង់បន្ថេម

source: Price Override
km: ការបដិសេធតម្លៃ

source: Promotional Price
km: តំលៃផ្សព្វផ្សាយ

source: Term this adjustment applies to
km: រយៈពេលលៃតម្រូវការលៃតម្រូវនេះអនុវត្តចំពោះ

source: Base course pricing to adjust
km: តម្លៃវគ្គសិក្សាមូលដ្ឋានក្នុងការកែសំរួល

source: Adjustment Type
km: ប្រភេទលៃតម្រូវ

source: Type of pricing adjustment
km: ប្រភេទនៃការលៃតម្រូវតម្លៃ

source: Adjustment Amount
km: ចំនួនទឹកប្រាក់លៃតម្រូវ

source: Amount to adjust (positive for surcharge, negative for discount)
km: ចំនួនទឹកប្រាក់ក្នុងការកែតម្រូវ (វិជ្ជមានសម្រាប់ការបង់ថ្លៃអវិជ្ជមានអវិជ្ជមានសម្រាប់ការបញ្ចុះតម្លៃ)

source: Adjustment Percentage
km: ភាគរយកែតម្រូវ

source: Percentage adjustment (alternative to fixed amount)
km: ការកែតម្រូវភាគរយ (ជំនួសចំពោះចំនួនថេរ)

source: Final Price
km: តម្លៃចុងក្រោយ

source: Final price after adjustment (calculated automatically)
km: តម្លៃចុងក្រោយបន្ទាប់ពីការកែសំរួល (គណនាដោយស្វ័យប្រវត្តិ)

source: Reason for this adjustment
km: ហេតុផលសម្រាប់ការកែតម្រូវនេះ

source: Whether this adjustment is currently active
km: ថាតើការកែតម្រូវនេះបច្ចុប្បន្នសកម្មបច្ចុប្បន្ន

source: Term Pricing Adjustment
km: ការកែតម្រូវតម្លៃរយៈពេល

source: Term Pricing Adjustments
km: ការកែតម្រូវតម្លៃរយៈពេល

source: Registration Fee
km: ថ្លៃចុះឈ្មោះ

source: Application Fee
km: ថ្លៃពាក្យសុំ

source: Late Payment Fee
km: កម្រៃសេវាទូទាត់យឺត

source: Material Fee
km: ថ្លៃសម្ភារៈ

source: Technology Fee
km: ថ្លៃបច្ចេកវិទ្យា

source: Library Fee
km: ថ្លៃបណ្ណាល័យ

source: Student Services Fee
km: កម្រៃសេវានិស្សិត

source: Graduation Fee
km: ថ្លៃឈ្នួលបញ្ចប់ការសិក្សា

source: Transcript Fee
km: ថ្លៃដើមរបស់អ្នកផ្ទេរ

source: ID Card Fee
km: ថ្លៃអត្តសញ្ញាណប័ណ្ណអត្តសញ្ញាណប័ណ្ណ

source: Parking Fee
km: ថ្លៃចតរថយន្ត

source: Other Fee
km: ថ្លៃសេវាផ្សេងទៀត

source: Fee Name
km: ឈ្មោះថ្លៃសេវា

source: Name of the fee
km: ឈ្មោះថ្លៃសេវា

source: Fee Type
km: ប្រភេទថ្លៃសេវា

source: Category of this fee
km: ប្រភេទនៃថ្លៃឈ្នួលនេះ

source: Pricing tier (null = applies to all tiers)
km: Tier តម្លៃ (NULL = អនុវត្តចំពោះថ្នាក់ទាំងអស់)

source: Fee amount
km: ចំនួនទឹកប្រាក់ថ្លៃសេវា

source: Currency for this fee
km: រូបិយប័ណ្ណសម្រាប់ថ្លៃសេវានេះ

source: Is Per Course
km: គឺក្នុងមួយវគ្គសិក្សា

source: Whether this fee is charged per course
km: ថាតើថ្លៃសេវានេះត្រូវបានគិតថ្លៃក្នុងមួយវគ្គ

source: Is Per Term
km: គឺសម្រាប់រយៈពេលមួយ

source: Whether this fee is charged per term
km: ថាតើថ្លៃសេវានេះត្រូវបានគិតថ្លៃក្នុងមួយរយៈ

source: Is Mandatory
km: គឺចាំបាច់

source: Whether this fee is mandatory for all students
km: ថាតើថ្លៃសេវានេះចាំបាច់សម្រាប់និស្សិតទាំងអស់

source: Date this fee becomes effective
km: កាលបរិច្ឆេទថ្លៃនេះនឹងមានប្រសិទ្ធភាព

source: Date this fee expires (null = indefinite)
km: កាលបរិច្ឆេទថ្លៃសេវានេះផុតកំណត់ (NULL = គ្មានកំណត់)

source: Detailed description of this fee
km: ការពិពណ៌នាលំអិតនៃថ្លៃសេវានេះ

source: Fee Pricing
km: តម្លៃថ្លៃឈ្នួល

source: Fee cannot be both per-course and per-term.
km: កម្រៃមិនអាចមានទាំងក្នុងមួយវគ្គនិងមួយរយៈប៉ុណ្ណោះ។

source: Sent
km: បានផ្ញើ

source: Partially Paid
km: ដោយផ្នែកខ្លះបានបង់

source: Overdue
km: ដេលហយសកមនត់

source: Refunded
km: សងប្រាក់វិញ

source: Invoice Number
km: លេខវិក័យប័ត្រ

source: Unique invoice identifier
km: អត្តសញ្ញាណប័ណ្ណវិក័យប័ត្រតែមួយគត់

source: Student this invoice is for
km: វិក័យប័ត្រនេះគឺសម្រាប់

source: Academic term this invoice covers
km: ពាក្យអប់រំវិក័យប័ត្រនេះ

source: Issue Date
km: កាលបរិច្ឆេទចេញកាលបរិច្ឆេទ

source: Date the invoice was issued
km: កាលបរិច្ឆេទវិក័យប័ត្រត្រូវបានចេញ

source: Date payment is due
km: ការទូទាត់កាលបរិច្ឆេទដល់កំណត់

source: Current status of this invoice
km: ស្ថានភាពបច្ចុប្បន្ននៃវិក្កយបត្រនេះ

source: Subtotal before taxes and adjustments
km: សរុបរងមុនពន្ធនិងការកែតម្រូវ

source: Tax Amount
km: ចំនួនទឹកប្រាក់ពន្ធ

source: Total tax amount
km: ចំនួនទឹកប្រាក់ពន្ធសរុប

source: Total amount due
km: ចំនួនសរុបដែលបានកំណត់

source: Paid Amount
km: ចំនួនទឹកប្រាក់ដែលបានបង់

source: Amount already paid
km: ចំនួនទឹកប្រាក់ដែលបានបង់រួចហើយ

source: Currency for this invoice
km: រូបិយប័ណ្ណសម្រាប់វិក្កយបត្រនេះ

source: Version
km: កមបុរក្នា

source: Version field for optimistic locking
km: វាលកំណែសម្រាប់ការចាក់សោសុទិដ្ឋិនិយម

source: Additional notes about this invoice
km: កំណត់ចំណាំបន្ថែមអំពីវិក្កយបត្រនេះ

source: Sent Date
km: កាលបរិច្ឆេទផ្ញើ

source: Date and time the invoice was sent to student
km: កាលបរិច្ឆេទនិងពេលវេលាវិក័យប័ត្រត្រូវបានផ្ញើទៅនិស្សិត

source: Invoices
km: វិក័យប័ត្រ

source: Due date must be after issue date.
km: កាលបរិច្ឆេទកំណត់ត្រូវតែមានបន្ទាប់ពីចេញផ្សាយកាលបរិច្ឆេទ។

source: Course Tuition
km: វគ្គសិក្សាវគ្គសិក្សាវគ្គសិក្សា

source: Fee
km: ថ្លៃឈ្នួល

source: Adjustment
km: ការកេតរមុវ

source: Refund
km: ការសងរបាក់វិញ

source: Invoice this line item belongs to
km: វិក័យប័ត្រធាតុបន្ទាត់នេះជារបស់

source: Line Item Type
km: ប្រភេទធាតុបន្ទាត់

source: Type of charge
km: ប្រភេទនៃការចោទប្រកាន់

source: Description of this charge
km: ការពិពណ៌នាអំពីការចោទប្រកាន់នេះ

source: Class enrollment this line item is for (if applicable)
km: ការចុះឈ្មោះចូលរៀនថ្នាក់នេះគឺសម្រាប់ (បើមាន)

source: Fee pricing this line item is based on (if applicable)
km: ថ្លៃសេវាថ្លៃសេវារបស់ខ្សែនេះគឺផ្អែកលើ (បើមាន)

source: Unit Price
km: តម្លៃឯកតា

source: Price per unit
km: តម្លៃក្នុងមួយឯកតា

source: Quantity
km: បរិមាន

source: Quantity or units
km: បរិមាណឬឯកតា

source: Line Total
km: សរុបបន្ទាត់

source: Total for this line item
km: សរុបសម្រាប់ធាតុបន្ទាត់នេះ

source: Invoice Line Item
km: ធាតុបន្ទាត់វិក្កយបត្រ

source: Invoice Line Items
km: ធាតុបន្ទាត់វិក្កយបត្រ

source: Cash
km: ការបើករបាក់

source: Bank Transfer
km: ការផ្ទេរប្រាក់តាមធនាគារ

source: Credit Card
km: កាតឥណទាន

source: Debit Card
km: ប័ណ្ណឥណពន្ធ

source: Check
km: ការបិនិត្យ

source: Money Order
km: ឯកសារចមនាយ

source: Online Payment
km: ការទូទាត់តាមអ៊ីនធឺណិត

source: Mobile Payment
km: ការទូទាត់តាមទូរស័ព្ទចល័ត

source: Pending
km: ដេលមិនតាន់សរមច

source: Payment Reference
km: ឯកសារយោងទូទាត់

source: Unique payment reference number
km: លេខយោងការទូទាត់ពិសេស

source: Invoice this payment is for
km: វិក័យប័ត្រការទូទាត់នេះគឺសម្រាប់

source: Payment Amount
km: ចំនួនទឹកប្រាក់ទូទាត់

source: Amount of this payment
km: ចំនួនទឹកប្រាក់នៃការទូទាត់នេះ

source: Currency of this payment
km: រូបិយប័ណ្ណនៃការទូទាត់នេះ

source: Payment Method
km: វិធីសាស្ត្រទូទាត់

source: Method used for payment
km: វិធីសាស្រ្តប្រើសម្រាប់ការទូទាត់

source: Payment Date
km: កាលបរិច្ឆេទទូទាត់ប្រាក់

source: Date payment was made
km: ការទូទាត់កាលបរិច្ឆេទត្រូវបានធ្វើឡើង

source: Processed Date
km: កាលបរិច្ឆេទដំណើរការ

source: Date and time payment was processed
km: ការទូទាត់កាលបរិច្ឆេទនិងពេលវេលាត្រូវបានដំណើរការ

source: Current status of this payment
km: ស្ថានភាពបច្ចុប្បន្ននៃការទូទាត់នេះ

source: Payer Name
km: ឈ្មោះអ្នកបង់ប្រាក់

source: Name of the person who made the payment
km: ឈ្មោះអ្នកដែលបានធ្វើការទូទាត់ប្រាក់

source: External Reference
km: ឯកសារយោងខាងក្រៅ

source: External payment reference (bank ref, transaction ID, etc.)
km: សេចក្តីយោងបង់ប្រាក់ក្រៅផ្លូវការ (ធនាគារ) លេខសម្គាល់ប្រតិបត្តិការ។ ល។ )

source: Additional notes about this payment
km: កំណត់ចំណាំបន្ថែមអំពីការទូទាត់នេះ

source: User who processed this payment
km: អ្នកប្រើដែលបានដំណើរការការទូទាត់នេះ

source: Idempotency Key
km: លេខកូដ idemputy

source: Unique key to prevent duplicate payments
km: គន្លឹះប្លែកដើម្បីការពារការទូទាត់ស្ទួន

source: Payments
km: ការទូទាត់

source: Invoice Created
km: បង្កើតវិក្កយបត្រ

source: Invoice Sent
km: វិក័យប័ត្របានផ្ញើ

source: Invoice Modified
km: វិក័យប័ត្របានកែប្រែ

source: Invoice Cancelled
km: បានលុបចោលវិក័យប័ត្រ

source: Payment Received
km: ការទូទាត់បានទទួល

source: Payment Refunded
km: ការទូទាត់សងប្រាក់វិញ

source: Adjustment Applied
km: ការកែសំរួលបានអនុវត្ត

source: Discount Applied
km: ការបញ្ចុះតម្លៃបានអនុវត្ត

source: Fee Waived
km: ការលើកលែងថ្លៃឈ្នួល

source: Price Changed
km: តម្លៃបានផ្លាស់ប្តូរ

source: Transaction ID
km: លេខសម្គាល់ប្រតិបត្តិការ

source: Unique transaction identifier
km: អ្នកកំណត់អត្តសញ្ញាណប្រតិបត្តិការតែមួយគត់

source: Transaction Type
km: ប្រភេទប្រតិបត្តិការ

source: Type of financial transaction
km: ប្រភេទនៃប្រតិបត្តិការហិរញ្ញវត្ថុ

source: Student involved in this transaction
km: និស្សិតចូលរួមក្នុងប្រតិបត្តិការនេះ

source: Related invoice (if applicable)
km: វិក័យប័ត្រដែលទាក់ទង (បើមាន)

source: Related payment (if applicable)
km: ការទូទាត់ដែលទាក់ទង (បើមាន)

source: Transaction amount (positive for charges, negative for credits)
km: ចំនួនទឹកប្រាក់ប្រតិបត្តិការ (វិជ្ជមានសម្រាប់ការគិតថ្លៃអវិជ្ជមានសម្រាប់ឥណទាន)

source: Currency for this transaction
km: រូបិយប័ណ្ណសម្រាប់ប្រតិបត្តិការនេះ

source: Description of the transaction
km: ការពិពណ៌នាអំពីប្រតិបត្តិការ

source: Transaction Date
km: កាលបរិច្ឆេទប្រតិបត្តិការកាលបរិច្ឆេទ

source: Date and time of the transaction
km: កាលបរិច្ឆេទនិងពេលវេលានៃប្រតិបត្តិការ

source: Reference Data
km: ទិន្នន័យយោង

source: Additional reference data for this transaction
km: ទិន្នន័យយោងបន្ថែមសម្រាប់ប្រតិបត្តិការនេះ

source: User who processed this transaction
km: អ្នកប្រើប្រាស់ដែលបានដំណើរការប្រតិបត្តិការនេះ

source: Financial Transaction
km: ប្រតិបត្តិការហិរញ្ញវត្ថុ

source: Financial Transactions
km: ប្រតិបត្តិការហិរញ្ញវត្ថុ

source: Asset
km: រតបត

source: Liability
km: ផាបតតយលខុសរតុវ

source: Equity
km: សមធម៌

source: Revenue
km: តេស

source: Expense
km: ការចមនាយ

source: Current Asset
km: ទ្រព្យសម្បត្តិបច្ចុប្បន្ន

source: Fixed Asset
km: ទ្រព្យសម្បត្តិថេរ

source: Current Liability
km: ការទទួលខុសត្រូវបច្ចុប្បន្ន

source: Long-term Liability
km: ការទទួលខុសត្រូវយូរអង្វែង

source: Operating Revenue
km: ចំណូលប្រតិបត្តិការ

source: Non-operating Revenue
km: ចំណូលមិនប្រតិបត្តិការ

source: Operating Expense
km: ការចំណាយប្រតិបត្តិការ

source: Administrative Expense
km: ចំណាយរដ្ឋបាល

source: Account Code
km: លេខកូដគណនី

source: Unique G/L account code (e.g., '4100-LT')
km: លេខកូដគណនី G / L ប្លែក (ឧ។ '4100-LT')

source: Account Name
km: ឈ្មោះគណនី

source: Descriptive name for this account
km: ឈ្មោះពិពណ៌នាសម្រាប់គណនីនេះ

source: Account Type
km: ប្រភេទគណនី

source: Primary classification of this account
km: ចំណាត់ថ្នាក់បឋមរបស់គណនីនេះ

source: Account Category
km: ចំណាត់ថ្នាក់គណនី

source: Detailed category for reporting purposes
km: ប្រភេទលំអិតសម្រាប់គោលបំណងរាយការណ៍

source: Parent Account
km: គណនីមេ

source: Parent account for hierarchical reporting
km: គណនីឪពុកម្តាយសម្រាប់របាយការណ៍ឋានានុក្រម

source: Whether this account is currently in use
km: ថាតើគណនីនេះកំពុងប្រើបច្ចុប្បន្ន

source: Requires Department
km: តម្រូវឱ្យមានផ្នែក

source: Whether transactions to this account require department codes
km: ថាតើប្រតិបត្តិការនេះតម្រូវឱ្យមានកូដនាយក

source: Detailed description of this account's purpose
km: ការពិពណ៌នាលំអិតនៃគោលបំណងរបស់គណនីនេះ

source: G/L Account
km: គណនីក្រាម / លីត្រ

source: G/L Accounts
km: g / l គណនី

source: Account code must contain only letters, numbers, hyphens, and underscores.
km: លេខកូដគណនីត្រូវតែមានតែអក្សរលេខសហសញ្ញានិងសញ្ញាគូសបញ្ជាក់ប៉ុណ្ណោះ។

source: Account cannot be its own parent.
km: គណនីមិនអាចជាឪពុកម្តាយរបស់ខ្លួនទេ។

source: Type of fee this mapping applies to
km: ប្រភេទនៃកម្រៃសេវានេះធ្វើឱ្យទាន់សម័យ

source: Fee Code
km: កូដថ្លៃ

source: Internal fee code (e.g., 'LT_PLACEMENT')
km: លេខកូដថ្លៃសេវាផ្ទៃក្នុង (ឧ។ 'បណ្តាញ' 'LT_PLACENCENCENCENT')

source: Revenue Account
km: គណនីប្រាក់ចំណូល

source: G/L account for recording fee revenue
km: g / l គណនីសម្រាប់ចំណូលគិតថ្លៃ

source: Receivable Account
km: គណនីដែលអាចទទួលយកបាន

source: G/L account for unpaid fees (optional)
km: g / l គណនីសម្រាប់ថ្លៃឈ្នួលដែលមិនបានបង់ (ស្រេចចិត្ត)

source: Date this mapping becomes effective
km: កាលបរិច្ឆេទផែនទីនេះមានប្រសិទ្ធភាព

source: Date this mapping expires (null = indefinite)
km: កាលបរិច្ឆេទនៃការធ្វើផែនទីនេះផុតកំណត់ (NULL = គ្មានកំណត់)

source: Fee G/L Mapping
km: ការធ្វើផែនទី G / L ការធ្វើផែនទី

source: Fee G/L Mappings
km: ថ្លៃសេវាក្រាម / លីត្រ Mappings

source: Revenue account must be of type 'Revenue'.
km: គណនីចំណូលត្រូវតែជាចំណូលប្រភេទប្រាក់ចំណូល។

source: Revenue Receipt
km: បង្កាន់ដៃប្រាក់ចំណូល

source: Payment Receipt
km: បង្កាន់ដៃបង់ប្រាក់

source: Refund Issued
km: ការសងប្រាក់វិញចេញ

source: Adjustment Entry
km: ការលៃតម្រូវធាតុ

source: Transfer Entry
km: ការផ្ទេរប្រាក់

source: Reversal Entry
km: ការចូលបញ្ច្រាស

source: Closing Entry
km: ការបិទការចូល

source: Posted to G/L
km: បិទភ្ជាប់ទៅក្រាម / លីត្រ

source: Reversed
km: បញ្ច្រាសឡើងវិញ

source: Entry Number
km: លេខចូល

source: Unique journal entry number (e.g., 'JE-2025-01-001')
km: លេខចូលទស្សនាវដ្តីពិសេស (ឧ។ je-2025-01-001 ')

source: Entry Date
km: កាលបរិច្ឆេទចូល

source: Effective date of this journal entry
km: កាលបរិច្ឆេទមានប្រសិទ្ធិភាពនៃធាតុទិនានុប្បវត្តិនេះ

source: Accounting Period
km: រយៈពេលគណនេយ្យ

source: Accounting period (YYYY-MM format)
km: រយៈពេលគណនេយ្យ (ទ្រង់ទ្រាយ YYYY-MM)

source: Entry Type
km: ប្រភេទចូល

source: Type of journal entry
km: ប្រភេទនៃការចូលទិនានុប្បវត្តិ

source: Current status of this entry
km: ស្ថានភាពបច្ចុប្បន្ននៃធាតុនេះ

source: Brief description of this journal entry
km: ការពិពណ៌នាសង្ខេបនៃធាតុទិនានុប្បវត្តិនេះ

source: Reference Number
km: លេខយោង

source: External reference number if applicable
km: លេខយោងខាងក្រៅប្រសិនបើមាន

source: Sum of all debit amounts
km: ផលបូកនៃចំនួនឥណពន្ធទាំងអស់

source: Sum of all credit amounts
km: ផលបូកនៃចំនួនឥណទានទាំងអស់

source: Prepared By
km: រៀបចំដោយ

source: User who prepared this entry
km: អ្នកប្រើដែលបានរៀបចំធាតុនេះ

source: User who approved this entry
km: អ្នកប្រើដែលបានយល់ព្រមលើធាតុនេះ

source: When this entry was approved
km: នៅពេលដែលធាតុនេះត្រូវបានអនុម័ត

source: Posted Date
km: កាលបរិច្ឆេទចុះផ្សាយ

source: When this entry was posted to G/L
km: នៅពេលដែលធាតុនេះត្រូវបានបង្ហោះទៅក្រាម / លីត្រ

source: Reverses Entry
km: ការចូលបញ្ច្រាស

source: Original entry being reversed
km: ធាតុដើមត្រូវបានបញ្ច្រាស

source: Source System
km: ប្រព័ន្ធប្រភព

source: System that generated this entry
km: ប្រព័ន្ធដែលបង្កើតធាតុនេះ

source: Batch ID
km: លេខសម្គាល់បាច់

source: Batch identifier for grouped processing
km: កំណត់អត្តសញ្ញាណបាច់សម្រាប់ដំណើរការជាក្រុម

source: Additional notes or comments
km: កំណត់សំគាល់បន្ថែមឬយោបល់បន្ថែម

source: Journal Entry
km: ការចូលទិនានុប្បវត្តិ

source: Journal Entries
km: ធាតុទិនានុប្បវត្តិ

source: Accounting period must be in YYYY-MM format.
km: រយៈពេលគណនេយ្យត្រូវតែមានជាទម្រង់ YYYY-MM ។

source: Entry date must be within the specified accounting period.
km: កាលបរិច្ឆេទចូលត្រូវតែស្ថិតក្នុងចន្លោះគណនេយ្យដែលបានបញ្ជាក់។

source: Cannot approve unbalanced journal entry.
km: មិនអាចអនុម័តលើធាតុទិនានុប្បវត្តិដែលមិនមានតុល្យភាពទេ។

source: Only approved entries can be posted to G/L.
km: មានតែធាតុដែលបានអនុម័តប៉ុណ្ណោះដែលអាចត្រូវបានបញ្ចូលទៅ g / l ។

source: Parent journal entry
km: ការចូលទស្សនាវដ្តីមេ

source: Line Number
km: លេខបន្ទាត់

source: Sequential line number within the entry
km: បន្ទាត់បន្ទាត់បន្តបន្ទាប់ក្នុងធាតុ

source: General ledger account
km: គណនី Ledger គណនី

source: Debit Amount
km: ចំនួនទឹកប្រាក់ឥណពន្ធ

source: Debit amount (increases assets/expenses)
km: ចំនួនទឹកប្រាក់ឥណពន្ធ (បង្កើនទ្រព្យសម្បត្តិ / ការចំណាយ)

source: Credit Amount
km: ចំនួនទឹកប្រាក់ឥណទាន

source: Credit amount (increases liabilities/revenue)
km: ចំនួនទឹកប្រាក់ឥណទាន (បង្កើនបំណុល / ប្រាក់ចំណូល)

source: Line Description
km: ការពិពណ៌នាបន្ទាត់

source: Description of this line item
km: ការពិពណ៌នាអំពីធាតុបន្ទាត់នេះ

source: Reference Type
km: ប្រភេទឯកសារយោង

source: Type of reference (e.g., 'INVOICE', 'PAYMENT')
km: ប្រភេទឯកសារយោង (ឧ។ វិក័យប័ត្រ '' ការទូទាត់ ')

source: Reference ID
km: លេខសម្គាល់យោង

source: ID of referenced object
km: លេខសម្គាល់នៃវត្ថុដែលបានយោង

source: Department code for cost allocation
km: លេខកូដនាយកដ្ឋានសម្រាប់ការបែងចែកថ្លៃដើម

source: Project Code
km: លេខកូដគម្រោង

source: Project code for tracking
km: លេខកូដគម្រោងសម្រាប់តាមដាន

source: Journal Entry Line
km: បន្ទាត់ចូលទិនានុប្បវត្តិ

source: Journal Entry Lines
km: បន្ទាត់ចូលទិនានុប្បវត្តិ
