Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: Morning (7:00 AM - 11:00 AM)
km: ពេលព្រឹក (ម៉ោង 7 ៈ 00 ព្រឹក - ម៉ោង 11 ៈ 00 ព្រឹក)

source: Afternoon (1:00 PM - 5:00 PM)
km: រសៀល (1:00 ល្ងាច - 5 ៈ 00 ល្ងាច)

source: Evening (5:30 PM - 9:30 PM)
km: ល្ងាច (5 ៈ 30 ល្ងាច - 9:30 ល្ងាច)

source: Weekend (Saturday/Sunday)
km: ចុងសប្តាហ៍ (ថ្ងៃសៅរ៍ / ថ្ងៃអាទិត្យ)

source: Flexible Schedule
km: កាលវិភាគដែលអាចបត់បែនបាន

source: Northbridge International School
km: សាលាអន្តរជាតិណតប្រ៊ីតដ៍

source: International School of Phnom Penh
km: សាលាអន្តរជាតិភ្នំពេញ

source: Westline School
km: សាលារៀនវ៉េស្ទឡាញន៍

source: Beltei International University
km: សាកលវិទ្យាល័យប៊ែលធីអន្តរជាតិ

source: Norton University
km: សាកលវិទ្យាល័យន័រតុន

source: Royal University of Phnom Penh
km: សាកលវិទ្យាល័យភូមិន្ទភ្នំពេញ

source: Zaman University
km: សាកលវិទ្យាល័យហ្សាម៉ាន់

source: Public School
km: សាលារដ្ឋ

source: Private School
km: សាលាឯកជន

source: International School
km: សាលាអន្តរជាតិ

source: Other School
km: សាលាផ្សេងទៀត

source: Mobile Payment (Wing/ABA)
km: ការទូទាត់តាមទូរស័ព្ទចល័ត (វីង / អេប៊ីអេ)

source: Awaiting Review
km: រង់ចាំការពិនិត្យឡើងវិញ

source: Confirmed New Student
km: បញ្ជាក់និស្សិតថ្មី

source: Confirmed Duplicate
km: ស្ទួនដែលបានបញ្ជាក់

source: Outstanding Debt Concern
km: ការព្រួយបារម្ភបំណុលលេចធ្លោ

source: Requires Manual Review
km: តម្រូវឱ្យមានការពិនិត្យដោយដៃ

source: Application ID
km: លេខសម្គាល់ពាក្យសុំ

source: Unique identifier for this application
km: អ្នកកំណត់អត្តសញ្ញាណពិសេសសម្រាប់កម្មវិធីនេះ

source: Generated test number (T0012345 format)
km: លេខតេស្តដែលបានបង្កើត (T0012345 ទ្រង់ទ្រាយ)

source: Family Name (English)
km: ឈ្មោះគ្រួសារ (អង់គ្លេស)

source: Last name in English
km: នាមត្រកូលជាភាសាអង់គ្លេស

source: Personal Name (English)
km: ឈ្មោះផ្ទាល់ខ្លួន (អង់គ្លេស)

source: First/given name in English
km: ឈ្មោះដំបូង / ដែលបានផ្ដល់ជាភាសាអង់គ្លេស

source: Family Name (Khmer)
km: ឈ្មោះគ្រួសារ (ខ្មែរ)

source: Last name in Khmer script
km: នាមត្រកូលក្នុងអក្សរខ្មែរ

source: Personal Name (Khmer)
km: ឈ្មោះផ្ទាល់ខ្លួន (ខ្មែរ)

source: First/given name in Khmer script
km: ឈ្មោះដំបូង / ដែលបានផ្ដល់ជាអក្សរខ្មែរ

source: Preferred Gender
km: ភេទដែលពេញចិត្ត

source: Gender identity preference
km: ចំណូលចិត្តរបស់យេនឌ័រ

source: Birth date for age verification and duplicate checking
km: ថ្ងៃខែឆ្នាំកំណើតសម្រាប់ការផ្ទៀងផ្ទាត់អាយុនិងការត្រួតពិនិត្យស្ទួនគ្នា

source: Province of birth for duplicate detection
km: ខេត្តកំណើតសម្រាប់ការរកឃើញស្ទួនគ្នា

source: Primary contact phone number
km: លេខទូរស័ព្ទចម្រៀងបឋម

source: Telegram contact if different from phone
km: Telegram ទំនាក់ទំនងប្រសិនបើខុសគ្នាពីទូរស័ព្ទ

source: Personal email address for communications
km: អាសយដ្ឋានអ៊ីមែលផ្ទាល់ខ្លួនសម្រាប់ទំនាក់ទំនង

source: Current educational institution
km: ស្ថាប័នអប់រំបច្ចុប្បន្ន

source: School name if 'Other' is selected
km: ឈ្មោះសាលាប្រសិនបើ "ផ្សេងទៀត" ត្រូវបានជ្រើសរើស

source: Current grade level (6-12) if in high school
km: កម្រិតថ្នាក់បច្ចុប្បន្ន (6-12) ប្រសិនបើនៅវិទ្យាល័យ

source: Check if already graduated from high school
km: ពិនិត្យមើលថាតើបានបញ្ចប់ការសិក្សានៅវិទ្យាល័យរួចហើយ

source: Last English School
km: សាលាភាសាអង់គ្លេសចុងក្រោយ

source: Previous English language institution
km: ស្ថាប័នដែលមានភាសាអង់គ្លេសបែបអង់គ្លេស

source: Last English Level
km: កំរិតអង់គ្លេសចុងក្រោយ

source: Previous English level achieved
km: កំរិតអង់គ្លេសមុនសម្រេចបាន

source: Last Textbook Used
km: សៀវភៅសិក្សាចុងក្រោយបានប្រើ

source: Most recent English textbook series
km: ស៊េរីសៀវភៅសិក្សាភាសាអង់គ្លេសថ្មីៗបំផុត

source: When you last studied English formally
km: នៅពេលដែលអ្នកបានសិក្សាភាសាអង់គ្លេសជាផ្លូវការ

source: Desired English program
km: កម្មវិធីភាសាអង់គ្លេសដែលចង់បាន

source: Preferred Time Slot
km: រន្ធដោតពេលវេលាដែលចូលចិត្ត

source: Preferred study schedule
km: កាលវិភាគសិក្សាដែលពេញចិត្ត

source: Preferred Start Term
km: ពាក្យចាប់ផ្តើមដែលពេញចិត្ត

source: When you would like to begin studies
km: នៅពេលដែលអ្នកចង់ចាប់ផ្តើមការសិក្សា

source: Application Status
km: ស្ថានភាពពាក្យសុំ

source: Current stage in the application process
km: ដំណាក់កាលបច្ចុប្បន្ននៅក្នុងដំណើរការដាក់ពាក្យសុំ

source: Status History
km: ប្រវត្តិសាស្រ្ត

source: Historical tracking of status changes
km: ការតាមដានប្រវត្តិសាស្រ្តនៃការផ្លាស់ប្តូរស្ថានភាព

source: First Time at PUC
km: លើកដំបូងនៅ PUC

source: Is this your first time applying to PUC?
km: នេះជាលើកទីមួយរបស់អ្នកដែលដាក់ពាក្យសុំទៅ PUC?

source: How Did You Hear About Us
km: តើអ្នកបានដឹងអំពីយើងយ៉ាងដូចម្តេច

source: Marketing research: how you learned about our school
km: ការស្រាវជ្រាវទីផ្សារ: របៀបដែលអ្នកបានរៀនអំពីសាលារបស់យើង

source: Any additional information or special requests
km: ព័ត៌មានបន្ថែមឬសំណើពិសេស

source: Converted Person ID
km: លេខសម្គាល់បុគ្គលិកដែលបានបម្លែង

source: Person record ID if converted to student
km: លេខសម្គាល់កំណត់ត្រាមនុស្សប្រសិនបើបានប្តូរទៅសិស្ស

source: Official student number if enrolled
km: លេខនិស្សិតផ្លូវការប្រសិនបើចុះឈ្មោះ

source: Duplicate Check Performed
km: ការត្រួតពិនិត្យស្ទួនបានអនុវត្ត

source: Whether duplicate detection has been completed
km: ថាតើការរកឃើញស្ទួនត្រូវបានបញ្ចប់ដែរឬទេ

source: Duplicate Check Status
km: ស្ទួនស្ថានភាពត្រួតពិនិត្យស្ទួន

source: Result of duplicate detection process
km: លទ្ធផលនៃដំណើរការរាវរកជំទាវស្ទួន

source: Duplicate Check Notes
km: កំណត់ចំណាំពិនិត្យស្ទួន

source: Notes from staff review of potential duplicates
km: កំណត់ចំណាំពីការពិនិត្យបុគ្គលិកផ្នែកស្ទីលស្ទួនដែលមានសក្តានុពល

source: Duplicate Check Cleared By
km: ការត្រួតពិនិត្យស្ទួនសម្អាតដោយ

source: Staff member who cleared duplicate concerns
km: បុគ្គលិកដែលបានសម្អាតការព្រួយបារម្ភស្ទួន

source: Duplicate Check Cleared At
km: ការត្រួតពិនិត្យស្ទួនសម្អាតនៅ

source: When duplicate concerns were resolved
km: នៅពេលកង្វល់ស្ទួនត្រូវបានដោះស្រាយ

source: Potential Students
km: និស្សិតសក្តានុពល

source: School name is required when 'Other' is selected.
km: ឈ្មោះសាលារៀនគឺចាំបាច់នៅពេលដែល "ផ្សេងទៀត" ត្រូវបានជ្រើសរើស។

source: Applicant must be at least 12 years old.
km: អ្នកដាក់ពាក្យត្រូវតែមានអាយុយ៉ាងតិច 12 ឆ្នាំ។

source: Please verify birth date. Age appears unusually high.
km: សូមផ្ទៀងផ្ទាត់កាលបរិច្ឆេទកំណើត។ អាយុហាក់ដូចជាខ្ពស់ខុសពីធម្មតា។

source: Current grade is required for non-graduates.
km: ថ្នាក់បច្ចុប្បន្នត្រូវបានទាមទារសម្រាប់និស្សិតដែលមិនបានបញ្ចប់ការសិក្សា។

source: Session Date & Time
km: សម័យកាលបរិច្ឆេទនិងពេលវេលា

source: When the test session will be conducted
km: នៅពេលដែលការធ្វើតេស្តនឹងត្រូវបានធ្វើឡើង

source: Test Location
km: ទីតាំងសាកល្បង

source: Where the test will be administered
km: កន្លែងដែលការធ្វើតេស្តនឹងត្រូវគ្រប់គ្រង

source: Maximum Capacity
km: សមត្ថភាពអតិបរមា

source: Maximum number of test takers for this session
km: ចំនួនអ្នកធ្វើតេស្តិ៍អតិបរមាសម្រាប់វគ្គនេះ

source: Test Administrator
km: អ្នកគ្រប់គ្រងសាកល្បង

source: Staff member responsible for this test session
km: បុគ្គលិកទទួលខុសត្រូវចំពោះវគ្គសាកល្បងនេះ

source: Whether this session is available for booking
km: ថាតើសម័យនេះអាចរកបានសម្រាប់ការកក់

source: Session Notes
km: កំណត់សំគាល់សម័យ

source: Special instructions or notes for this session
km: សេចក្តីណែនាំពិសេសឬកំណត់ចំណាំសម្រាប់សម័យនេះ

source: Test Session
km: វគ្គសាកល្បង

source: Test Sessions
km: វគ្គសាកល្បង

source: Test session must be scheduled for the future.
km: សម័យប្រជុំតេស្តត្រូវតែកំណត់ពេលសម្រាប់អនាគត។

source: Test Name
km: ឈ្មោះសាកល្បង

source: Descriptive name for this placement test
km: ឈ្មោះពិពណ៌នាសម្រាប់ការធ្វើតេស្តកន្លែងនេះ

source: Target Program
km: កម្មវិធីគោលដៅ

source: Program this test is designed for
km: កម្មវិធីតេស្តនេះត្រូវបានរចនាឡើងសម្រាប់

source: Test Type
km: ប្រភេទសាកល្បង

source: Online Test
km: ការធ្វើតេស្តតាមអ៊ីនធឺណិត

source: Paper Test
km: តេស្តក្រដាស

source: Oral Interview
km: បទសម្ភាសន៍តាមមាត់

source: Combined Format
km: ទ្រង់ទ្រាយរួមបញ្ចូលគ្នា

source: Format of the test administration
km: ទ្រង់ទ្រាយនៃរដ្ឋបាលតេស្ត

source: Maximum Score
km: ពិន្ទុអតិបរមា

source: Highest possible score on this test
km: ពិន្ទុខ្ពស់បំផុតនៅលើការធ្វើតេស្តនេះ

source: Minimum Passing Score
km: ពិន្ទុឆ្លងកាត់អប្បបរមា

source: Minimum score required to place into program
km: ពិន្ទុអប្បបរមាដែលត្រូវការដើម្បីដាក់ចូលក្នុងកម្មវិធី

source: Test Duration (Minutes)
km: ថិរវេលាតេស្ត៍ (នាទី)

source: Time allowed to complete the test
km: ពេលវេលាត្រូវបានអនុញ្ញាតឱ្យបញ្ចប់ការធ្វើតេស្ត

source: Test Instructions
km: សេចក្តីណែនាំសាកល្បង

source: Instructions given to test takers
km: សេចក្តីណែនាំដែលបានផ្តល់ឱ្យដើម្បីសាកល្បងអ្នកធ្វើតេស្ត

source: Whether this test is currently in use
km: ថាតើតេស្តនេះកំពុងប្រើ

source: Placement Test
km: ការធ្វើតេស្តការដាក់

source: Placement Tests
km: ការធ្វើតេស្តការដាក់

source: Passing score cannot exceed maximum score.
km: ពិន្ទុដែលឆ្លងកាត់មិនអាចលើសពីពិន្ទុអតិបរមាទេ។

source: Scheduled Time
km: ពេលវេលាដែលបានគ្រោងទុក

source: When the test was scheduled
km: នៅពេលដែលការធ្វើតេស្តត្រូវបានកំណត់ពេល

source: Test Started
km: ការធ្វើតេស្តចាប់ផ្តើម

source: When the student began the test
km: នៅពេលសិស្សចាប់ផ្តើមតេស្ត

source: When the student finished the test
km: នៅពេលសិស្សបញ្ចប់ការធ្វើតេស្ត

source: Raw Score
km: ពិន្ទុឆៅ

source: Actual score achieved on the test
km: ពិន្ទុជាក់ស្តែងទទួលបាននៅលើការធ្វើតេស្ត

source: Percentage Score
km: ពិន្ទុភាគរយ

source: Score as percentage of maximum possible
km: ពិន្ទុជាភាគរយនៃអតិបរមាដែលអាចធ្វើទៅបាន

source: Recommended Level
km: កំរិតដែលបានណែនាំ

source: Suggested program level based on score
km: កម្រិតកម្មវិធីដែលបានស្នើដោយផ្អែកលើពិន្ទុ

source: Proctor Notes
km: កំណត់ចំណាំរបស់ Proctor

source: Observations during test administration
km: ការសង្ក្រតអំឡុងការគ្រប់គ្រងតេស្ត

source: Technical Issues
km: បញ្ហាបច្ចេកទេស

source: Any technical problems encountered
km: បញ្ហាបច្ចេកទេសណាមួយបានជួបប្រទះ

source: Whether the test was finished
km: ថាតើការធ្វើតេស្តនេះត្រូវបានបញ្ចប់ដែរឬទេ

source: Results Recorded
km: លទ្ធផលដែលបានកត់ត្រាទុក

source: Whether scores have been entered
km: ថាពិន្ទុត្រូវបានបញ្ចូល

source: Test Attempt
km: ការប៉ុនប៉ងសាកល្បង

source: Test Attempts
km: ការប៉ុនប៉ងសាកល្បង

source: Score cannot exceed maximum of {self.placement_test.max_score}
km: ពិន្ទុមិនអាចលើសពីអតិបរមា {MESE.placement_test.max_Score}

source: Completion time must be after start time.
km: ពេលវេលាបញ្ចប់ត្រូវតែមានបន្ទាប់ពីពេលវេលាចាប់ផ្តើម។

source: Test Fee Amount
km: ចំនួនទឹកប្រាក់នៃថ្លៃសេវាសាកល្បង

source: Amount charged for the placement test
km: ចំនួនទឹកប្រាក់ដែលត្រូវបានគិតថ្លៃសម្រាប់ការធ្វើតេស្តការដាក់

source: How the fee was paid
km: តើថ្លៃសេវាត្រូវបានបង់យ៉ាងដូចម្តេច

source: Transaction ID or reference number
km: លេខសម្គាល់ប្រតិបត្តិការឬលេខយោង

source: When the payment was received
km: នៅពេលដែលការទូទាត់ត្រូវបានទទួល

source: Received By
km: បានទទួលដោយ

source: Staff member who processed the payment
km: បុគ្គលិកដែលបានធ្វើការទូទាត់ប្រាក់

source: Whether payment has been received
km: ថាតើការទូទាត់ត្រូវបានទទួលដែរឬទេ

source: Finance Transaction ID
km: លេខសម្គាល់ប្រតិបត្តិការហិរញ្ញវត្ថុ

source: Link to finance app transaction record
km: ភ្ជាប់ទៅនឹងកំណត់ត្រាប្រតិបត្តិការប្រតិបត្តិការកម្មវិធីហិរញ្ញវត្ថុ

source: Test Payment
km: ការទូទាត់សាកល្បង

source: Test Payments
km: ការទូទាត់សាកល្បង

source: Existing Person ID
km: លេខសម្គាល់បុគ្គលដែលមានស្រាប់

source: ID of potentially matching person in people app
km: អត្តសញ្ញាណប័ណ្ណដែលមានសក្តានុពលដែលត្រូវគ្នានៅក្នុងកម្មវិធីរបស់មនុស្ស

source: Match Type
km: ប្រភេទផ្គូផ្គង

source: Exact Name Match
km: ឈ្មោះពិតប្រាកដត្រូវគ្នា

source: Similar Name
km: ឈ្មោះស្រដៀងគ្នា

source: Phone Number Match
km: ការផ្គូផ្គងលេខទូរស័ព្ទ

source: Email Match
km: ការផ្គូផ្គងអ៊ីម៉ែល

source: Date of Birth Match
km: ថ្ងៃខែឆ្នាំកំណើត

source: Multiple Criteria
km: លក្ខណៈវិនិច្ឆ័យច្រើន

source: Type of potential match detected
km: ប្រភេទនៃការប្រកួតសក្តានុពលដែលបានរកឃើញ

source: Confidence Score
km: ពិន្ទុនៃការជឿជាក់

source: Algorithm confidence (0.0 - 1.0)
km: ទំនុកចិត្តរបស់ក្បួនដោះស្រាយ (0.0 - 1.0)

source: Matched Name
km: ឈ្មោះដែលត្រូវគ្នា

source: Name from existing person record
km: ឈ្មោះពីកំណត់ត្រាបុគ្គលដែលមានស្រាប់

source: Matched Birth Date
km: ថ្ងៃខែឆ្នាំកំណើតដែលត្រូវគ្នា

source: Birth date from existing person record
km: ថ្ងៃខែឆ្នាំកំណើតពីកំណត់ត្រាបុគ្គលដែលមានស្រាប់

source: Matched Phone
km: ទូរស័ព្ទដែលត្រូវគ្នា

source: Phone number from existing person record
km: លេខទូរស័ព្ទពីកំណត់ត្រាបុគ្គលដែលមានស្រាប់

source: Has Outstanding Debt
km: មានបំណុលលេចធ្លោ

source: Whether existing person has unpaid balances
km: ថាតើមនុស្សដែលមានស្រាប់មានសមតុល្យដែលមិនបានប្រាក់

source: Outstanding Debt Amount
km: ចំនួនទឹកប្រាក់បំណុលលេចធ្លោ

source: Amount of outstanding debt
km: ចំនួនបំណុលដែលនៅសល់

source: Reviewed
km: បានពិនិត្យ

source: Whether staff has reviewed this potential match
km: ថាតើបុគ្គលិកបានពិនិត្យមើលការប្រកួតសក្តានុពលនេះដែរ

source: Staff confirmed this is the same person
km: បុគ្គលិកបានបញ្ជាក់ថានេះគឺជាមនុស្សតែមួយ

source: Staff notes about duplicate review
km: កំណត់ចំណាំបុគ្គលិកអំពីការពិនិត្យស្ទួន

source: Staff member who reviewed this potential duplicate
km: បុគ្គលិកដែលបានពិនិត្យទៅលើច្បាប់និយមដែលមានសក្តានុពលនេះ

source: When the duplicate review was completed
km: នៅពេលដែលការពិនិត្យស្ទួនត្រូវបានបញ្ចប់

source: Duplicate Candidate
km: បេក្ខជនស្ទួន

source: Duplicate Candidates
km: បេក្ខជនស្ទួន

source: Level Testing Application
km: កម្មវិធីសាកល្បងកម្រិត

source: Application Complete!
km: ការដាក់ពាក្យសុំរួចរាល់!

source: Thank you for applying for level testing at PUCSR
km: សូមអរគុណចំពោះការដាក់ពាក្យសុំការធ្វើតេស្តកម្រិតនៅ PUCSR

source: Application Summary
km: សង្ខេបពាក្យសុំ

source: Applicant Name
km: ឈ្មោះអ្នកដាក់ពាក្យ

source: Application Date
km: កាលបរិច្ឆេទដាក់ពាក្យសុំ

source: Test Fee Information
km: ព័ត៌មានអំពីថ្លៃសេវា

source: Next Steps
km: ជំហានបន្ទាប់

source: Test Scheduling
km: កំណត់ពេលវេលាសាកល្បង

source: Take Test
km: សាកល្បង

source: Results & Enrollment
km: បតរបតេមការចាក់ស្ដស្ដង់

source: Visit Our Office
km: ទស្សនាការិយាល័យរបស់យើង

source: Location
km: កន្លេងតាមងនោ

source: Preah Kossomak Campus
km: សាខាព្រះកុសញ្ញា

source: University Student Services Office
km: ការិយាល័យសេវាកម្មនិស្សិតសាកលវិទ្យាល័យ

source: Phnom Penh, Cambodia
km: រាជធានីភ្នំពេញប្រទេសកម្ពុជា

source: Office Hours
km: ម៉ោងការិយាល័យ

source: Monday - Friday: 8:00 AM - 5:00 PM
km: ថ្ងៃច័ន្ទ - សុក្រ: ម៉ោង 8 ៈ 00 ព្រឹកដល់ 5 ៈ 00 ល្ងាច

source: Saturday: 8:00 AM - 12:00 PM
km: ថ្ងៃសៅរ៍: ម៉ោង 8 ៈ 00 ព្រឹកដល់ 12 ៈ 00 ល្ងាច

source: Sunday: Closed
km: ថ្ងៃអាទិត្យ: បានបិទ

source: Important Reminders
km: ការរំ remind កសំខាន់

source: Bring exact payment amount ($5.00) if possible
km: នាំមកនូវចំនួនទឹកប្រាក់ទូទាត់ពិតប្រាកដ (5.00 ដុល្លារ) ប្រសិនបើអាច

source: Ask for a payment receipt for your records
km: ស្នើសុំបង្កាន់ដៃបង់ប្រាក់សម្រាប់កំណត់ត្រារបស់អ្នក

source: Copy Test Number
km: ចម្លងលេខសាកល្បង

source: Save this page or write down your test number for payment
km: រក្សាទុកទំព័រនេះឬសរសេរលេខសាកល្បងរបស់អ្នកសម្រាប់ការទូទាត់

source: Copied!
km: បានថតចម្លង!

source: Application Under Review
km: ពាក្យសុំកំពុងត្រូវបានពិនិត្យ

source: Please wait while our staff reviews your application
km: សូមរង់ចាំខណៈពេលដែលបុគ្គលិករបស់យើងពិនិត្យមើលពាក្យសុំរបស់អ្នក

source: Why is my application under review?
km: ហេតុអ្វីបានជាពាក្យសុំរបស់ខ្ញុំកំពុងពិនិត្យមើល?

source: Potential record matches found:
km: រកឃើញការប្រកួតកំណត់ត្រាសក្តានុពល:

source: Similar information to existing student records
km: ព័ត៌មានស្រដៀងគ្នាទៅនឹងកំណត់ត្រានិស្សិតដែលមានស្រាប់

source: What to Expect
km: អ្វីដែលត្រូវរំពឹង

source: Staff Review
km: ការពិនិត្យបុគ្គលិក

source: Contact from Our Office
km: ទំនាក់ទំនងពីការិយាល័យរបស់យើង

source: Application Approval
km: ការយល់ព្រមលើពាក្យសុំ

source: Questions or Concerns?
km: សំណួរឬកង្វល់?

source: PUCSR Student Services
km: សេវាកម្មនិស្សិត PUCSR

source: Important Notes
km: កំណត់ចំណាំសំខាន់

source: Keep your test number for reference:
km: រក្សាលេខសាកល្បងរបស់អ្នកសម្រាប់ឯកសារយោង:

source: Review typically takes 1-2 business days
km: ការពិនិត្យឡើងវិញជាធម្មតាចំណាយពេល 1-2 ថ្ងៃនៃថ្ងៃធ្វើការ

source: Your test number - save this for reference
km: លេខសាកល្បងរបស់អ្នក - រក្សាទុកវាសម្រាប់ឯកសារយោង

source: Click to copy test number
km: ចុចដើម្បីចម្លងលេខសាកល្បង

source: Apply for English Placement Testing at PUCSR
km: ដាក់ពាក្យសុំធ្វើតេស្តការដាក់ភាសាអង់គ្លេសនៅ PUCSR

source: Before You Begin
km: មុនពេលអ្នកចាប់ផ្តើម

source: Test Fee
km: ថ្លៃសេវាសាកល្បង

source: payment required before testing
km: ការទូទាត់ទាមទារមុនពេលធ្វើតេស្ត

source: Application Time
km: ពេលវេលាដាក់ពាក្យសុំ

source: to complete this application
km: ដើម្បីបំពេញពាក្យសុំនេះ

source: Required Information
km: ព័ត៌មានចាំបាច់

source: Application Process
km: ដំណើរការដាក់ពាក្យសុំ

source: Complete online application
km: បំពេញពាក្យសុំតាមអ៊ីនធឺណិត

source: Pay test fee at our office
km: បង់ថ្លៃសាកល្បងនៅការិយាល័យរបស់យើង

source: Take online placement test
km: ការធ្វើតេស្តការដាក់តាមអ៊ិនធរណេត

source: Receive results and program recommendation
km: ទទួលបានលទ្ធផលនិងការណែនាំកម្មវិធី

source: Need Help?
km: ត្រូវការជំនួយទេ?

source: Start Application
km: ដាក់ពាក្យសុំចាប់ផ្តើម

source: Please correct the following errors:
km: សូមកែកំហុសដូចខាងក្រោមៈ

source: Test Applications
km: កម្មវិធីសាកល្បង

source: Manage and review level testing applications
km: គ្រប់គ្រងនិងពិនិត្យកម្មវិធីសាកល្បងកម្រិត

source: Back to Dashboard
km: ត្រលប់ទៅផ្ទាំងព័ត៌មាន

source: Filter Applications
km: ត្រងកម្មវិធី

source: Search
km: ការឆេកឆេ

source: Name, test number, or phone...
km: ឈ្មោះលេខតេស្តឬទូរស័ព្ទ ...

source: All Statuses
km: ឋានៈទាំងអស់

source: All Payments
km: រាល់ការទូទាត់

source: Unpaid
km: ដេលក្ផានបង់ថ្លៃ

source: Duplicates
km: ចម្លង

source: All Applications
km: ពាក្យសុំទាំងអស់

source: Has Duplicate Concerns
km: មានការព្រួយបារម្ភស្ទួន

source: No Duplicate Concerns
km: គ្មានការព្រួយបារម្ភស្ទួនទេ

source: Filter
km: តរមង

source: Clear
km: ផ្លឺ

source: Applicant
km: នារីស្ម័រកចិត្ដ

source: Applied
km: បានអនុវត្ត

source: Actions
km: សកម្មភាព

source: Not assigned
km: មិនត្រូវបានចាត់តាំង

source: Duplicate Concern
km: ការព្រួយបារម្ភស្ទួន

source: No payment record
km: គ្មានកំណត់ត្រាទូទាត់

source: View Details
km: មើលព័ត៌មានលម្អិត

source: Process Payment
km: ការទូទាត់ដំណើរការ

source: Review Duplicates
km: ពិនិត្យស្ទួន

source: Previous
km: ចាដមបុង

source: Next
km: បន្ទាប់បិនេហ

source: Showing
km: ការបង្ហាញ

source: to
km: តោកាន់អាយ័តនិ

source: of
km: នៃ

source: results
km: លទ្ធផល

source: No applications found
km: រកមិនឃើញកម្មវិធី

source: Try adjusting your search criteria or filters.
km: ព្យាយាមកែតម្រូវលក្ខណៈវិនិច្ឆ័យស្វែងរករបស់អ្នកឬតម្រង។

source: Applications will appear here as students submit them.
km: ពាក្យសុំនឹងបង្ហាញខ្លួននៅទីនេះនៅពេលសិស្សដាក់ស្នើពួកគេ។

source: Application Details
km: ព័ត៌មានលម្អិតអំពីការដាក់ពាក្យ

source: Test Number:
km: លេខសាកល្បង:

source: Status:
km: ស្ថានភាព:

source: Duplicate Check:
km: ពិនិត្យស្ទួន:

source: Can Proceed to Payment:
km: អាចបន្តការទូទាត់:

source: Yes
km: បាត

source: No
km: ដេលក្ផាន

source: Error loading application details.
km: កំហុសក្នុងការផ្ទុកព័ត៌មានលម្អិតអំពីកម្មវិធី។

source: Level Testing Dashboard
km: ផ្ទាំងគ្រប់គ្រងសាកល្បងកម្រិត

source: Manage test applications, payments, and duplicate reviews
km: គ្រប់គ្រងការប្រើសាកល្បងការទូទាត់និងការពិនិត្យឡើងវិញពិនិត្យ

source: Pending Applications
km: កម្មវិធីមិនទាន់សម្រេច

source: View pending
km: មើលការរង់ចាំ

source: Pending Payments
km: ការទូទាត់ដែលមិនទាន់សម្រេច

source: Process payments
km: ការទូទាត់ដំណើរការ

source: Duplicate Concerns
km: ការព្រួយបារម្ភស្ទួន

source: Review duplicates
km: ពិនិត្យស្ទួន

source: Today's Tests
km: ការធ្វើតេស្តថ្ងៃនេះ

source: View schedule
km: មើលកាលវិភាគ

source: Quick Actions
km: សកម្មភាពរហ័ស

source: View All Applications
km: មើលកម្មវិធីទាំងអស់

source: Browse and manage test applications
km: រកមើលនិងគ្រប់គ្រងកម្មវិធីសាកល្បង

source: Process Payments
km: ការទូទាត់ដំណើរការ

source: Record test fee payments
km: ការទូទាត់ថ្លៃសេវាសាកល្បង

source: Generate Reports
km: បង្កើតរបាយការណ៍

source: Create test fee reports
km: បង្កើតរបាយការណ៍ថ្លៃសេវាសាកល្បង

source: Recent Applications
km: កម្មវិធីថ្មីៗ

source: Name
km: ឈ្ផោហ

source: Test #
km: សាកល្បង #

source: No recent applications
km: មិនមានកម្មវិធីថ្មីៗទេ

source: New applications will appear here.
km: កម្មវិធីថ្មីនឹងលេចឡើងនៅទីនេះ។

source: High-Risk Duplicates
km: ស្ទួនដែលមានហានិភ័យខ្ពស់

source: Matches:
km: ការប្រកួត:

source: Confidence:
km: ទំនុកចិត្ត:

source: Has Debt
km: មានបំណុល

source: Review
km: សរសេររិហកន់

source: No high-risk duplicates
km: គ្មានស្ទួនសរសៃដែលមានហានិភ័យខ្ពស់

source: Duplicate concerns will appear here.
km: ការព្រួយបារម្ភស្ទួននឹងលេចឡើងនៅទីនេះ។

source: Duplicate Review
km: ពិនិត្យឡើងវិញស្ទួន

source: Review potential duplicate student records
km: ពិនិត្យឡើងវិញនូវកំណត់ត្រានិស្សិតស្ទួនដែលមានសក្តានុពល

source: High Priority Review Required
km: ត្រូវការការពិនិត្យអាទិភាពខ្ពស់ទាមទារ

source: New Application
km: កម្មវិធីថ្មី

source: Age
km: មានវ័យ

source: Telegram
km: តេលេរកាម

source: Potential Duplicates
km: ស្ទួនដែលមានសក្តានុពល

source: RISK
km: ការរបថុយ

source: Existing Student Name
km: ឈ្មោះនិស្សិតដែលមានស្រាប់

source: Birth Date
km: ថ្ងៃខែឆ្នាំកំណើត

source: No potential duplicates found
km: រកមិនឃើញស្ទួនដែលមានសក្តានុពល

source: This application appears to be unique.
km: កម្មវិធីនេះហាក់ដូចជាមានតែមួយគត់។

source: Please make a decision about this application
km: សូមធ្វើការសម្រេចចិត្តអំពីពាក្យសុំនេះ

source: Decision
km: ការសរេមចចិត្ដ

source: Cancel
km: លប់ចោល

source: Submit Review
km: ដាក់ស្នើការពិនិត្យឡើងវិញ

source: Are you sure you want to block this application as a confirmed duplicate? This action cannot be easily undone.
km: តើអ្នកពិតជាចង់រារាំងពាក្យសុំនេះជាស្ទួនដែលបានបញ្ជាក់ដែរឬទេ? សកម្មភាពនេះមិនអាចធ្វើវិញបានទេ។

source: Process Test Fee Payment
km: ដំណើរការទូទាត់ថ្លៃសេវាសាកល្បង

source: Record payment for level testing application
km: ការទូទាត់កំណត់ត្រាសម្រាប់កម្មវិធីតេស្តកម្រិត

source: Back to Applications
km: ត្រលប់ទៅកម្មវិធី

source: Time Slot
km: រន្ធដោតពេលវេលា

source: Notes:
km: កំណត់សំគាល់ៈ

source: Current Payment Status
km: ស្ថានភាពទូទាត់បច្ចុប្បន្ន

source: Paid On
km: បង់លើ

source: Payment Processing Instructions
km: ការណែនាំអំពីដំណើរការទូទាត់

source: Select the appropriate payment method
km: ជ្រើសរើសវិធីសាស្ត្រទូទាត់សមស្រប

source: Provide a receipt to the student
km: ផ្តល់វិក័យប័ត្រដល់សិស្ស

source: Mark as Paid
km: សម្គាល់ដូចដែលបានបង់

source: Update Payment
km: ធ្វើបច្ចុប្បន្នភាពការទូទាត់

source: Please select a payment method when marking as paid.
km: សូមជ្រើសរើសវិធីបង់ប្រាក់នៅពេលសម្គាល់ដូចដែលបានបង់។

source: Please enter a payment reference for this payment method.
km: សូមបញ្ចូលសេចក្តីយោងបង់ប្រាក់សម្រាប់វិធីសាស្ត្រទូទាត់នេះ។

source: Application Submitted
km: ការដាក់ពាក្យសុំ

source: Date
km: កាលកមនត់

source: Bring your test number to our office
km: នាំយកលេខសាកល្បងរបស់អ្នកទៅការិយាល័យរបស់យើង

source: Pay the test fee before taking the test
km: បង់ថ្លៃសាកល្បងមុនពេលធ្វើតេស្ត

source: Staff will schedule your placement test
km: បុគ្គលិកនឹងកំណត់ពេលធ្វើតេស្តការដាក់របស់អ្នក

source: PUCSR Office
km: ការិយាល័យ PUCSR

source: Mon-Fri: 8:00 AM - 5:00 PM
km: ច័ន្ទ - ហ្វ្រី: 8 ៈ 00 ព្រឹកដល់ 5 ៈ 00 រសៀល

source: Sat: 8:00 AM - 12:00 PM
km: សៅ: ម៉ោង 8 ៈ 00 ព្រឹកដល់ម៉ោង 12 ៈ 00 រសៀល

source: Please correct errors
km: សូមកែកំហុស

source: Back
km: រតលប់

source: Complete
km: ដេលរកប់រកាន់

source: Tap to copy test number
km: ប៉ះដើម្បីចម្លងលេខសាកល្បង

source: Personal Info
km: ព័ត៌មានផ្ទាល់ខ្លួន

source: Khmer
km: ខ្មែរ

source: DOB
km: ដេល

source: Phone
km: ទូរស័ព្ទ

source: Education
km: ការអប់រម

source: School
km: សាលារ្យេន

source: Last Level
km: កម្រិតចុងក្រោយ

source: Preferences
km: ចំណូលចិត្ត

source: Time
km: បេលវេលា

source: How heard
km: តើលឺយ៉ាងម៉េច?

source: Comments
km: យោបល់

source: What happens next?
km: តើមានអ្វីកើតឡើងបន្ទាប់?

source: You'll receive a test number
km: អ្នកនឹងទទួលបានលេខតេស្ត

source: Bring $5.00 fee to our office
km: យកថ្លៃសេវា 5,00 ដុល្លារទៅការិយាល័យរបស់យើង

source: Staff schedules your test
km: កាលវិភាគបុគ្គលិកការធ្វើតេស្តរបស់អ្នក
