Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: Academic
km: ឯនបន្ឌិតសផា

source: Major
km: វរសេនីយរតី

source: The major program this canonical requirement applies to
km: កម្មវិធីសំខាន់តម្រូវការរបស់ Canonication នេះអនុវត្តចំពោះ

source: Sequence Number
km: លេខលំដាប់

source: Order in degree sequence (1-43 for BA, 1-24 for MA, etc.)
km: បញ្ជាទិញក្នុងលំដាប់សញ្ញាបត្រ (1-43 សម្រាប់បា, 1-24 សម្រាប់ម៉ា។ ល។ )

source: Required Course
km: វគ្គសិក្សាដែលត្រូវការ

source: The exact course required at this sequence position
km: វគ្គសិក្សាពិតប្រាកដដែលត្រូវការនៅទីតាំងលំដាប់នេះ

source: Requirement Name
km: ឈ្មោះតម្រូវការ

source: Descriptive name for this requirement slot
km: ឈ្មោះពិពណ៌នាសម្រាប់រន្ធដោតនៃតម្រូវការនេះ

source: Description
km: ការបិបន៍នា

source: Additional context about this requirement
km: បរិបទបន្ថែមអំពីតម្រូវការនេះ

source: Effective Term
km: រយៈពេលមានប្រសិទ្ធិភាព

source: Term when this canonical requirement becomes effective
km: រយៈពេលនៅពេលដែលតម្រូវការរបស់ Canonical នេះមានប្រសិទ្ធភាព

source: End Term
km: ពាក្យបញ្ចប់

source: Term when this requirement is no longer effective (optional)
km: រយៈពេលនៅពេលដែលតម្រូវការនេះលែងមានប្រសិទ្ធិភាព (ស្រេចចិត្ត)

source: Is Active
km: គឺសកម្ម

source: Whether this canonical requirement is currently in use
km: ថាតើតម្រូវការរបស់ Canonical នេះកំពុងប្រើប្រាស់

source: Administrative Notes
km: កំណត់សំគាល់រដ្ឋបាល

source: Internal notes for curriculum committee
km: កំណត់ចំណាំផ្ទៃក្នុងសម្រាប់គណៈកម្មាធិការកម្មវិធីសិក្សា

source: Canonical Requirement
km: តម្រូវការរបស់ Canonical

source: Canonical Requirements
km: តម្រូវការរបស់ Canonical

source: End term must be after effective term.
km: ពាក្យបញ្ចប់ត្រូវតែជាពាក្យដែលមានប្រសិទ្ធិភាព។

source: Course {course_code} is already required for {major} in overlapping time period ({other_start} - {other_end}). Time periods for the same course code cannot overlap.
km: វគ្គសិក្សា {ThackS_Code} ត្រូវបានទាមទាររួចហើយសម្រាប់ {Major} ក្នុងរយៈពេលលើសម៉ោង ({{{{{ផ្សេងទៀត {ផ្សេងទៀត {ផ្សេងទៀត}) ។ រយៈពេលពេលវេលាសម្រាប់លេខដូចគ្នាមិនអាចត្រួតលើគ្នាបានទេ។

source: Transfer Credit
km: ផ្ទេរឥណទាន

source: Study Abroad
km: សិក្សានៅបរទេស

source: Course Substitution
km: ការជំនួសវគ្គសិក្សាមួយ

source: Administrative Override
km: ការបដិសេធរដ្ឋបាល

source: Exam Credit (AP, CLEP, etc.)
km: ឥណទានប្រឡង (AP, Clep ។ ល។ )

source: Portfolio Credit
km: ឥណទានផលប័ត្រ

source: Requirement Waiver
km: ការលើកលែងតម្រូវការ

source: Pending Review
km: ការពិនិត្យឡើងវិញដែលមិនទាន់សម្រេច

source: Approved
km: បានអនុម័ត

source: Rejected
km: បដិសេធ

source: Conditionally Approved
km: បានអនុម័តដោយលក្ខខណ្ឌ

source: Expired
km: ផុតសុក

source: Student
km: និសសិត

source: The canonical requirement being modified
km: តម្រូវការរបស់ Canonical ត្រូវបានកែប្រែ

source: Exception Type
km: ប្រភេទលើកលែង

source: Type of exception being requested
km: ប្រភេទលើកលែងដែលត្រូវបានស្នើសុំ

source: Fulfilling Course
km: ការបំពេញវគ្គសិក្សា

source: Internal course that fulfills this requirement
km: វគ្គសិក្សាផ្ទៃក្នុងដែលបំពេញតាមតម្រូវការនេះ

source: Fulfilling Transfer Credit
km: ការបំពេញឥណទានផ្ទេរ

source: Transfer credit that fulfills this requirement
km: ផ្ទេរឥណទានដែលបំពេញតាមតម្រូវការនេះ

source: Is Waived
km: ត្រូវបានលើកលែង

source: Whether this requirement is completely waived
km: ថាតើតម្រូវការនេះត្រូវបានលើកលែងទាំងស្រុងឬអត់

source: Reason for Exception
km: ហេតុផលសម្រាប់ករណីលើកលែង

source: Detailed justification for this exception
km: យុត្តិកម្មលម្អិតសម្រាប់ករណីលើកលែងនេះ

source: Supporting Documentation
km: ឯកសារគាំទ្រ

source: Description of supporting documentation provided
km: ការពិពណ៌នាអំពីឯកសារគាំទ្រដែលបានផ្តល់ជូន

source: Term when this exception becomes effective
km: រយៈពេលដែលករណីលើកលែងនេះមានប្រសិទ្ធភាព

source: Expiration Term
km: ពាក្យផុតកំណត់

source: Term when this exception expires (optional)
km: រយៈពេលដែលករណីលើកលែងនេះផុតកំណត់ (ស្រេចចិត្ត)

source: Approval Status
km: ស្ថានភាពអនុម័ត

source: Requested By
km: ស្នើសុំដោយ

source: Person who submitted the exception request
km: អ្នកដែលបានដាក់សំណើលើកលែង

source: Approved By
km: អនុម័តដោយ

source: Approval Date
km: កាលបរិច្ឆេទអនុម័ត

source: Rejection Reason
km: ហេតុផលនៃការបដិសេធ

source: Reason for rejection if status is rejected
km: ហេតុផលសម្រាប់ការបដិសេធប្រសិនបើស្ថានភាពត្រូវបានបដិសេធ

source: Internal notes about this exception
km: កំណត់ចំណាំផ្ទៃក្នុងអំពីករណីលើកលែងនេះ

source: Student Requirement Exception
km: ករណីលើកលែងនៃតម្រូវការរបស់និស្សិត

source: Student Requirement Exceptions
km: ការលើកលែងតម្រូវការរបស់និស្សិត

source: Must specify fulfillment method: course, transfer credit, or waiver.
km: ត្រូវតែបញ្ជាក់វិធីសាស្រ្តបំពេញការងារ: វគ្គសិក្សាផ្ទេរឥណទានឬការលើកលែង។

source: Cannot specify multiple fulfillment methods for one exception.
km: មិនអាចបញ្ជាក់វិធីសាស្រ្តបំពេញច្រើនសម្រាប់ករណីលើកលែងមួយ។

source: Rejection reason is required for rejected exceptions.
km: ហេតុផលនៃការបដិសេធគឺតម្រូវឱ្យច្រានចោលការលើកលែង។

source: Expiration term must be after effective term.
km: ពាក្យផុតកំណត់ត្រូវតែមានបន្ទាប់ពីមានប្រសិទ្ធិភាព។

source: In Progress
km: កំពុងដំណើរការ

source: Completed
km: បានបញ្ចប់

source: On Hold
km: រង់ចាំ

source: Withdrawn
km: របាក់ដេច

source: Total Requirements
km: តម្រូវការសរុប

source: Total canonical requirements for this major
km: តម្រូវការ Canonical សរុបសម្រាប់មុខជំនាញនេះ

source: Completed Requirements
km: តម្រូវការដែលបានបញ្ចប់បានបញ្ចប់

source: Number of requirements completed or satisfied by exception
km: ចំនួននៃតម្រូវការដែលបានបញ្ចប់ឬពេញចិត្តដោយការលើកលែង

source: Total Credits Required
km: ត្រូវការសេវាក្រេឌីតសរុប

source: Total credits required for degree completion
km: សេវាក្រេឌីតសរុបដែលត្រូវការសម្រាប់ការបញ្ចប់សញ្ញាបត្រ

source: Credits Completed
km: បានបញ្ចប់

source: Credits completed through courses and approved exceptions
km: ឥណទានបានបញ្ចប់តាមរយៈវគ្គសិក្សានិងការលើកលែងដែលបានអនុម័ត

source: Completion Status
km: ស្ថានភាពបញ្ចប់

source: Completion Percentage
km: ភាគរយនៃការបញ្ចប់

source: Overall degree completion percentage
km: ភាគរយបញ្ចប់នៃសញ្ញាប័ត្រទូទៅ

source: Estimated Graduation Term
km: ពាក្យបញ្ចប់ការសិក្សាប៉ាន់ស្មាន

source: Last Updated
km: ធ្វើឱ្យទាន់សម័យចុងក្រោយ

source: When progress was last recalculated
km: នៅពេលវឌ្ឍនភាពត្រូវបានគណនាចុងក្រោយ

source: Notes
km: កំណត់ចំណាំ

source: Administrative notes about student progress
km: កំណត់សំគាល់រដ្ឋបាលអំពីការរីកចម្រើនរបស់សិស្ស

source: Student Degree Progress
km: វឌ្ឍនភាពរបស់សញ្ញាប័ត្រនិស្សិត

source: Requirement Type Name
km: ឈ្មោះប្រភេទតម្រូវការ

source: Name of the requirement type (e.g., 'Core Courses', 'Electives')
km: ឈ្មោះប្រភេទតម្រូវការ (ឧ។ វគ្គសិក្សាសំខាន់ ',' ជ្រើសរើស ')

source: Requirement Code
km: ក្រមតម្រូវការ

source: Short code for the requirement type (e.g., 'CORE', 'ELEC')
km: ក្រមខ្លីសម្រាប់ប្រភេទតម្រូវការ (ឧ។ ព្រះស្នូល '' lec ')

source: Detailed description of this requirement type
km: ការពិពណ៌នាលំអិតនៃប្រភេទតម្រូវការនេះ

source: Whether this requirement type is currently in use
km: ថាតើប្រភេទតម្រូវការនេះកំពុងប្រើ

source: Display Order
km: ការដាក់បញ្ជា

source: Order for displaying requirement types in lists
km: បញ្ជាទិញសម្រាប់ការបង្ហាញប្រភេទតំរូវការក្នុងបញ្ជី

source: Requirement Type
km: ប្រភេទតម្រូវការ

source: Requirement Types
km: ប្រភេទតម្រូវការ

source: Any Level
km: កម្រិតណាមួយ

source: Lower Level (100-200)
km: កម្រិតទាប (100-200)

source: Upper Level (300-400)
km: កំរិតខ្ពស់ (300-400)

source: Graduate Level (500+)
km: កំរិតបញ្ចប់ការសិក្សា (500+)

source: The major program this requirement applies to
km: កម្មវិធីសំខាន់តម្រូវការនេះអនុវត្តចំពោះ

source: Descriptive name of the requirement
km: ឈ្មោះពិពណ៌នានៃតម្រូវការ

source: Detailed description of what students must complete
km: ការពិពណ៌នាលំអិតនៃអ្វីដែលនិស្សិតត្រូវតែបំពេញ

source: Required Credits
km: ឥណទានដែលត្រូវការ

source: Minimum credits required (if credit-based)
km: ឥណទានអប្បបរមាចាំបាច់ (ប្រសិនបើផ្អែកលើឥណទាន)

source: Required Courses Count
km: ចំនួនវគ្គសិក្សាដែលត្រូវការ

source: Minimum number of courses required (if course-count based)
km: ចំនួននៃវគ្គសិក្សាអប្បបរមាដែលត្រូវការ (ប្រសិនបើមានមូលដ្ឋានរាប់)

source: Course Level Constraint
km: ឧបសគ្គកម្រិតវគ្គសិក្សា

source: Level constraint for qualifying courses
km: ឧបសគ្គកម្រិតសម្រាប់វគ្គសិក្សាដែលមានលក្ខណៈសម្បត្តិគ្រប់គ្រាន់

source: Term when this requirement becomes effective
km: រយៈពេលដែលតម្រូវការនេះមានប្រសិទ្ធភាព

source: Whether this requirement is currently in use
km: ថាតើតម្រូវការនេះកំពុងប្រើ

source: Internal notes for academic advisors
km: កំណត់សំគាល់ផ្ទៃក្នុងសម្រាប់អ្នកប្រឹក្សាអប់រំ

source: Academic Requirement
km: តម្រូវការសិក្សា

source: Academic Requirements
km: តម្រូវការសិក្សា

source: Requirement must specify either required credits or required course count.
km: តម្រូវការត្រូវតែបញ្ជាក់ទាំងឥណទានដែលត្រូវការឬចំនួនវគ្គសិក្សាដែលត្រូវការ។

source: Requirement
km: ការរបតេសតាម

source: Course
km: មុខវិច្ជា

source: Course Role
km: តួនាទីវគ្គសិក្សា

source: Optional role description for this course in the requirement
km: ការពិពណ៌នាអំពីតួនាទីជាជម្រើសសម្រាប់វគ្គសិក្សានេះតាមតម្រូវការ

source: Credits Value
km: តម្លៃសេវាឥណទាន

source: Override credit value for this course in this requirement (optional)
km: បដិសេធតម្លៃឥណទានសម្រាប់វគ្គសិក្សានេះក្នុងតម្រូវការនេះ (ស្រេចចិត្ត)

source: Requirement Course
km: វគ្គសិក្សា

source: Requirement Courses
km: វគ្គសិក្សាតម្រូវការ

source: Original Course
km: វគ្គសិក្សាដើម

source: The original course being mapped
km: វគ្គសិក្សាដើមដែលត្រូវបានគូសផែនទី

source: Equivalent Course
km: វគ្គសិក្សាដែលមានតំលៃស្មើ

source: The course that is equivalent to the original
km: វគ្គសិក្សាដែលស្មើនឹងដើម

source: Term when this equivalency becomes effective
km: រយៈពេលដែលសមមូលនឹងមានប្រសិទ្ធិភាព

source: Term when this equivalency expires (optional)
km: រយៈពេលដែលសមមូលនេះផុតកំណត់ (ស្រេចចិត្ត)

source: Is Bidirectional
km: គឺ Badirectional

source: Whether the equivalency works in both directions
km: ថាតើសមភាពធ្វើការនៅក្នុងទិសដៅទាំងពីរ

source: Whether this equivalency is currently in use
km: ថាតើសមភាពនេះកំពុងប្រើសមមូលនេះឬអត់

source: Additional notes about this equivalency
km: កំណត់សំគាល់បន្ថែមអំពីភាពសមមូលនេះ

source: Course Equivalency
km: សមភាពវគ្គសិក្សា

source: Course Equivalencies
km: តំបន់ឧក្រិភាព

source: A course cannot be equivalent to itself.
km: វគ្គសិក្សាមិនអាចស្មើនឹងខ្លួនវាបានទេ។

source: This would create a circular course equivalency.
km: នេះនឹងបង្កើតឱ្យសមភាពវគ្គសិក្សារាងជារង្វង់។

source: Course Equivalent
km: សមមូលវគ្គសិក្សា

source: Elective Credit
km: ឥណទានជ្រើសរើស

source: General Education
km: ការអប់រំទូទៅ

source: Major Credit
km: ឥណទានធំ ៗ

source: External Institution
km: ស្ថាប័នខាងក្រៅ

source: Name of the institution where credit was earned
km: ឈ្មោះស្ថាប័នដែលទទួលបានឥណទានទទួលបាន

source: External Course Code
km: លេខកូដវគ្គសិក្សាខាងក្រៅ

source: Course code at the external institution
km: លេខកូដវគ្គសិក្សានៅស្ថាប័នខាងក្រៅ

source: External Course Title
km: ចំណងជើងវគ្គសិក្សាខាងក្រៅ

source: Course title at the external institution
km: ចំណងជើងវគ្គសិក្សានៅស្ថាប័នខាងក្រៅ

source: External Credits
km: ឥណទានខាងក្រៅ

source: Number of credits from external institution
km: ចំនួនក្រេឌីតពីស្ថាប័នខាងក្រៅ

source: External Grade
km: ថ្នាក់ខាងក្រៅ

source: Grade received at external institution
km: ថ្នាក់ទទួលបាននៅស្ថាប័នខាងក្រៅ

source: Internal Equivalent Course
km: វគ្គសមមូលផ្ទៃក្នុង

source: Internal course this transfer credit is equivalent to
km: វគ្គសិក្សាផ្ទៃក្នុងឥណទានផ្ទេរនេះគឺស្មើនឹង

source: Internal Credits
km: ឥណទានខាងក្នុង

source: Number of credits awarded internally
km: ចំនួនឥណទានដែលទទួលបានរង្វាន់នៅខាងក្នុង

source: Credit Type
km: ប្រភេទឥណទាន

source: Type of credit being awarded
km: ប្រភេទនៃឥណទានដែលទទួលបានរង្វាន់

source: Approved At
km: បានអនុម័តនៅ

source: Documentation Provided
km: ឯកសារបានផ្តល់ឯកសារ

source: Whether required documentation has been provided
km: ថាតើឯកសារចាំបាច់ត្រូវបានផ្តល់ជូន

source: Syllabus Reviewed
km: syllabus បានពិនិត្យឡើងវិញ

source: Whether course syllabus has been reviewed
km: មិនថាបទទេវីធំត្រូវបានពិនិត្យឡើងវិញ

source: Internal notes about this transfer credit
km: កំណត់ចំណាំផ្ទៃក្នុងអំពីឥណទានផ្ទេរនេះ

source: Transfer Credits
km: ផ្ទេរឥណទានផ្ទេរ

source: Approved transfer credits must have approval details.
km: ឥណទានផ្ទេរដែលបានអនុម័តត្រូវតែមានព័ត៌មានលម្អិតការយល់ព្រម។

source: Rejection reason is required for rejected credits.
km: ហេតុផលនៃការបដិសេធគឺចាំបាច់សម្រាប់ឥណទានដែលបានបដិសេធ។

source: Internal credits should not significantly exceed external credits.
km: ឥណទានផ្ទៃក្នុងមិនគួរលើសពីឥណទានខាងក្រៅទេ។

source: Course Completion
km: ការបញ្ចប់វគ្គសិក្សា

source: Exam Credit
km: ឥណទានប្រឡង

source: Fulfillment Source
km: ប្រភពបំពេញ

source: Credits Applied
km: ឥណទានបានអនុវត្ត

source: Number of credits applied toward this requirement
km: ចំនួនឥណទានដែលបានអនុវត្តចំពោះតម្រូវការនេះ

source: Courses Applied
km: វគ្គសិក្សាត្រូវបានអនុវត្ត

source: Number of courses applied toward this requirement
km: ចំនួនវគ្គសិក្សាដែលបានអនុវត្តចំពោះតម្រូវការនេះ

source: Specific course that fulfills this requirement
km: វគ្គសិក្សាជាក់លាក់ដែលបំពេញតាមតម្រូវការនេះ

source: Fulfilled by Override
km: បំពេញដោយការបដិសេធ

source: Whether this requirement was fulfilled by administrative override
km: ថាតើតម្រូវការនេះត្រូវបានបំពេញដោយការបដិសេធផ្នែករដ្ឋបាល

source: Override Reason
km: ហេតុផលបដិសេធ

source: Reason for administrative override
km: ហេតុផលសម្រាប់ការបដិសេធរដ្ឋបាល

source: Override Approved By
km: បដិសេធការយល់ព្រមដោយ

source: Is Fulfilled
km: ត្រូវបានបំពេញ

source: Whether this requirement is completely fulfilled
km: ថាតើតម្រូវការនេះត្រូវបានបំពេញយ៉ាងដូចម្តេច

source: Fulfillment Date
km: កាលបរិច្ឆេទបំពេញ

source: Date when requirement was marked as fulfilled
km: កាលបរិច្ឆេទនៅពេលដែលតម្រូវការត្រូវបានសម្គាល់ថាបានបំពេញ

source: Additional notes about this fulfillment
km: កំណត់សំគាល់បន្ថែមអំពីការបំពេញនេះ

source: Verified By
km: បានផ្ទៀងផ្ទាត់ដោយ

source: Staff member who verified this fulfillment
km: បុគ្គលិកដែលបានផ្ទៀងផ្ទាត់ការបំពេញនេះ

source: Student Requirement Fulfillment
km: ការបំពេញតាមតម្រូវការរបស់និស្សិត

source: Student Requirement Fulfillments
km: ការបំពេញតាមតម្រូវការរបស់និស្សិត

source: Override reason is required for override fulfillments.
km: ហេតុផលបដិសេធការបដិសេធចំពោះការបំពេញការប្រព្រឹត្ដប្រព្រឹត្ដ។

source: Override approval is required for override fulfillments.
km: ការយល់ព្រមពីការអនុម័តលើការបំពេញការប្រព្រឹត្ដប្រព្រឹត្ដចំពោះការប្រព្រឹត្ដ។

source: Fulfilling course is required for course-based fulfillments.
km: ការបំពេញវគ្គសិក្សាត្រូវបានទាមទារសម្រាប់ការសម្រេចរបស់វគ្គសិក្សា។

source: Transfer credit is required for transfer-based fulfillments.
km: ការផ្ទេរប្រាក់ត្រូវបានទាមទារសម្រាប់ការបំពេញតាមការផ្ទេរដែលមានមូលដ្ឋានលើការផ្ទេរប្រាក់។

source: Transfer Course Equivalent
km: ការផ្ទេរវគ្គសិក្សាស្មើនឹងការផ្ទេរប្រាក់

source: Academic Petition
km: ញត្តិសិក្សា

source: Advisor Recommendation
km: អនុសាសន៍ទីប្រឹក្សា

source: Curriculum Change
km: ការផ្លាស់ប្តូរកម្មវិធីសិក្សា

source: Schedule Conflict
km: កាលវិភាគមានកាលវិភាគ

source: Prerequisite Waiver
km: ការលះបង់ជាមុន

source: Other
km: ផេសងត្យេត

source: The course that was originally required
km: វគ្គសិក្សាដែលត្រូវបានទាមទារដំបូង

source: Substitute Course
km: ជំនួសវគ្គសិក្សា

source: The course being used as a substitute
km: វគ្គសិក្សាត្រូវបានប្រើជាអ្នកជំនួស

source: Detailed Reason
km: ហេតុផលលម្អិត

source: Detailed explanation for the override request
km: ការពន្យល់លំអិតសម្រាប់ការស្នើសុំបដិសេធ

source: Term when this override becomes effective
km: រយៈពេលដែលការបដិសេធនេះមានប្រសិទ្ធភាព

source: Term when this override expires (optional)
km: រយៈពេលនៅពេលដែលការបដិសេធនេះផុតកំណត់ (ស្រេចចិត្ត)

source: Person who submitted the override request
km: អ្នកដែលបានដាក់ស្នើសំណើបដិសេធ

source: Internal notes about this override
km: កំណត់ចំណាំផ្ទៃក្នុងអំពីការបដិសេធនេះ

source: Student Course Override
km: ទិសដៅនិស្សិតបដិសេធ

source: Student Course Overrides
km: ទិសដៅនិស្សិតបដិសេធ

source: A course cannot be substituted for itself.
km: វគ្គសិក្សាមិនអាចត្រូវបានជំនួសដោយខ្លួនឯងទេ។

source: Rejection reason is required for rejected overrides.
km: ហេតុផលនៃការបដិសេធត្រូវបានទាមទារសម្រាប់ការបដិសេធបដិសេធការបដិសេធ។

source: Academic Records
km: កំណត់ត្រាសិក្សា

source: Academic Transcript
km: ប្រតិចារិកអប់រំ

source: Grade Report
km: របាយការណ៍ថ្នាក់

source: Attendance Report
km: របាយការណ៍ចូលរួម

source: Enrollment Verification
km: ការចុះឈ្មោះចុះឈ្មោះ

source: Official Letter
km: សំបុត្រផ្លូវការ

source: Degree Verification
km: ការផ្ទៀងផ្ទាត់សញ្ញាប័ត្រ

source: Conduct Report
km: របាយការណ៍រាយការណ៍

source: Document Type Code
km: លេខកូដប្រភេទឯកសារ

source: Unique code for this document type (e.g., OFFICIAL_TRANSCRIPT)
km: លេខកូដពិសេសសម្រាប់ប្រភេទឯកសារនេះ (ឧ។ ព័ត៌មានផ្លូវការ)

source: Document Name
km: ឈ្មោះឯកសារ

source: Human-readable name for this document type
km: ឈ្មោះដែលមនុស្សអាចអានបានសម្រាប់ប្រភេទឯកសារនេះ

source: Document Category
km: ប្រភេទឯកសារ

source: Category this document type belongs to
km: ប្រភេទប្រភេទឯកសារនេះជាកម្មសិទ្ធិរបស់

source: Detailed description of what this document contains
km: ការពិពណ៌នាលំអិតនៃអ្វីដែលឯកសារនេះមាន

source: Requires Approval
km: តម្រូវឱ្យមានការយល់ព្រម

source: Whether requests for this document type require approval
km: ថាតើសំណូមពរសម្រាប់ប្រភេទឯកសារនេះទាមទារការយល់ព្រម

source: Auto Generate
km: បង្កើតដោយស្វ័យប្រវត្តិ

source: Whether this document can be automatically generated
km: ថាតើឯកសារនេះអាចត្រូវបានបង្កើតដោយស្វ័យប្រវត្តិ

source: Processing Time (Hours)
km: ពេលវេលាដំណើរការ (ម៉ោង)

source: Expected processing time in hours
km: ពេលវេលាដំណើរការដែលរំពឹងទុកក្នុងម៉ោង

source: Requires Grade Data
km: តម្រូវឱ្យមានទិន្នន័យថ្នាក់

source: Whether this document requires access to grade information
km: ថាតើឯកសារនេះតម្រូវឱ្យមានសិទ្ធិទទួលបានព័ត៌មានថ្នាក់

source: Requires Attendance Data
km: ទាមទារទិន្នន័យចូលរួម

source: Whether this document requires attendance information
km: ថាតើឯកសារនេះតម្រូវឱ្យមានព័ត៌មានចូលរួម

source: Requires Manual Input
km: តម្រូវឱ្យមានការបញ្ចូលដោយដៃ

source: Whether this document requires manual staff input/review
km: ថាតើឯកសារនេះតម្រូវឱ្យមានការបញ្ចូលបុគ្គលិកដោយដៃ / ពិនិត្យឡើងវិញ

source: Allows Email Delivery
km: អនុញ្ញាតឱ្យការដឹកជញ្ជូនអ៊ីម៉ែល

source: Whether this document can be delivered via email
km: ថាតើឯកសារនេះអាចត្រូវបានបញ្ជូនតាមរយៈអ៊ីម៉ែល

source: Allows Pickup
km: អនុញ្ញាតឱ្យភីកអាប់

source: Whether this document can be picked up in person
km: ថាតើឯកសារនេះអាចត្រូវបានជ្រើសរើសដោយផ្ទាល់

source: Allows Mail Delivery
km: អនុញ្ញាតឱ្យការបញ្ជូនសំបុត្រ

source: Whether this document can be mailed
km: ថាតើឯកសារនេះអាចត្រូវបានផ្ញើតាមឯកសារ

source: Allows Third Party Delivery
km: អនុញ្ញាតឱ្យការចែកចាយរបស់ភាគីទីបី

source: Whether this document can be sent to third parties
km: ថាតើឯកសារនេះអាចត្រូវបានផ្ញើទៅឱ្យភាគីទីបី

source: Required Permission
km: ការអនុញ្ញាតដែលត្រូវការ

source: Django permission required to request this document type
km: ការអនុញ្ញាត Django តម្រូវឱ្យស្នើសុំប្រភេទឯកសារនេះ

source: Has Fee
km: មានថ្លៃឈ្នួល

source: Whether this document type has an associated fee
km: ថាតើប្រភេទឯកសារនេះមានកម្រៃសេវាទាក់ទង

source: Fee Amount
km: ចំនួនទឹកប្រាក់ថ្លៃសេវា

source: Fee amount for this document type (if applicable)
km: ចំនួនទឹកប្រាក់ថ្លៃសេវាសម្រាប់ប្រភេទឯកសារនេះ (បើមាន)

source: Fee Currency
km: រូបិយប័ណ្ណថ្លៃសេវាកម្ម

source: Currency for the document fee
km: រូបិយប័ណ្ណសម្រាប់ថ្លៃឯកសារ

source: Free Allowance Per Term
km: ប្រាក់ឧបត្ថម្ភឥតគិតថ្លៃសម្រាប់រយៈពេល

source: Number of free documents of this type per academic term
km: ចំនួនឯកសារឥតគិតថ្លៃនៃប្រភេទនេះក្នុងមួយម៉ោងសិក្សា

source: Free Allowance Per Year
km: ប្រាក់ឧបត្ថម្ភឥតគិតថ្លៃក្នុងមួយឆ្នាំ

source: Number of free documents of this type per academic year
km: ចំនួនឯកសារឥតគិតថ្លៃនៃប្រភេទនេះក្នុងឆ្នាំសិក្សា

source: Free Allowance Lifetime
km: អាយុកាលប្រាក់ឧបត្ថម្ភឥតគិតថ្លៃ

source: Total number of free documents of this type allowed
km: ចំនួនឯកសារឥតគិតថ្លៃសរុបនៃប្រភេទនេះត្រូវបានអនុញ្ញាត

source: Whether this document type is currently available for requests
km: ថាតើប្រភេទឯកសារនេះបច្ចុប្បន្នមានសម្រាប់សំណើរ

source: Order in which this document type appears in lists
km: លំដាប់ដែលប្រភេទឯកសារនេះលេចឡើងក្នុងបញ្ជី

source: Document Type Configuration
km: ការកំណត់រចនាសម្ព័ន្ធប្រភេទឯកសារ

source: Document Type Configurations
km: ការកំណត់ប្រភេទឯកសារ

source: Cancelled
km: លប់លានផាក

source: Email
km: អ៊ីមែល

source: In-Person Pickup
km: ការរើសយកដោយផ្ទាល់

source: Postal Mail
km: សំបុត្រប្រៃសណីយ៍

source: Third Party Institution
km: ស្ថាប័នភាគីទីបី

source: Low
km: តាប

source: Normal
km: ដេលធម្ផតា

source: High
km: ខ្ពស់

source: Urgent
km: ដេលបហ្ចុហបហ្ចូល

source: Request ID
km: លេខសម្គាល់ស្នើសុំ

source: Unique identifier for this document request
km: អ្នកកំណត់អត្តសញ្ញាណពិសេសសម្រាប់ការស្នើសុំឯកសារនេះ

source: Document Type
km: ប្រភេទឯកសារ

source: Type of document being requested
km: ប្រភេទឯកសារដែលត្រូវបានស្នើសុំ

source: Student requesting the document
km: និស្សិតស្នើសុំឯកសារ

source: Request Status
km: ស្ថានភាពស្នើសុំ

source: Current status of the request
km: ស្ថានភាពបច្ចុប្បន្ននៃសំណើ

source: Priority
km: អាតិផាប

source: Priority level for processing this request
km: កម្រិតអាទិភាពសម្រាប់ដំណើរការសំណើនេះ

source: Delivery Method
km: វិធីសាស្ត្រចែកចាយ

source: How the document should be delivered
km: របៀបដែលឯកសារគួរតែត្រូវបានបញ្ជូន

source: Recipient Name
km: ឈ្មោះអ្នកទទួល

source: Name of person or institution receiving the document
km: ឈ្មោះបុគ្គលឬស្ថាប័នទទួលឯកសារ

source: Recipient Address
km: អាសយដ្ឋានអ្នកទទួល

source: Mailing address for document delivery
km: អាសយដ្ឋានអ៊ីមែលសម្រាប់ការចែកចាយឯកសារ

source: Recipient Email
km: អ៊ីមែលអ្នកទទួល

source: Email address for electronic delivery
km: អាសយដ្ឋានអ៊ីម៉ែលសម្រាប់ការចែកចាយអេឡិចត្រូនិច

source: Request Notes
km: កំណត់ចំណាំសំណើ

source: Additional notes about the document request
km: កំណត់សំគាល់បន្ថែមអំពីការស្នើសុំឯកសារ

source: Custom Data
km: ទិន្នន័យផ្ទាល់ខ្លួន

source: Document-type specific data (e.g., date ranges, special requirements)
km: ប្រភេទទិន្នន័យប្រភេទជាក់លាក់ (ឧ។ ជួរកាលបរិច្ឆេទមានតម្រូវការពិសេស)

source: Whether this request requires payment
km: ថាតើសំណើនេះតម្រូវឱ្យមានការទូទាត់

source: Fee amount for this specific request
km: ចំនួនទឹកប្រាក់ថ្លៃសេវាសម្រាប់ការស្នើសុំជាក់លាក់នេះ

source: Is Free Allowance
km: គឺជាប្រាក់ឧបត្ថម្ភឥតគិតថ្លៃ

source: Whether this request uses the student's free allowance
km: ថាតើសំណើនេះប្រើប្រាក់ឧបត្ថម្ភឥតគិតថ្លៃរបស់សិស្ស

source: Payment Required
km: ទាមទារការទូទាត់

source: Whether payment is required before processing
km: ថាតើការទូទាត់ត្រូវបានទាមទារជាមុនដែរឬទេ

source: Payment Status
km: ស្ថានភាពទូទាត់

source: Not Required
km: មិនចាំបាច់

source: Payment Pending
km: ការទូទាត់ប្រាក់រង់ចាំ

source: Paid
km: ដេលដ្ឋាន

source: Waived
km: លើកលា

source: Status of payment for this request
km: ស្ថានភាពនៃការទូទាត់សម្រាប់សំណើនេះ

source: Finance Invoice ID
km: លេខសម្គាល់វិក្កយបត្រហិរញ្ញវត្ថុ

source: ID of associated invoice in finance system
km: លេខសម្គាល់នៃវិក័យប័ត្រដែលទាក់ទងនៅក្នុងប្រព័ន្ធហិរញ្ញវត្ថុហិរញ្ញវត្ថុ

source: User who submitted the request
km: អ្នកប្រើដែលបានដាក់សំណើនេះ

source: Assigned To
km: បានចាត់តាំងឱ្យ

source: Staff member assigned to process this request
km: បុគ្គលិកបានចាត់ឱ្យធ្វើសំណើនេះ

source: Processed By
km: ដំណើរការដោយ

source: User who completed the request
km: អ្នកប្រើប្រាស់ដែលបានបំពេញសំណើ

source: Requested Date
km: កាលបរិច្ឆេទដែលបានស្នើសុំ

source: Date and time the request was submitted
km: កាលបរិច្ឆេទនិងពេលវេលាដែលសំណើត្រូវបានដាក់ស្នើ

source: Due Date
km: កាលបរិច្ឆេទដល់កំណត់

source: Expected completion date based on processing time
km: កាលបរិច្ឆេទបញ្ចប់ការរំពឹងទុកដោយផ្អែកលើពេលវេលាដំណើរការ

source: Approved Date
km: កាលបរិច្ឆេទដែលបានអនុម័ត

source: Date and time the request was approved
km: កាលបរិច្ឆេទនិងពេលវេលាដែលសំណើត្រូវបានអនុម័ត

source: Completed Date
km: កាលបរិច្ឆេទបញ្ចប់

source: Date and time the document was delivered
km: កាលបរិច្ឆេទនិងពេលវេលាឯកសារត្រូវបានបញ្ជូន

source: Document Request
km: ការស្នើសុំឯកសារ

source: Document Requests
km: ការស្នើសុំឯកសារ
