Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: Permission Request System
km: ប្រព័ន្ធស្នើសុំការអនុញ្ញាត

source: Attendance Status
km: ស្ថានភាពចូលរួម

source: Submitted Code
km: បានដាក់ស្នើលេខកូដ

source: Code entered by student
km: លេខកូដដែលបានបញ្ចូលដោយនិស្សិត

source: Code Correct
km: លេខកូដត្រឹមត្រូវ

source: Whether submitted code matched session code
km: ថាតើបានដាក់លេខកូដដែលបានដាក់ស្នើលេខកូដសម័យ

source: Submitted At
km: បានដាក់ជូននៅ

source: When student submitted attendance code
km: នៅពេលដែលនិស្សិតបានបញ្ជូនលេខកូដចូលរួម

source: Submitted Latitude
km: បានដាក់រយៈទទឹង

source: Student's latitude when submitting code
km: រយៈទទឹងរបស់សិស្សនៅពេលដាក់ស្នើលេខកូដ

source: Submitted Longitude
km: បានដាក់ស្នើរយៈបណ្តោយ

source: Student's longitude when submitting code
km: រយៈបណ្តោយរបស់សិស្សនៅពេលដាក់លេខកូដ

source: Within Geofence
km: នៅក្នុង Geofance

source: Whether student was within valid location
km: ថាតើសិស្សស្ថិតនៅក្នុងទីតាំងដែលមានសុពលភាពដែរឬទេ

source: Distance from Class (Meters)
km: ចម្ងាយពីថ្នាក់ (ម៉ែត្រ)

source: Student's distance from class location
km: ចម្ងាយរបស់សិស្សតាំងពីទីតាំងថ្នាក់

source: Data Source
km: ប្រភពទិន្នន័យ

source: Recorded By
km: បានកត់ត្រាដោយ

source: User who recorded this attendance
km: អ្នកប្រើប្រាស់ដែលបានកត់ត្រាការចូលរួមនេះ

source: Permission Reason
km: ហេតុផលការអនុញ្ញាត

source: Reason for excused absence
km: ហេតុផលសម្រាប់អវត្តមានដែលដោះសារ

source: Permission Approved
km: ការអនុញ្ញាតដែលបានអនុម័ត

source: Whether permission request was approved
km: ថាតើសំណើការអនុញ្ញាតត្រូវបានអនុម័ត

source: Permission Approved By
km: ការអនុញ្ញាតដែលបានអនុម័តដោយ

source: Permission Notes
km: កំណត់ត្រាការអនុញ្ញាត

source: Admin notes about permission request
km: កំណត់សំគាល់របស់អ្នកគ្រប់គ្រងអំពីការស្នើសុំការអនុញ្ញាត

source: Additional notes about this attendance record
km: កំណត់ចំណាំបន្ថែមអំពីកំណត់ត្រាវត្តមាននេះ

source: Attendance Record
km: កំណត់ត្រាវឌ្ឍនភាព

source: Attendance Records
km: កំណត់ត្រាវឌ្ឍនភាព

source: Pending Approval
km: ការអនុម័តដែលមិនទាន់សម្រេច

source: Denied
km: ដេលតោយយកមិន

source: Auto-Approved (High School)
km: អនុម័តដោយស្វ័យប្រវត្តិ (វិទ្យាល័យ)

source: Expired (Not Processed)
km: ផុតកំណត់ (មិនដំណើរការ)

source: IEAP (No Permissions)
km: IA AP (គ្មានការអនុញ្ញាត)

source: High School (Auto-Approve)
km: វិទ្យាល័យ (អនុម័តស្វ័យប្រវត្តិ)

source: Bachelor's (Requires Approval)
km: បរិញ្ញាបត្រ (ទាមទារការយល់ព្រម)

source: Master's (Requires Approval)
km: អនុបណ្ឌិត (ទាមទារការយល់ព្រម)

source: Other Program
km: កម្មវិធីផ្សេងទៀត

source: Date of class student wants to miss
km: កាលបរិច្ឆេទរបស់និស្សិតថ្នាក់ចង់ខកខាន

source: Reason
km: តសសនៈ

source: Student's reason for requesting excused absence
km: ហេតុផលរបស់និស្សិតសម្រាប់ការស្នើសុំអវត្តមានដែលបានដោះសា

source: Program Type
km: ប្រភេទកម្មវិធី

source: Program type determines approval workflow
km: ប្រភេទកម្មវិធីកំណត់លំហូរការងារការយល់ព្រម

source: Whether request needs manual approval
km: ថាតើសំណើរត្រូវការការយល់ព្រមដោយដៃ

source: Approval Notes
km: កំណត់សំគាល់ការយល់ព្រម

source: Admin notes about approval decision
km: កំណត់សំគាល់របស់អ្នកគ្រប់គ្រងអំពីការសម្រេចចិត្តយល់ព្រម

source: Parent Notified
km: ឪពុកម្តាយបានជូនដំណឹង

source: Whether parents have been notified
km: ថាតើឪពុកម្តាយត្រូវបានជូនដំណឹងយ៉ាងដូចម្តេច

source: Parent Notification Date
km: កាលបរិច្ឆេទជូនដំណឹងរបស់មេ

source: Parent Response
km: ការឆ្លើយតបរបស់ឪពុកម្តាយ

source: Parent's response to notification
km: ការឆ្លើយតបរបស់ឪពុកម្តាយចំពោះការជូនដំណឹង

source: Permission Request
km: ការស្នើសុំការអនុញ្ញាត

source: Permission Requests
km: សំណើការអនុញ្ញាត

source: IEAP program does not allow permission requests.
km: កម្មវិធី iap មិនអនុញ្ញាតឱ្យមានសំណើរសុំការអនុញ្ញាតទេ។

source: Cannot request permission for past dates.
km: មិនអាចស្នើសុំការអនុញ្ញាតពីកាលបរិច្ឆេទកន្លងមកបានទេ។

source: Midnight Sync
km: ការធ្វើសមកាលកម្មពាក់កណ្តាលអធ្រាត្រ

source: Noon Sync
km: ការធ្វើសមកាលកម្មថ្ងៃត្រង់

source: Manual Sync
km: សមកាលកម្មដោយដៃ

source: Sync Date
km: កាលបរិច្ឆេទធ្វើសមកាលកម្ម

source: Date this roster sync applies to
km: កាលបរិច្ឆេទកាលៈទេសៈនេះធ្វើសមកាលកម្មការធ្វើសមកាលកម្មដែលត្រូវបានអនុវត្តចំពោះ

source: Sync Timestamp
km: សមកាលកម្មត្រាពេលវេលា

source: When sync was performed
km: នៅពេលសមកាលកម្មត្រូវបានអនុវត្ត

source: Sync Type
km: ប្រភេទសមកាលកម្មប្រភេទ

source: Is Successful
km: ទទួលបានជោគជ័យ

source: Whether sync completed successfully
km: ថាតើការធ្វើសមកាលកម្មបានបញ្ចប់ដោយជោគជ័យ

source: Error Message
km: សារកំហុស

source: Error details if sync failed
km: កំហុសកំហុសប្រសិនបើធ្វើសមកាលកម្មបានបរាជ័យ

source: Student Count
km: ចំនួននិស្សិត

source: Number of students in roster
km: ចំនួននិស្សិតក្នុងបញ្ជីឈ្មោះ

source: Enrollment Snapshot
km: រូបថតចុះឈ្មោះ

source: Frozen enrollment data for this date
km: ទិន្នន័យចុះឈ្មោះចូលរៀនក្លាសេសម្រាប់កាលបរិច្ឆេទនេះ

source: Roster Changed
km: ផ្លាស់ប្តូរបញ្ជីឈ្មោះ

source: Whether roster changed since last sync
km: ថាតើបញ្ជីឈ្មោះត្រូវបានផ្លាស់ប្តូរចាប់តាំងពីការធ្វើសមកាលកម្មចុងក្រោយ

source: Changes Summary
km: ការផ្លាស់ប្តូរសេចក្តីសង្ខេប

source: Summary of enrollment changes
km: សេចក្តីសង្ខេបនៃការផ្លាស់ប្តូរការចុះឈ្មោះចូលរៀន

source: Roster Sync
km: ធ្វើសមកាលកម្មការធ្វើសមកាលកម្ម

source: Roster Syncs
km: ការធ្វើសមកាលកម្មឈ្មោះ

source: Term
km: រយបេលមយយ

source: Total Sessions
km: វគ្គសរុប

source: Total number of class sessions
km: ចំនួនសរុបនៃវគ្គថ្នាក់

source: Present Sessions
km: វគ្គបច្ចុប្បន្ន

source: Number of sessions student was present
km: ចំនួននិស្សិតនៃសម័យប្រជុំមានវត្តមាន

source: Absent Sessions
km: វគ្គអវត្តមាន

source: Number of sessions student was absent
km: ចំនួននិស្សិតសម័យប្រជុំបានអវត្តមាន

source: Late Sessions
km: វគ្គយឺតយ៉ាវ

source: Number of sessions student was late
km: ចំនួននិស្សិតវគ្គគឺយឺត

source: Excused Sessions
km: វគ្គដោះសា

source: Number of sessions with approved permissions
km: ចំនួនវគ្គដែលមានការអនុញ្ញាតដែលបានអនុម័ត

source: Attendance Percentage
km: ភាគរយនៃការចូលរួម

source: Overall attendance percentage
km: ភាគរយចូលរួមសរុប

source: Punctuality Percentage
km: ភាគរយជាក់ស្តែង

source: Percentage of on-time arrivals
km: ភាគរយនៃការមកដល់ទាន់ពេលវេលា

source: Archived On
km: ទុកក្នុងប័ណ្ណសារ

source: Archived By
km: ទុកក្នុងប័ណ្ណសារដោយ

source: Session Details
km: ព័ត៌មានលម្អិតសម័យ

source: Compressed attendance details for all sessions
km: ព័ត៌មានលំអិតនៃការចូលរួមដែលបានបង្ហាប់សម្រាប់វគ្គទាំងអស់

source: Attendance Archive
km: ប័ណ្ណសារចូលរួម

source: Attendance Archives
km: បណ្ណសារចូលរួម

source: Basic Information
km: ព័ត៌មានមូលដ្ឋាន

source: Equipment & Features
km: ឧបករណ៍និងលក្ខណៈពិសេស

source: Status & Notes
km: ស្ថានភាពនិងកំណត់ចំណាំ

source: Holiday Information
km: ព័ត៌មានថ្ងៃឈប់សម្រាក

source: Dates
km: កាលបរិច្ឆេទ

source: Audit Information
km: ព័ត៌មានសវនកម្ម

source: Target Object
km: វត្ថុគោលដៅ

source: Override Details
km: ព័ត៌មានលម្អិតអំពីការបដិសេធ

source: Request Information
km: ស្នើសុំព័ត៌មាន

source: Target
km: តមរុយសរមាប់បាញ់

source: Activity Information
km: ព័ត៌មានសកម្មភាព

source: Student Information
km: ព័ត៌មាននិស្សិត

source: Academic Context
km: បរិបទសិក្សា

source: Administrative Details
km: ព័ត៌មានលម្អិតរដ្ឋបាល

source: Date/Time
km: កាលបរិច្ឆេទ / ពេលវេលា

source: Student Name
km: ឈ្មោះនិស្សិត

source: Activity Type
km: ប្រភេទសកម្មភាព

source: Class
km: វន្ណៈ

source: Performed By
km: អនុវត្តដោយ

source: Visibility
km: ការបហ្ចេញអាេយឃើញ

source: Activity Details (JSON)
km: ព័ត៌មានលម្អិតសកម្មភាព (JSOL)

source: Export selected logs as CSV
km: នាំចេញកំណត់ហេតុដែលបានជ្រើសរើសជាស៊ីអេសអេស

source: Mark as Staff Only
km: សម្គាល់ជាបុគ្គលិកប៉ុណ្ណោះ

source: Mark as Student Visible
km: សម្គាល់ជានិស្សិតដែលអាចមើលឃើញ

source: 🔍 Audit Trail
km: 🔍ផ្លូវសវនកម្ម

source: Track who created and modified this record. Click to expand.
km: តាមដានដែលបានបង្កើតនិងកែប្រែកំណត់ត្រានេះ។ ចុចដើម្បីពង្រីក។

source: System
km: របប័ន្ធ

source: Created By
km: បង្កើតឡើងដោយ

source: Last Updated By
km: ធ្វើបច្ចុប្បន្នភាពចុងក្រោយដោយ

source: Banteay Meanchey
km: បន្ទាយមានជ័យ

source: Battambang
km: បាត់ដំបង

source: Kampong Cham
km: កំពង់ចាម

source: Kampong Chhnang
km: កំពង់ឆ្នាំង

source: Kampong Speu
km: កំពង់ស្ពឺ

source: Kampong Thom
km: កំពង់ធំ

source: Kampot
km: កំពត

source: Kandal
km: កណ្តាល

source: Kep
km: កែប

source: Koh Kong
km: កោះកុង

source: Kratie
km: ក្រចេះ

source: Mondulkiri
km: មណ្ឌលគីរី

source: Oddar Meanchey
km: ឧត្តរមានជ័យ

source: Pailin
km: ប៉ៃលិន

source: Phnom Penh
km: រាជធានី

source: Preah Sihanouk
km: ព្រះសីហនុ

source: Preah Vihear
km: ព្រះវិហារ

source: Prey Veng
km: ព្រៃវែង

source: Pursat
km: ពោធិសាត់

source: Ratanakiri
km: រតនគិរី

source: Siem Reap
km: សៀមរាប

source: Stung Treng
km: ស្ទឹងត្រែង

source: Svay Rieng
km: ស្វាយរៀង

source: Takeo
km: តាកែវ

source: International/Other
km: អន្តរជាតិ / ផ្សេងទៀត

source: Unknown
km: ដេលមិនស្គាល់

source: Main Building
km: អគារមេ

source: West Building
km: អាគារខាងលិច

source: Back Building
km: អគារត្រឡប់មកវិញ

source: Dashboard
km: របដាប់ខ

source: Level Testing
km: ការធ្វើតេស្តកម្រិត

source: Student Application
km: កម្មវិធីនិស្សិត

source: Apply for placement testing
km: ដាក់ពាក្យសុំធ្វើតេស្តិ៍ការដាក់

source: Staff Dashboard
km: ផ្ទាំងគ្រប់គ្រងបុគ្គលិក

source: Manage test applications
km: គ្រប់គ្រងកម្មវិធីសាកល្បង

source: Applications
km: កម្មវិធី

source: View all applications
km: មើលកម្មវិធីទាំងអស់

source: Payment Processing
km: ដំណើរការទូទាត់

source: Process test payments
km: ដំណើរការនៃការធ្វើតេស្តសាកល្បង

source: Student Management
km: ការគ្រប់គ្រងនិស្សិត

source: Students
km: និស្សិត

source: Manage student records
km: គ្រប់គ្រងកំណត់ត្រានិស្សិត

source: Enrollment
km: ការចុហឈ្ផោហ

source: Student enrollment management
km: ការគ្រប់គ្រងការចុះឈ្មោះចូលរៀនរបស់និស្សិត

source: Attendance
km: ការមក

source: Track student attendance
km: តាមដានការចូលរួមរបស់សិស្ស

source: Courses
km: វគ្គសិក្សា

source: Course catalog management
km: ការគ្រប់គ្រងកាតាឡុកវគ្គសិក្សាវគ្គសិក្សា

source: Programs
km: កមនើត

source: Academic programs
km: កម្មវិធីសិក្សា

source: Scheduling
km: ការកំណត់ពេលវេលា

source: Class scheduling
km: ការរៀបចំកាលវិភាគថ្នាក់

source: Grading
km: ដាក់កោល

source: Grade management
km: ការគ្រប់គ្រងថ្នាក់

source: Finance
km: ផ្ដល់ហិរហ្ញវត្ថុ

source: Payments Overview
km: ទិដ្ឋភាពទូទៅនៃការទូទាត់

source: Payment management
km: ការគ្រប់គ្រងការទូទាត់

source: Invoicing
km: វិក័យប័ត្រ

source: Invoice management
km: ការប្រៀននតីវិក័យប័ត្រ

source: Financial Reports
km: របាយការណ៍ហិរញ្ញវត្ថុ

source: Financial reporting
km: របាយការណ៍ហិរញ្ញវត្ថុ

source: Test Fee Reports
km: របាយការណ៍ថ្លៃសេវា

source: Level testing revenue
km: ចំណូលសាកល្បងកម្រិត

source: Student Billing
km: វិក័យប័ត្ររបស់និស្សិត

source: Student payment tracking
km: ការតាមដានការទូទាត់របស់និស្សិត

source: Reports
km: របាយការណ៍

source: Enrollment Reports
km: របាយការណ៍ចុះឈ្មោះចូលរៀន

source: Enrollment statistics
km: ស្ថិតិចុះឈ្មោះ

source: Revenue and expenses
km: ចំណូលនិងចំណាយ

source: Academic Reports
km: របាយការណ៍សិក្សា

source: Academic performance
km: លទ្ធផលនៃការសិក្សា

source: Administration
km: តីចាត់ការ

source: Full system administration
km: រដ្ឋបាលប្រព័ន្ធពេញ

source: User Management
km: ការគ្រប់គ្រងអ្នកប្រើប្រាស់

source: Manage system users
km: គ្រប់គ្រងអ្នកប្រើប្រាស់ប្រព័ន្ធ

source: System Settings
km: ការកំណត់ប្រព័ន្ធ

source: System configuration
km: ការកំណត់រចនាសម្ព័ន្ធប្រព័ន្ធ

source: System Administrator
km: អប់រំប្រព័ន្ធអ្នកគ្រប់គ្រង

source: Finance Manager
km: អ្នកគ្រប់គ្រងហិរញ្ញវត្ថុ

source: Registrar
km: អ្នកកត់រតាចុលបហ្ជី

source: Academic Coordinator
km: អ្នកសម្របសម្រួលសិក្សា

source: Administrative Clerk
km: ស្មៀនរដ្ឋបាល

source: Staff Member
km: បុគ្គលិកបុគ្គលិក

source: From Date
km: ចាប់ពីសម័យ

source: Start date
km: កាលបរិច្ឆេទចាប់ផ្តើម

source: Filter logs from this date onwards
km: តម្រងកំណត់ហេតុពីកាលបរិច្ឆេទនេះតទៅ

source: To Date
km: មកដល់ពេលនេះ

source: End date
km: កាលបរិច្ឆេទបញ្ចប់

source: Filter logs up to this date
km: តម្រងចូលទៅកាលបរិច្ឆេទនេះ

source: Custom Range
km: ជួរផ្ទាល់ខ្លួន

source: Today
km: ថៃនេហ

source: Yesterday
km: បីមសិលមិញ

source: Last 7 Days
km: 7 ថ្ងៃចុងក្រោយ

source: Last 30 Days
km: 30 ថ្ងៃចុងក្រោយ

source: Last 90 Days
km: 90 ថ្ងៃចុងក្រោយ

source: This Month
km: ខែនេះ

source: Last Month
km: ខែមុន

source: This Year
km: ឆ្នាំនេះ

source: Quick Date Range
km: ជួរកាលបរិច្ឆេទរហ័សរហ័ស

source: Student Numbers
km: លេខនិស្សិត

source: Enter student numbers separated by commas or new lines
km: បញ្ចូលលេខនិស្សិតដែលបំបែកដោយសញ្ញាក្បៀសឬបន្ទាត់ថ្មី

source: Multiple student numbers can be entered
km: លេខនិស្សិតជាច្រើនអាចត្រូវបានបញ្ចូល

source: Activity Types
km: ប្រភេទសកម្មភាព

source: Select one or more activity types to filter
km: ជ្រើសរើសប្រភេទសកម្មភាពមួយឬច្រើនដើម្បីត្រង

source: e.g., 2023-24-Fall
km: ឧ។ 2023-24- ដួលរលំ

source: Class Code
km: លេខកូដថ្នាក់

source: e.g., CS101
km: ឧ។ ស៊ី .101

source: Visibility Levels
km: កម្រិតភាពមើលឃើញ

source: Log Source
km: ប្រភពចូល

source: All
km: តាមងអស់

source: System Generated Only
km: ប្រព័ន្ធបង្កើតតែប៉ុណ្ណោះ

source: User Actions Only
km: សកម្មភាពអ្នកប្រើប្រាស់តែប៉ុណ្ណោះ

source: Any Staff Member
km: សមាជិកបុគ្គលិកណាមួយ

source: Search in Description
km: ស្វែងរកក្នុងការពិពណ៌នា

source: Search text in descriptions
km: ស្វែងរកអត្ថបទនៅក្នុងការពិពណ៌នា

source: Created at
km: បានបង្កើតនៅ

source: Date and time when the record was created
km: កាលបរិច្ឆេទនិងពេលវេលានៅពេលដែលកំណត់ត្រាត្រូវបានបង្កើតឡើង

source: Updated at
km: ធ្វើឱ្យទាន់សម័យនៅ

source: Date and time when the record was last updated
km: កាលបរិច្ឆេទនិងពេលវេលានៅពេលដែលកំណត់ត្រាត្រូវបានធ្វើបច្ចុប្បន្នភាពចុងក្រោយ

source: Is deleted
km: ត្រូវបានលុបចោល

source: Indicates if this record has been soft deleted
km: បង្ហាញថាតើកំណត់ត្រានេះត្រូវបានលុបចោលយ៉ាងដូចម្តេច

source: Deleted at
km: បានលុបនៅ

source: Date and time when the record was marked as deleted
km: កាលបរិច្ឆេទនិងពេលវេលានៅពេលដែលកំណត់ត្រាត្រូវបានសម្គាល់ថាបានលុប

source: Unique identifier for this record
km: អ្នកកំណត់អត្តសញ្ញាណពិសេសសម្រាប់កំណត់ត្រានេះ

source: Created by
km: បង្កើតឡើងដោយ

source: User who created this record
km: អ្នកប្រើដែលបានបង្កើតកំណត់ត្រានេះ

source: Updated by
km: ធ្វើឱ្យទាន់សម័យដោយ

source: User who last updated this record
km: អ្នកប្រើប្រាស់ដែលបានធ្វើបច្ចុប្បន្នភាពកំណត់ត្រានេះចុងក្រោយ

source: Active
km: សកម្ម

source: Inactive
km: ដេលក្ផានសកម្ផផាប

source: Draft
km: ពង្រាក់

source: Archived
km: ឃោសនារួច

source: Current status of this record
km: ស្ថានភាពបច្ចុប្បន្ននៃកំណត់ត្រានេះ

source: Status changed at
km: ស្ថានភាពបានផ្លាស់ប្តូរនៅ

source: Date and time when status was last changed
km: កាលបរិច្ឆេទនិងពេលវេលានៅពេលដែលស្ថានភាពត្រូវបានផ្លាស់ប្តូរចុងក្រោយ

source: Slug
km: ខ្យងក្ដក់

source: URL-friendly version of the name
km: កំណែ URL ដែលងាយស្រួលសម្រាប់ឈ្មោះ

source: Order
km: ការដឹកនាម

source: Order for sorting records
km: បញ្ជាទិញសម្រាប់ការតម្រៀបកំណត់ត្រា

source: Enrollment Override
km: ការចុះឈ្មោះចូលរៀន

source: Repeat Prevention Override
km: ការការពារម្តងទៀត

source: Prerequisite Override
km: ការបដិសេធជាមុន

source: Capacity Override
km: ការបដិសេធសមត្ថភាព

source: Academic Policy Override
km: ការបដិសេធគោលនយោបាយគោលនយោបាយ

source: Registration Policy Override
km: បដិសេធគោលនយោបាយចុះបញ្ជី

source: Language Level Skip
km: កំរិតភាសារំលង

source: Language Promotion Override
km: ការផ្សព្វផ្សាយភាសាការផ្សព្វផ្សាយភាសា

source: Action Type
km: ប្រភេទសកម្មភាព

source: Type of override action performed
km: ប្រភេទនៃសកម្មភាពបដិសេធ

source: User who performed the override action
km: អ្នកប្រើប្រាស់ដែលបានអនុវត្តសកម្មភាពបដិសេធ

source: Type of the target object
km: ប្រភេទនៃវត្ថុគោលដៅ

source: ID of the specific object that was affected
km: លេខសម្គាល់នៃវត្ថុជាក់លាក់ដែលរងផលប៉ះពាល់

source: Target App
km: កម្មវិធីគោលដៅ

source: DEPRECATED: Use content_type instead
km: បានបដិសេធ: ប្រើមាតិកា _type ជំនួសវិញ

source: Target Model
km: គំរូគោលដៅ

source: Target Object ID
km: លេខសម្គាល់វត្ថុគោលដៅ

source: DEPRECATED: Use object_id instead
km: បដិសេធ: ប្រើ Quick_id ជំនួសវិញ

source: Detailed reason for the override action
km: ហេតុផលលម្អិតសម្រាប់សកម្មភាពបដិសេធ

source: Original Restriction
km: ការដាក់កម្រិតដើម

source: Description of the rule/restriction that was overridden
km: ការពិពណ៌នាអំពីវិធាន / ការដាក់កម្រិតដែលត្រូវបានបដិសេធ

source: Additional details about the override in JSON format
km: ព័ត៌មានលំអិតបន្ថែមអំពីការបដិសេធក្នុងទ្រង់ទ្រាយ JSY

source: IP Address
km: អាសយដ្ឋាន IP

source: IP address of the user who performed the override
km: អាសយដ្ឋាន IP របស់អ្នកប្រើប្រាស់ដែលបានអនុវត្តការបដិសេធ

source: User Agent
km: ភ្នាក់ងារអ្នកប្រើប្រាស់

source: Browser/client information for the override action
km: កម្មវិធីរុករក / ព័ត៌មានរបស់អតិថិជនសម្រាប់សកម្មភាពបដិសេធ

source: System Audit Log
km: កំណត់ហេតុសវនកម្មប្រព័ន្ធ

source: System Audit Logs
km: កំណត់ហេតុសវនកម្មប្រព័ន្ធ

source: Class Enrollment
km: ការចុះឈ្មោះចូលរៀនថ្នាក់

source: Class Withdrawal
km: ការដកថ្នាក់

source: Class Completion
km: ការបញ្ចប់ថ្នាក់

source: Language Level Promotion
km: ការផ្សព្វផ្សាយកម្រិតភាសា

source: Language Program Transfer
km: ការផ្ទេរកម្មវិធីភាសា

source: Grade Assignment
km: កិច្ចការថ្នាក់ទី

source: Grade Change
km: ការផ្លាស់ប្តូរថ្នាក់

source: Graduation Recorded
km: បញ្ចប់ការសិក្សា

source: Program Enrollment
km: ការចុះឈ្មោះចូលរៀនកម្មវិធី

source: Program Withdrawal
km: ការដកកម្មវិធី

source: Student Status Change
km: ការផ្លាស់ប្តូរស្ថានភាពរបស់និស្សិត

source: Monk Status Change
km: ការផ្លាស់ប្តូរស្ថានភាពព្រះសង្ឃ

source: Management Override Applied
km: ការគ្រប់គ្រងប្រឆាំងនឹងការគ្រប់គ្រងបានអនុវត្ត

source: Scholarship Assigned
km: ផ្តល់យោបល់

source: Scholarship Revoked
km: ការដកហូតអាហារូបករណ៍

source: Student Profile Created
km: ទម្រង់និស្សិតបង្កើត

source: Student Profile Updated
km: ប្រវត្តិរូបនិស្សិតបានធ្វើបច្ចុប្បន្នភាព

source: Student Profiles Merged
km: ទម្រង់និស្សិតបានបញ្ចូលគ្នា

source: Student Number
km: លេខនិស្សិត

source: Student number for easy searching
km: លេខនិស្សិតសម្រាប់ការស្វែងរកងាយស្រួល

source: Student name at time of action (for historical reference)
km: ឈ្មោះនិស្សិតនៅពេលសកម្មភាព (សម្រាប់ឯកសារយោងប្រវត្តិសាស្ត្រ)

source: Type of activity performed
km: ប្រភេទនៃសកម្មភាពដែលបានអនុវត្ត

source: Detailed description of the activity
km: ការពិពណ៌នាលំអិតនៃសកម្មភាព

source: Term Name
km: ឈ្មោះពាក្យ

source: Term when activity occurred (if applicable)
km: ពាក្យនៅពេលសកម្មភាពកើតឡើង (បើមាន)

source: Course/class code (if applicable)
km: វគ្គសិក្សា / លេខកូដថ្នាក់ (បើមាន)

source: Class Section
km: ផ្នែកថ្នាក់

source: Class section (if applicable)
km: ផ្នែកថ្នាក់ (បើមាន)

source: Program Name
km: ឈ្មោះកម្មវិធី

source: Academic or language program (if applicable)
km: កម្មវិធីសិក្សាឬភាសា (បើមាន)

source: Activity Details
km: ព័ត៌មានលម្អិតសកម្មភាព

source: Additional structured details about the activity
km: ព័ត៌មានលម្អិតដែលមានរចនាសម្ព័ន្ធបន្ថែមអំពីសកម្មភាព

source: Staff member who performed or initiated the action
km: បុគ្គលិកដែលបានអនុវត្តឬផ្តួចផ្តើមសកម្មភាព

source: System Generated
km: ប្រព័ន្ធដែលបានបង្កើត

source: Whether this log entry was automatically generated
km: ថាតើធាតុចូលនេះត្រូវបានបង្កើតដោយស្វ័យប្រវត្តិឬអត់

source: Staff Only
km: តែបុគ្គលិកប៉ុណ្ណោះ

source: Student Can View
km: និស្សិតអាចមើលបាន

source: Public Record
km: កំណត់ត្រាសាធារណៈ

source: Who can view this audit log entry
km: អ្នកណាអាចមើលការចូលកំណត់ហេតុសវនកម្មនេះ

source: Student Audit Log
km: កំណត់ហេតុសវនកម្មនិស្សិត

source: Student Audit Logs
km: កំណត់ហេតុសវនកម្មនិស្សិត

source: Classroom
km: ថ្នាក់រៀន

source: Computer Lab
km: បន្ទប់កុំព្យូទ័រ

source: Language Lab
km: បន្ទប់

source: Conference Room
km: បន្ទប់សន្និសីទ

source: Meeting Room
km: បន្ទប់ប្រជុំ

source: Office
km: ការរិយាល័យ

source: Building
km: សមនង់

source: Building where this room is located
km: អគារដែលមានទីតាំងនេះមានទីតាំងនៅ

source: Room Name
km: ឈ្មោះបន្ទប់

source: Name or identifier for the room
km: ឈ្មោះឬអត្តសញ្ញាណសម្រាប់បន្ទប់

source: Room Code
km: លេខកូដបន្ទប់

source: Auto-generated internal identifier for the room
km: ឧបករណ៍កំណត់អត្តសញ្ញាណផ្ទៃក្នុងដែលបង្កើតដោយស្វ័យប្រវត្តិសម្រាប់បន្ទប់

source: Capacity
km: មុខងារ

source: Maximum number of people this room can accommodate
km: ចំនួនប្រជាជនអតិបរមាបន្ទប់នេះអាចផ្ទុកបាន

source: Room Type
km: ប្រភេទបន្ទប់

source: Type of room for scheduling purposes
km: ប្រភេទនៃបន្ទប់សម្រាប់គោលបំណងកំណត់ពេលវេលា

source: Has Projector
km: មានម៉ាស៊ីនបញ្ចាំង

source: Whether this room has an overhead projector
km: ថាតើបន្ទប់នេះមានម៉ាស៊ីនបញ្ចាំងលើស

source: Has Whiteboard
km: មានក្តារខៀន

source: Whether this room has a whiteboard
km: ថាតើបន្ទប់នេះមានក្តារខៀន

source: Has Computers
km: មានកុំព្យូទ័រ

source: Whether this room has computers available
km: ថាតើបន្ទប់នេះមានកុំព្យូទ័រមាន

source: Whether this room is currently available for use
km: ថាតើបន្ទប់នេះមានសម្រាប់ការប្រើប្រាស់

source: Additional notes about this room
km: កំណត់ចំណាំបន្ថែមអំពីបន្ទប់នេះ

source: Room
km: បន្ទប់

source: Rooms
km: បន្ទប់

source: English Name
km: ឈ្មោះអង់គ្លេស

source: Holiday name in English
km: ឈ្មោះថ្ងៃឈប់សម្រាកជាភាសាអង់គ្លេស

source: Khmer Name
km: ឈ្មោះខ្មែរ

source: Holiday name in Khmer
km: ឈ្មោះថ្ងៃឈប់សម្រាកជាភាសាខ្មែរ

source: Date when the holiday begins
km: កាលបរិច្ឆេទនៅពេលថ្ងៃឈប់សម្រាកចាប់ផ្តើម

source: Date when the holiday ends
km: កាលបរិច្ឆេទនៅពេលថ្ងៃឈប់សម្រាកបញ្ចប់

source: Whether this holiday is currently observed
km: ថាតើថ្ងៃឈប់សម្រាកនេះបច្ចុប្បន្នត្រូវបានគេសង្កេតឃើញ

source: Additional information about this holiday
km: ព័ត៌មានបន្ថែមអំពីថ្ងៃឈប់សម្រាកនេះ

source: Holiday
km: ថៃបុន្យ

source: Holidays
km: ថ្ងៃឈប់សម្រាក

source: End date cannot be before start date
km: កាលបរិច្ឆេទបញ្ចប់មិនអាចមានមុនកាលបរិច្ឆេទចាប់ផ្តើមទេ

source: Activity Summary
km: សង្ខេបសកម្មភាព

source: Total Logs
km: កំណត់ហេតុសរុប

source: Top Activity Types
km: ប្រភេទសកម្មភាពកំពូល

source: Count
km: រាប់

source: No activity data
km: គ្មានទិន្នន័យសកម្មភាព

source: Visibility Breakdown
km: ការបែកបាក់នៃភាពមើលឃើញ

source: Student Visible
km: និស្សិតអាចមើលឃើញ

source: Public
km: ចាសាធារនៈ

source: No visibility data
km: មិនមានទិន្នន័យទិស្សភាពទេ

source: Most Active Students
km: និស្សិតសកម្មបំផុត

source: Activities
km: សកម្មភាព

source: No student data
km: គ្មានទិន្នន័យនិស្សិត

source: Quick Filters
km: តម្រងរហ័ស

source: Enrollments
km: ដេនបវាកូន

source: Withdrawals
km: ការដកប្រាក់

source: Grade Changes
km: ការផ្លាស់ប្តូរថ្នាក់ទី

source: Overrides
km: ការធេវីអាេយបដិសេធ

source: Clear Filters
km: តម្រងច្បាស់

source: Phone number must be between 8 and 15 digits long.
km: លេខទូរស័ព្ទត្រូវតែមានចន្លោះពី 8 ទៅ 15 ខ្ទង់។

source: Curriculum
km: កម្មវិធីជំនួយ

source: Division Name
km: ឈ្មោះចែក

source: Full name of the division (e.g., 'Language Division')
km: ឈ្មោះពេញរបស់ផ្នែក (ឧ។ ផ្នែកភាសា ')

source: Short Name
km: ឈ្មោះខ្លី

source: Abbreviated name for codes and displays
km: ឈ្មោះអក្សរកាត់សម្រាប់លេខកូដនិងការបង្ហាញ

source: Division
km: ការបេងចេក

source: Divisions
km: វផ្ជា

source: Cycle Name
km: ឈ្មោះវដ្ត

source: Name of the cycle (e.g., 'Foundation Year', 'Bachelor's Program')
km: ឈ្មោះវដ្ត (ឧ។ ឆ្នាំមូលនិធិ '' មូលដ្ឋាន '' កម្មវិធីបរិញ្ញាបត្រ ')

source: Abbreviated name for codes
km: ឈ្មោះអក្សរកាត់សម្រាប់លេខកូដ

source: Typical Duration (Terms)
km: រយៈពេលធម្មតា (ល័ក្ខខ័ណ្ឌ)

source: Expected number of terms to complete this cycle
km: ចំនួនពាក្យរំពឹងទុកដើម្បីបញ្ចប់វដ្តនេះ

source: Order for display (positive integers only)
km: ការបញ្ជាទិញសម្រាប់ការបង្ហាញ (ចំនួនគត់វិជ្ជមាន)

source: Cycle
km: ផាបរចមដេល

source: Cycles
km: វដូង

source: Academic Degree Program
km: កម្មវិធីសញ្ញាប័ត្រសិក្សា

source: Language Program
km: កម្មវិធីភាសា

source: Bachelor of Arts
km: បរិញ្ញាបត្រសិល្បៈ

source: Master of Business Administration
km: អនុបណ្ឌិតរដ្ឋបាលពាណិជ្ជកម្ម

source: Master of Education
km: អនុបណ្ឌិតអប់រំ

source: Master of Arts
km: អនុបណ្ឌិតសិល្បៈ

source: Associate of Arts
km: សហការីនៃសិល្បៈ

source: Doctor of Philosophy
km: បណ្ឌិតទស្សនវិជ្ជា

source: Certificate
km: វិហ្ញាប័នប័រត

source: No degree awarded
km: មិនទទួលបានរង្វាន់

source: Full name of the major or program
km: ឈ្មោះពេញនៃមុខជំនាញឬកម្មវិធី

source: Abbreviated name for transcripts and codes
km: ឈ្មោះអក្សរកាត់សម្រាប់ប្រតិចារឹកនិងលេខកូដ
