Repository: starkjeffrey/naga-monorepo-v1-final
Catalog: apps/backend/locale/*/LC_MESSAGES/django.po
Languages: km

source: Delivery method '{self.delivery_method}' is not available
km: វិធីសាស្រ្តដឹកជញ្ជូន '{{meal.delivery_method} មិនមានទេ

source: Email address is required for email delivery
km: អាសយដ្ឋានអ៊ីម៉ែលត្រូវបានទាមទារសម្រាប់ការដឹកជញ្ជូនអ៊ីម៉ែល

source: Mailing address is required for postal delivery
km: អាសយដ្ឋានសំបុត្រគឺចាំបាច់សម្រាប់ការដឹកជញ្ជូនប្រៃសណីយ៍

source: Document ID
km: លេខសម្គាល់ឯកសារ

source: Unique identifier for this document
km: អ្នកកំណត់អត្តសញ្ញាណពិសេសសម្រាប់ឯកសារនេះ

source: Request that generated this document
km: សំណើដែលបង្កើតឯកសារនេះ

source: Student this document belongs to
km: ឯកសាររបស់និស្សិតនេះជាកម្មសិទ្ធិរបស់

source: File Path
km: ផ្លូវឯកសារ

source: Path to the generated document file
km: ផ្លូវទៅកាន់ឯកសារឯកសារដែលបានបង្កើត

source: File Size
km: ទំហំឯកសារ

source: Size of the document file in bytes
km: ទំហំឯកសារឯកសារជាបៃ

source: Content Hash
km: មាតិកាហាស

source: SHA-256 hash of document content for verification
km: Sha-256 Hash នៃមាតិកាឯកសារសម្រាប់ការផ្ទៀងផ្ទាត់

source: Verification Code
km: លេខកូដផ្ទៀងផ្ទាត់

source: Unique code for document verification
km: លេខកូដពិសេសសម្រាប់ការផ្ទៀងផ្ទាត់ឯកសារ

source: QR Code Data
km: ទិន្នន័យលេខកូដ QR

source: QR code data for verification
km: ទិន្នន័យលេខកូដ QR សម្រាប់ការផ្ទៀងផ្ទាត់

source: Generated By
km: បង្កើតដោយ

source: User who generated this document
km: អ្នកប្រើប្រាស់ដែលបានបង្កើតឯកសារនេះ

source: Generated Date
km: កាលបរិច្ឆេទបង្កើត

source: Date and time the document was generated
km: កាលបរិច្ឆេទនិងពេលវេលាឯកសារត្រូវបានបង្កើត

source: Document Data
km: ទិន្នន័យឯកសារ

source: Document-specific metadata (e.g., as_of_date, included_terms)
km: ទិន្នន័យមេតាជាក់លាក់របស់ឯកសារ (ឧ។ អេស ..

source: Access Count
km: ការរាប់ចូល

source: Number of times this document has been accessed
km: ចំនួនដងនៃឯកសារនេះត្រូវបានចូលមើល

source: Last Accessed
km: ចូលដំណើរការចុងក្រោយ

source: Date and time the document was last accessed
km: កាលបរិច្ឆេទនិងពេលវេលាឯកសារត្រូវបានចូលដំណើរការចុងក្រោយ

source: Generated Document
km: បង្កើតឯកសារ

source: Generated Documents
km: បង្កើតឯកសារ

source: Request this comment belongs to
km: ស្នើសុំយោបល់នេះជារបស់

source: Comment
km: អធិប្បាយ

source: Comment or status update text
km: មតិយោបល់ឬអត្ថបទបច្ចុប្បន្នភាពស្ថានភាព

source: Internal Comment
km: យោបល់ផ្ទៃក្នុង

source: Whether this comment is for staff only
km: ថាតើមតិយោបល់នេះសម្រាប់តែបុគ្គលិក

source: Author
km: អ្នកនិបន្ធ

source: User who wrote this comment
km: អ្នកប្រើប្រាស់ដែលសរសេរមតិយោបល់នេះ

source: Document Request Comment
km: ឯកសារស្នើសុំមតិយោបល់

source: Document Request Comments
km: ឯកសារស្នើសុំយោបល់

source: Student this usage record belongs to
km: កំណត់ត្រាការប្រើប្រាស់នេះជាកម្មសិទ្ធិរបស់

source: Document type this usage applies to
km: ប្រភេទឯកសារដែលការប្រើប្រាស់នេះអនុវត្តចំពោះ

source: Total Requested
km: បានស្នើសុំសរុប

source: Total number of documents of this type ever requested
km: ចំនួនសរុបនៃឯកសារប្រភេទនេះដែលបានស្នើសុំ

source: Total Completed
km: បានបញ្ចប់សរុប

source: Total number of documents of this type successfully completed
km: ចំនួនសរុបនៃឯកសារប្រភេទនេះបានបញ្ចប់ដោយជោគជ័យ

source: Total Free Used
km: ប្រើដោយឥតគិតថ្លៃសរុប

source: Total number of free allowances used for this document type
km: ចំនួនទឹកប្រាក់សរុបនៃប្រាក់ឧបត្ថម្ភឥតគិតថ្លៃដែលត្រូវបានប្រើសម្រាប់ប្រភេទឯកសារនេះ

source: Total Paid
km: សរុបដែលបានបង់

source: Total number of paid documents of this type
km: ចំនួនឯកសារដែលបានបង់សរុបនៃប្រភេទនេះ

source: Current Term Count
km: ចំនួនពាក្យបច្ចុប្បន្ន

source: Number of documents requested in current term
km: ចំនួនឯកសារដែលបានស្នើសុំក្នុងអាណត្តិបច្ចុប្បន្ន

source: Current Year Count
km: ការរាប់ឆ្នាំបច្ចុប្បន្ន

source: Number of documents requested in current academic year
km: ចំនួនឯកសារដែលបានស្នើសុំនៅក្នុងឆ្នាំសិក្សាបច្ចុប្បន្ន

source: Last Request Date
km: កាលបរិច្ឆេទស្នើសុំចុងក្រោយ

source: Date of most recent request for this document type
km: កាលបរិច្ឆេទនៃការស្នើសុំថ្មីបំផុតសម្រាប់ប្រភេទឯកសារនេះ

source: Last Completed Date
km: កាលបរិច្ឆេទបញ្ចប់ចុងក្រោយ

source: Date of most recent completed document of this type
km: កាលបរិច្ឆេទនៃឯកសារដែលបានបញ្ចប់ថ្មីៗនៃប្រភេទនេះ

source: Document Usage Tracker
km: កម្មវិធីតាមដានការប្រើប្រាស់ឯកសារ

source: Document Usage Trackers
km: អ្នកតាមដានការប្រើប្រាស់ឯកសារ

source: Official Transcript
km: ប្រតិចារិកផ្លូវការ

source: Unofficial Transcript
km: ប្រតិចារិកក្រៅផ្លូវការ

source: Degree Audit Report
km: របាយការណ៍សវនកម្មបរិញ្ញាបត្រ

source: Unique identifier for this transcript request
km: អ្នកកំណត់អត្តសញ្ញាណពិសេសសម្រាប់ការស្នើសុំប្រតិចារិកនេះ

source: Student requesting the transcript
km: និស្សិតស្នើសុំប្រតិចារិកឯកសារប្រតិចារិក

source: Request Type
km: ប្រភេទស្នើសុំ

source: Type of transcript or report being requested
km: ប្រភេទនៃការប្រតិចារិកឬរបាយការណ៍ដែលត្រូវបានស្នើសុំ

source: How the transcript should be delivered
km: របៀបដែលប្រតិចារិកគួរតែត្រូវបានបញ្ជូន

source: Name of person or institution receiving the transcript
km: ឈ្មោះបុគ្គលឬស្ថាប័នទទួលប្រតិចារិក

source: Mailing address for transcript delivery
km: អាសយដ្ឋានអ៊ីមែលសម្រាប់ការដឹកជញ្ជូនប្រតិចារិក

source: Additional notes about the transcript request
km: កំណត់ចំណាំបន្ថែមអំពីការស្នើសុំប្រតិចារិក

source: Urgent Request
km: សំណើបន្ទាន់

source: Whether this is an urgent/expedited request
km: ថាតើនេះគឺជាសំណើរបន្ទាន់ / ជាបន្ទាន់

source: User who processed the request
km: អ្នកប្រើដែលបានដំណើរការសំណើ

source: Date and time the transcript was delivered
km: កាលបរិច្ឆេទនិងពេលវេលាប្រតិចារិកត្រូវបានប្រគល់ជូន

source: Transcript Request
km: ប្រតិចារិកសំណើ

source: Transcript Requests
km: ការស្នើសុំឯកសារប្រតិចារិក

source: Associated transcript request (if applicable)
km: ការស្នើសុំប្រតិចារិកដែលបានភ្ជាប់ (បើមាន)

source: Type of official document
km: ប្រភេទឯកសារផ្លូវការ

source: As Of Date
km: គិតត្រឹមកាលបរិច្ឆេទ

source: Academic records are current as of this date
km: កំណត់ត្រាសិក្សាគឺជាចរន្តគិតត្រឹមកាលបរិច្ឆេទនេះ

source: Include Transfer Credits
km: រួមបញ្ចូលសេវាឥណទានផ្ទេរ

source: Whether transfer credits are included in this document
km: ថាតើឥណទានផ្ទេរត្រូវបានរាប់បញ្ចូលក្នុងឯកសារនេះ

source: Official Document
km: ឯកសារផ្លូវការ

source: Official Documents
km: ឯកសារផ្លូវការ

source: Settings
km: ការកំណត់

source: Timestamps
km: ត្រាពេលវេលា

source: Active Roles
km: តួនាទីសកម្ម

source: Active Users
km: អ្នកប្រើប្រាស់សកម្ម

source: Hierarchy
km: ឋានយុន្ដីរារ

source: Set parent role for permission inheritance
km: កំណត់តួនាទីរបស់ឪពុកម្តាយសម្រាប់មរតកមរតក

source: Permissions
km: សិទ្ធិ

source: Basic permission flags for this role
km: ទង់ការអនុញ្ញាតមូលដ្ឋានសម្រាប់តួនាទីនេះ

source: Permission Flags
km: ទង់ការអនុញ្ញាត

source: Status
km: ច្បាប់

source: Role Type
km: ប្រភេទតួនាទី

source: Active Role Assignments
km: ការងារតួនាទីសកម្ម

source: Object-Level Permissions
km: សិទ្ធិកម្រិតនៃវត្ថុ

source: Optional: Restrict this permission to a specific object instance
km: ជម្រើស: ដាក់កម្រិតការអនុញ្ញាតនេះចំពោះវត្ថុវត្ថុជាក់លាក់មួយ

source: Object Level
km: កំរិតវត្ថុ

source: Activate selected items
km: ធ្វើឱ្យសកម្មធាតុដែលបានជ្រើសរើស

source: Successfully activated {} items.
km: ធ្វើឱ្យសកម្មរបស់ធាតុ {} ដោយជោគជ័យ។

source: Deactivate selected items
km: ធ្វើឱ្យធាតុដែលបានជ្រើសរើសអសកម្ម

source: Successfully deactivated {} items.
km: ធ្វើឱ្យអសកម្មនៃធាតុដែលបានធ្វើឱ្យអសកម្មដោយជោគជ័យ {} ដោយជោគជ័យ។

source: Naga SIS Administration
km: រដ្ឋបាលណាហ្គាស៊ី

source: Naga SIS Admin
km: រដ្ឋបាលណាហ្គាស៊ីស

source: Welcome to Naga SIS Administration
km: សូមស្វាគមន៍មកកាន់រដ្ឋបាលណាហ្គាស៊ី

source: Department Name
km: ឈ្មោះនាយកដ្ឋាន

source: Full name of the department
km: ឈ្មោះពេញរបស់នាយកដ្ឋាន

source: Department Code
km: លេខកូដនាយកដ្ឋាន

source: Short code for the department (e.g., 'CS', 'MATH', 'ADMIN')
km: លេខកូដខ្លីសម្រាប់នាយកដ្ឋាន (ឧ។ CS 'CS', 'គណនេយ្យ', 'admin')

source: Detailed description of the department's purpose and scope
km: ការពិពណ៌នាលំអិតនៃគោលបំណងនិងវិសាលភាពរបស់នាយកដ្ឋាន

source: Whether this department is currently active
km: ថាតើនាយកដ្ឋាននេះបច្ចុប្បន្នមានសកម្មភាព

source: Order for displaying departments in lists
km: បញ្ជាទិញសម្រាប់ការបង្ហាញនាយកដ្ឋាននៅក្នុងបញ្ជី

source: Department
km: រកសយង

source: Departments
km: សយបកម្ផ

source: Position Title
km: ចំណងជើងទីតាំង

source: Official title of the position (e.g., 'Department Chair', 'Academic Director')
km: ចំណងជើងផ្លូវការនៃមុខតំណែង (ឧ។ ប្រធាននាយកដ្ឋាន ',' នាយកសិក្សា ')

source: Department this position belongs to (leave blank for institutional positions)
km: នាយកដ្ឋានទីតាំងនេះជាកម្មសិទ្ធិរបស់ (ទុកឱ្យទីតាំងស្ថាប័ន)

source: Reports To
km: រាយការណ៍ទៅ

source: Position this role reports to in organizational hierarchy
km: ដាក់ទីតាំងតួនាទីនេះទៅឋានានុក្រមអង្គការ

source: Authority Level
km: កំរិតអាជ្ញាធរ

source: Authority level (1=highest like Dean, 2=Dept Chair, 3=Supervisor, etc.)
km: កំរិតអាជ្ញាធរ (1 = ខ្ពស់បំផុតដូចព្រឹទ្ធបុរស 2 = ប្រធានអណ្ឌី 3 = អ្នកត្រួតពិនិត្យ។ ល។ )

source: Override Policies
km: បដិសេធគោលនយោបាយ

source: List of policy types this position can override (e.g., ['ENROLLMENT', 'ACADEMIC'])
km: បញ្ជីប្រភេទគោលនយោបាយទីតាំងនេះអាចបដិសេធ (E.G. , ['ការចុះឈ្មោះ' ', សិក្សា]])

source: Approval Limits
km: ដែនកំណត់ការយល់ព្រម

source: Financial and other approval limits (e.g., {'financial': 5000, 'enrollment': 'unlimited'})
km: ដែនកំណត់ហិរញ្ញវត្ថុនិងការអនុម័តផ្សេងទៀត (ឧ។ ហិរញ្ញវត្ថុ): 5000, 'ចុះឈ្មោះ' 'ការចុះឈ្មោះ': 'គ្មានដែនកំណត់'})

source: Whether this position is currently active
km: ថាតើមុខតំណែងនេះសកម្មបច្ចុប្បន្ន

source: Detailed description of this position's responsibilities
km: ការពិពណ៌នាលំអិតនៃការទទួលខុសត្រូវរបស់ទីតាំងនេះ

source: Position
km: តីតាមង

source: Positions
km: មុខតំណែង

source: Circular reporting relationship detected.
km: បានរកឃើញទំនាក់ទំនងរាយការណ៍អំពីសារាចរ។

source: Authority level must be 1 or higher.
km: កំរិតអាជ្ញាធរត្រូវតែ 1 ឬខ្ពស់ជាងនេះ។

source: Invalid JSON structure: %(error)s
km: រចនាសម្ព័ន្ធ JSON មិនត្រឹមត្រូវ:% (កំហុស) s

source: Must be a list of policy types.
km: ត្រូវតែជាបញ្ជីប្រភេទគោលនយោបាយ។

source: Must be a dictionary of approval limits.
km: ត្រូវតែជាដែនកំណត់នៃដែនកំណត់ការយល់ព្រម។

source: Person
km: មនុសស

source: Start Date
km: កាលបរិច្ឆេទចាប់ផ្តើម

source: Date when this position assignment began
km: កាលបរិច្ឆេទនៅពេលដែលទីតាំងនេះបានចាប់ផ្តើម

source: End Date
km: កាលបរិច្ឆេទបញ្ចប់

source: Date when this position assignment ended (leave blank for current)
km: កាលបរិច្ឆេទនៅពេលដែលការងារនេះត្រូវបានបញ្ចប់ (ទុកឱ្យនៅទទេសម្រាប់ចរន្ត)

source: Is Acting
km: កំពុងធ្វើសកម្មភាព

source: Whether this is an acting position assignment
km: ថាតើនេះគឺជាការងាររបស់មុខតំណែងសម្ដែង

source: Is Primary
km: គឺបឋម

source: Whether this is the person's primary position
km: ថាតើនេះជាទីតាំងចម្បងរបស់មនុស្ស

source: Delegates To
km: ប្រតិភូទៅ

source: Position assignment that has been delegated authority
km: ការងារទីតាំងដែលត្រូវបានប្រគល់សិទ្ធិអំណាច

source: Delegation Start
km: ប្រតិភូចាប់ផ្តើម

source: Start date of delegation
km: កាលបរិច្ឆេទចាប់ផ្តើមនៃគណៈប្រតិភូ

source: Delegation End
km: គណៈប្រតិភូបញ្ចប់

source: End date of delegation
km: កាលបរិច្ឆេទបញ្ចប់នៃប្រតិភូ

source: Additional notes about this position assignment
km: កំណត់សំគាល់បន្ថែមអំពីការបំពេញការងារនេះ

source: Position Assignment
km: ការងារទីតាំង

source: Position Assignments
km: ការងារទីតាំង

source: End date must be after start date.
km: កាលបរិច្ឆេទបញ្ចប់ត្រូវតែមានបន្ទាប់ពីកាលបរិច្ឆេទចាប់ផ្តើម។

source: Delegation target is required when delegation start date is set.
km: គោលដៅប្រតិភូត្រូវបានទាមទារនៅពេលកាលបរិច្ឆេទចាប់ផ្តើមគណៈប្រតិភូត្រូវបានកំណត់។

source: Delegation start date is required when end date is set.
km: កាលបរិច្ឆេទចាប់ផ្តើមប្រតិភូគឺចាំបាច់នៅពេលដែលកាលបរិច្ឆេទបញ្ចប់ត្រូវបានកំណត់។

source: Delegation end date must be after start date.
km: កាលបរិច្ឆេទបញ្ចប់គណៈប្រតិភូត្រូវតែជាបន្ទាប់ពីកាលបរិច្ឆេទចាប់ផ្តើម។

source: Bachelor's Degree
km: បរិញ្ញាបត្រ

source: Master's Degree
km: សញ្ញាប័ត្រអនុបណ្ឌិត

source: Doctorate Degree
km: សញ្ញាប័ត្របណ្ឌិត

source: Undergraduate
km: បរិហ្ញាន

source: Graduate
km: ចប់ការសិកសា

source: Both Undergraduate and Graduate
km: ទាំងនិស្សិតបញ្ចប់ការសិក្សានិងបញ្ចប់ការសិក្សា

source: Teacher
km: អ្នករកុ

source: Minimum Degree Required
km: ត្រូវការអប្បបរមាអប្បបរមា

source: Minimum degree level required for teaching in this assignment
km: កំរិតសញ្ញាបត្រអប្បបរមាដែលត្រូវការសម្រាប់ការបង្រៀនក្នុងកិច្ចការនេះ

source: Authorized Teaching Levels
km: កំរិតបង្រៀនដែលមានការអនុញ្ញាត

source: Which academic levels this teacher can teach
km: កំរិតសិក្សាដែលគ្រូម្នាក់អាចបង្រៀនបាន

source: Native English Speaker
km: វាគ្មិនអង់គ្លេសដើមកំណើត

source: Allows teaching English courses with Bachelor's degree
km: អនុញ្ញាតឱ្យបង្រៀនវគ្គសិក្សាភាសាអង់គ្លេសជាមួយនឹងបរិញ្ញាបត្រ

source: Has Special Qualification
km: មានគុណវុឌ្ឍិពិសេស

source: Has special qualifications that override standard degree requirements
km: មានគុណវុឌ្ឍិពិសេសដែលបដិសេធតម្រូវការសញ្ញាបត្រស្តង់ដារ

source: Special Qualification Notes
km: កំណត់សំគាល់គុណសម្បត្តិពិសេស

source: Details about special qualifications
km: ព័ត៌មានលម្អិតអំពីគុណវុឌ្ឍិពិសេស

source: Can Approve Course Changes
km: អាចអនុម័តការផ្លាស់ប្តូរវគ្គសិក្សា

source: Whether teacher can approve course modifications
km: ថាតើគ្រូអាចអនុម័តការកែប្រែវគ្គសិក្សា

source: Is Department Coordinator
km: គឺជាអ្នកសម្របសម្រួលរបស់នាយកដ្ឋាន

source: Whether teacher serves as coordinator for this department
km: ថាតើគ្រូដើរតួជាអ្នកសម្របសម្រួលសម្រាប់នាយកដ្ឋាននេះ

source: Date when this teaching assignment began
km: កាលបរិច្ឆេទនៅពេលកិច្ចការបង្រៀននេះបានចាប់ផ្តើម

source: Date when this teaching assignment ended (leave blank for current)
km: កាលបរិច្ឆេទនៅពេលការងារបង្រៀននេះបានបញ្ចប់ (ទុកឱ្យទំនេរសម្រាប់ចរន្ត)

source: Whether this teaching assignment is currently active
km: ថាតើកិច្ចការបង្រៀននេះបច្ចុប្បន្នមានសកម្មភាព

source: Additional notes about this teaching assignment
km: កំណត់សំគាល់បន្ថែមអំពីកិច្ចការបង្រៀននេះ

source: Teaching Assignment
km: កិច្ចការបង្រៀន

source: Teaching Assignments
km: កិច្ចការបង្រៀន

source: Native English speaker qualification only applies to English departments.
km: គុណវុឌ្ឍិរបស់ភាសាអង់គ្លេសអង់គ្លេសដើមអនុវត្តតែចំពោះនាយកដ្ឋានអង់គ្លេសប៉ុណ្ណោះ។

source: Special qualification notes are required when special qualification is checked.
km: កំណត់សំគាល់គុណសម្បត្តិពិសេសត្រូវបានទាមទារនៅពេលដែលបានត្រួតពិនិត្យនូវគុណវុឌ្ឍិពិសេស។

source: Director
km: នាយក

source: Department Head
km: ប្រធាននាយកដ្ឋាន

source: Supervisor
km: អ្នករតយតរតា

source: Staff
km: សេនាធិការ

source: Parent
km: រាមត្យ

source: External User
km: អ្នកប្រើប្រាស់ខាងក្រៅ

source: Role Name
km: ឈ្មោះតួនាទី

source: Descriptive name of the role
km: ឈ្មោះពិពណ៌នានៃតួនាទី

source: Standard role type classification
km: ចំណាត់ថ្នាក់ប្រភេទតួនាទីស្តង់ដារ

source: Department this role belongs to (leave blank for global roles)
km: នាយកដ្ឋានតួនាទីនេះជារបស់ (ទុកឱ្យទទេសម្រាប់តួនាទីពិភពលោក)

source: Parent Role
km: តួនាទីរបស់ឪពុកម្តាយ

source: Parent role for permission inheritance
km: តួនាទីរបស់ឪពុកម្តាយសម្រាប់ការអនុញ្ញិសកម្មការអនុញ្ញាត

source: Can Approve
km: អាចអនុម័ត

source: Whether this role can approve requests/changes
km: ថាតើតួនាទីនេះអាចអនុម័តលើសំណើរ / ការផ្លាស់ប្តូរ

source: Can Edit
km: អាចកែសម្រួល

source: Whether this role can edit data
km: ថាតើតួនាទីនេះអាចកែសម្រួលទិន្នន័យបាន

source: Can View
km: អាចមើលបាន

source: Whether this role can view data
km: ថាតើតួនាទីនេះអាចមើលទិន្នន័យ

source: Whether this role is currently active
km: ថាតើតួនាទីនេះបច្ចុប្បន្នសកម្មបច្ចុប្បន្ន

source: Detailed description of this role's responsibilities
km: ការពិពណ៌នាលំអិតនៃទំនួលខុសត្រូវរបស់តួនាទីនេះ

source: Role
km: តួនាទី

source: Roles
km: សមតួនាទី

source: Circular parent relationship detected.
km: រកឃើញទំនាក់ទំនងឪពុកម្តាយរាងធំរាងជារង្វង់។

source: User
km: អ្នករេបី

source: Department context for this role assignment
km: បរិបទនាយកដ្ឋានសម្រាប់ការងារនេះ

source: Whether this role assignment is currently active
km: ថាតើការតួនាទីនេះបច្ចុប្បន្នកំពុងសកម្មនាពេលបច្ចុប្បន្ន

source: Assigned Date
km: កាលបរិច្ឆេទដែលបានកំណត់

source: Date when this role was assigned
km: កាលបរិច្ឆេទនៅពេលដែលតួនាទីនេះត្រូវបានចាត់តាំង

source: Additional notes about this role assignment
km: កំណត់សំគាល់បន្ថែមអំពីការតែងតាំងនេះ

source: User Role
km: តួនាទីរបស់អ្នកប្រើ

source: User Roles
km: តួនាទីរបស់អ្នកប្រើប្រាស់

source: Department is required for department-specific roles.
km: នាយកដ្ឋានត្រូវបានទាមទារសម្រាប់តួនាទីរបស់នាយកដ្ឋាន។

source: Department should not be specified for global roles.
km: នាយកដ្ឋានមិនគួរបញ្ជាក់សម្រាប់តួនាទីពិភពលោកទេ។

source: Permission Name
km: ឈ្មោះសិទ្ធិ

source: Human-readable name of the permission
km: ឈ្មោះដែលមនុស្សអាចអានបាននៃការអនុញ្ញាត

source: Codename
km: រ្ញានុតាង

source: Unique codename for programmatic access
km: ឈ្មោះកូដដែលមានតែមួយគត់សម្រាប់ការចូលប្រើកម្មវិធី

source: Content Type
km: ប្រភេទមាតិកា

source: Model this permission applies to (optional)
km: គំរូការអនុញ្ញាតនេះអនុវត្តចំពោះ (ស្រេចចិត្ត)

source: Detailed description of what this permission allows
km: ការពិពណ៌នាលំអិតនៃអ្វីដែលការអនុញ្ញាតនេះអនុញ្ញាតឱ្យមានការអនុញ្ញាត

source: Whether this permission is currently active
km: ថាតើការអនុញ្ញាតនេះសកម្មថាបច្ចុប្បន្ន

source: Permission
km: សេចក្ដីអនុហ្ញាត

source: Department scope for this permission (optional)
km: វិសាលភាពនាយកដ្ឋានសម្រាប់ការអនុញ្ញាតនេះ (ស្រេចចិត្ត)

source: Content type for object-level permissions
km: ប្រភេទមាតិកាសម្រាប់ការអនុញ្ញាតកម្រិតកំរិត

source: Object ID
km: លេខសម្គាល់វត្ថុ

source: Object ID for object-level permissions
km: លេខសម្គាល់វត្ថុសម្រាប់សិទ្ធិកម្រិតរបស់វត្ថុ

source: Whether this permission assignment is active
km: ថាតើការប្រគល់សិទ្ធិនេះសកម្មឬអត់

source: Additional notes about this permission assignment
km: កំណត់សំគាល់បន្ថែមអំពីការប្រគល់សិទ្ធិនេះ

source: Role Permission
km: ការអនុហ្ញាត្តិ

source: Role Permissions
km: សិទ្ធិតួនាទី

source: Object-level permissions require both content type and object ID.
km: សិទ្ធិកម្រិតសមត្ថភាពត្រូវការទាំងប្រភេទមាតិកានិងលេខសម្គាល់វត្ថុ។

source: Program Division
km: ការបែងចែកកម្មវិធី

source: Academic program this setting applies to
km: កម្មវិធីសិក្សាការកំណត់នេះអនុវត្តចំពោះ

source: Allows Permission Requests
km: អនុញ្ញាតឱ្យមានសំណើការអនុញ្ញាត

source: Whether students can request excused absences (IEAP=False)
km: ថាតើនិស្សិតអាចស្នើសុំអវត្តមានដែលដោះសា (iap = FALSE)

source: Auto-Approve Permissions
km: ការអនុញ្ញាតឱ្យអនុម័តដោយស្វ័យប្រវត្តិ

source: Automatically approve permission requests (High School=True)
km: អនុម័តសំណើការអនុញ្ញាតដោយស្វ័យប្រវត្តិ (វិទ្យាល័យ = ពិត)

source: Parent Notification Required
km: ទាមទារការជូនដំណឹងរបស់ឪពុកម្តាយ

source: Send permission requests to parents (High School=True)
km: ផ្ញើសំណើអនុញ្ញាតទៅឪពុកម្តាយ (វិទ្យាល័យ = ពិត)

source: Required Attendance Percentage
km: ភាគរយចូលរួមដែលត្រូវការ

source: Minimum attendance percentage required
km: ទាមទារភាគរយចូលរួមអប្បបរមា

source: Late Threshold (Minutes)
km: ពេលវេលាយឺត (នាទី)

source: Minutes after start time when LATE becomes ABSENT
km: នាទីបន្ទាប់ពីពេលវេលាចាប់ផ្តើមនៅពេលដែលបានក្លាយជាការអវត្តមាន

source: Code Window (Minutes)
km: បង្អួចកូដ (នាទី)

source: How long attendance codes remain valid
km: តើលេខកូដការងារមានរយៈពេលប៉ុន្មាន

source: Geofence Radius (Meters)
km: កាំតាម Geofance (ម៉ែត្រ)

source: Default geofence radius for attendance validation
km: កាំរស្មីរបស់ Geofance លំនាំដើមសម្រាប់សុពលភាពនៃការចូលរួម

source: Attendance Affects Grade
km: ការចូលរួមជះឥទ្ធិពលដល់ថ្នាក់ទី

source: Whether attendance impacts final grades
km: ថាតើការចូលរួមមានផលប៉ះពាល់ដល់ថ្នាក់ចុងក្រោយដែរឬទេ

source: Attendance Grade Weight
km: ទំងន់ថ្នាក់ទីខ្ពស់

source: Weight of attendance in final grade calculation
km: ទំងន់នៃការចូលរួមក្នុងការគណនាថ្នាក់ចុងក្រោយ

source: Attendance Settings
km: ការកំណត់ការចូលរួម

source: Class Part
km: ផ្នែកថ្នាក់

source: Which class component this attendance is for
km: តើសមាសភាគថ្នាក់មួយណាដែលការចូលរួមនេះគឺសម្រាប់

source: Scheduled Teacher
km: គ្រូដែលបានគ្រោងទុក

source: Originally scheduled teacher for this session
km: ដំបូងគ្រូដែលបានកំណត់ពេលសម្រាប់វគ្គនេះ

source: Substitute Teacher
km: ជំនួសអ្នកជំនួយការ

source: Teacher actually conducting this session (if different from scheduled)
km: លោកគ្រូពិតជាដឹកនាំសម័យនេះ (ប្រសិនបើខុសគ្នាពីការគ្រោងទុក)

source: Session Date
km: កាលបរិច្ឆេទសម័យ

source: Date when class session occurred
km: កាលបរិច្ឆេទនៅពេលបញ្ចប់វគ្គបានកើតឡើង

source: Actual Start Time
km: ពេលវេលាចាប់ផ្តើមពិតប្រាកដ

source: When teacher actually started class
km: នៅពេលដែលគ្រូពិតជាចាប់ផ្តើមថ្នាក់

source: Actual End Time
km: ពេលវេលាបញ្ចប់ពិតប្រាកដ

source: When teacher ended class (optional)
km: នៅពេលគ្រូបញ្ចប់ថ្នាក់ (ស្រេចចិត្ត)

source: Attendance Code
km: លេខកូដវឌ្ឍសាទ

source: 5-digit code generated by teacher's mobile app
km: លេខកូដ 5 ខ្ទង់ដែលបង្កើតដោយកម្មវិធីទូរស័ព្ទរបស់គ្រូ

source: Code Generated At
km: លេខកូដដែលបានបង្កើតនៅ

source: When teacher generated the attendance code
km: នៅពេលដែលគ្រូបានបង្កើតលេខកូដវឌ្ឍនភាព

source: Code Expires At
km: លេខកូដផុតកំណត់នៅ

source: When attendance code window closes
km: នៅពេលដែលបង្អួចលេខកូដចូលរួមបិទ

source: How long code remains valid for submissions
km: តើលេខកូដរយៈពេលប៉ុន្មាននៅតែមានសុពលភាពសម្រាប់ការដាក់ស្នើ

source: Latitude
km: វីតារន្ដរៈ

source: Teacher's latitude when starting session
km: រយៈទទឹងរបស់គ្រូនៅពេលចាប់ផ្តើមសម័យ

source: Longitude
km: តមនងចា

source: Teacher's longitude when starting session
km: រយៈបណ្តោយរបស់គ្រូនៅពេលចាប់ផ្តើមសម័យ

source: Radius for location validation
km: កាំសម្រាប់សុពលភាពទីតាំង

source: Whether attendance collection is currently active
km: ថាតើការប្រមូលការចូលរួមមានសកម្មភាពបច្ចុប្បន្ន

source: Is Makeup Class
km: គឺជាថ្នាក់តុបតែងមុខ

source: Whether this is a makeup session
km: ថាតើនេះគឺជាវគ្គតុបតែងមុខ

source: Makeup Reason
km: ហេតុផលតុបតែងមុខ

source: Reason for makeup class (if applicable)
km: ហេតុផលសម្រាប់ថ្នាក់តុបតែងមុខ (បើមាន)

source: Is Substitute Session
km: គឺជាសម័យជំនួស

source: Whether this session is being taught by a substitute teacher
km: ថាតើសម័យនេះកំពុងត្រូវបានបង្រៀនដោយគ្រូជំនួស

source: Substitute Reason
km: ហេតុផលជំនួស

source: Reason for substitute teacher (sick leave, emergency, etc.)
km: ហេតុផលសម្រាប់អ្នកជំនួយការរបស់គ្រូ (ការឈប់សម្រាកឈឺបន្ទាន់ជាដើម)

source: Substitute Assigned By
km: ជំនួសដោយ

source: User who assigned the substitute teacher
km: អ្នកប្រើដែលបានចាត់តាំងគ្រូជំនួស

source: Substitute Assigned At
km: ជំនួសដែលបានកំណត់នៅ

source: When the substitute teacher was assigned
km: នៅពេលដែលគ្រូជំនួសត្រូវបានចាត់តាំង

source: Manual Fallback Enabled
km: បានបើកការថយក្រោយដោយដៃ

source: Allow teacher manual entry if mobile fails
km: អនុញ្ញាតឱ្យធាតុដោយដៃគ្រូប្រសិនបើទូរស័ព្ទចល័តបរាជ័យ

source: Django Fallback Enabled
km: បានបើកដំណើរការ Django ថយក្រោយ

source: Allow Django admin entry if all else fails
km: អនុញ្ញាតឱ្យការចូលរដ្ឋបាល Django ប្រសិនបើអ្វីៗទាំងអស់បរាជ័យ

source: Total Students
km: និស្សិតសរុប

source: Total students enrolled in this class
km: និស្សិតសរុបបានចុះឈ្មោះចូលរៀនក្នុងថ្នាក់នេះ

source: Present Count
km: ចំនួនបច្ចុប្បន្ន

source: Number of students marked present
km: ចំនួននិស្សិតដែលបានកត់សម្គាល់បច្ចុប្បន្ន

source: Absent Count
km: រាប់ចំនួនអវត្តមាន

source: Number of students marked absent
km: ចំនួននិស្សិតដែលបានសម្គាល់អវត្តមាន

source: Attendance Session
km: វគ្គចូលរួម

source: Attendance Sessions
km: វគ្គចូលរួម

source: Substitute reason is required when substitute teacher is assigned.
km: ហេតុផលជំនួសគឺចាំបាច់នៅពេលដែលអ្នកជំនួសត្រូវបានចាត់តាំង។

source: Substitute teacher is required when marked as substitute session.
km: អ្នកជំនួយការជំនួសត្រូវបានទាមទារនៅពេលសម្គាល់ថាជាសម័យជំនួស។

source: Substitute teacher cannot be the same as the regular teacher.
km: អ្នកបង្ហាត់បង្រៀនជំនួសមិនអាចដូចគ្រូធម្មតាទេ។

source: Present
km: អមនោយ

source: Absent
km: ដេលអវត្ដមាន

source: Late
km: យឺត

source: Permission (Excused)
km: ការអនុញ្ញាត (លើកលែង)

source: Mobile App Code Entry
km: ការបញ្ចូលលេខកូដកម្មវិធីទូរស័ព្ទ

source: Teacher Manual Entry
km: ការបញ្ចូលដោយដៃគ្រូ

source: Django Admin Entry
km: Django ការបញ្ចូលរដ្ឋបាល

source: Automatically Marked Absent
km: សម្គាល់ដោយអវត្តមានដោយស្វ័យប្រវត្តិ
